apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_emac.h
/****************************************************************************
 * arch/arm/src/s32k3xx/hardware/s32k3xx_emac.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/* Copyright 2022 NXP */

#ifndef __ARCH_ARM_SRC_S32K3XX_HARDWARE_S32K3XX_EMAC_H
#define __ARCH_ARM_SRC_S32K3XX_HARDWARE_S32K3XX_EMAC_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <hardware/s32k3xx_memorymap.h>

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* EMAC Register Offsets ****************************************************/

#define S32K3XX_EMAC_MAC_CONFIGURATION_OFFSET                      (0x0000)
#define S32K3XX_EMAC_MAC_EXT_CONFIGURATION_OFFSET                  (0x0004)
#define S32K3XX_EMAC_MAC_PACKET_FILTER_OFFSET                      (0x0008)
#define S32K3XX_EMAC_MAC_WATCHDOG_TIMEOUT_OFFSET                   (0x000c)
#define S32K3XX_EMAC_MAC_HASH_TABLE_REG0_OFFSET                    (0x0010)
#define S32K3XX_EMAC_MAC_HASH_TABLE_REG1_OFFSET                    (0x0014)
#define S32K3XX_EMAC_MAC_VLAN_TAG_OFFSET                           (0x0050)
#define S32K3XX_EMAC_MAC_VLAN_TAG_CTRL_OFFSET                      (0x0050)
#define S32K3XX_EMAC_MAC_VLAN_TAG_DATA_OFFSET                      (0x0054)
#define S32K3XX_EMAC_MAC_VLAN_TAG_FILTER0_OFFSET                   (0x0054)
#define S32K3XX_EMAC_MAC_VLAN_TAG_FILTER1_OFFSET                   (0x0054)
#define S32K3XX_EMAC_MAC_VLAN_TAG_FILTER2_OFFSET                   (0x0054)
#define S32K3XX_EMAC_MAC_VLAN_TAG_FILTER3_OFFSET                   (0x0054)
#define S32K3XX_EMAC_MAC_VLAN_HASH_TABLE_OFFSET                    (0x0058)
#define S32K3XX_EMAC_MAC_VLAN_INCL_OFFSET                          (0x0060)
#define S32K3XX_EMAC_MAC_INNER_VLAN_INCL_OFFSET                    (0x0064)
#define S32K3XX_EMAC_MAC_Q0_TX_FLOW_CTRL_OFFSET                    (0x0070)
#define S32K3XX_EMAC_MAC_RX_FLOW_CTRL_OFFSET                       (0x0090)
#define S32K3XX_EMAC_MAC_RXQ_CTRL4_OFFSET                          (0x0094)
#define S32K3XX_EMAC_MAC_RXQ_CTRL0_OFFSET                          (0x00a0)
#define S32K3XX_EMAC_MAC_RXQ_CTRL1_OFFSET                          (0x00a4)
#define S32K3XX_EMAC_MAC_RXQ_CTRL2_OFFSET                          (0x00a8)
#define S32K3XX_EMAC_MAC_INTERRUPT_STATUS_OFFSET                   (0x00b0)
#define S32K3XX_EMAC_MAC_INTERRUPT_ENABLE_OFFSET                   (0x00b4)
#define S32K3XX_EMAC_MAC_RX_TX_STATUS_OFFSET                       (0x00b8)
#define S32K3XX_EMAC_MAC_VERSION_OFFSET                            (0x0110)
#define S32K3XX_EMAC_MAC_DEBUG_OFFSET                              (0x0114)
#define S32K3XX_EMAC_MAC_HW_FEATURE0_OFFSET                        (0x011c)
#define S32K3XX_EMAC_MAC_HW_FEATURE1_OFFSET                        (0x0120)
#define S32K3XX_EMAC_MAC_HW_FEATURE2_OFFSET                        (0x0124)
#define S32K3XX_EMAC_MAC_HW_FEATURE3_OFFSET                        (0x0128)
#define S32K3XX_EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_OFFSET           (0x0140)
#define S32K3XX_EMAC_MAC_FSM_CONTROL_OFFSET                        (0x0148)
#define S32K3XX_EMAC_MAC_FSM_ACT_TIMER_OFFSET                      (0x014c)
#define S32K3XX_EMAC_SCS_REG1_OFFSET                               (0x0150)
#define S32K3XX_EMAC_MAC_MDIO_ADDRESS_OFFSET                       (0x0200)
#define S32K3XX_EMAC_MAC_MDIO_DATA_OFFSET                          (0x0204)
#define S32K3XX_EMAC_MAC_CSR_SW_CTRL_OFFSET                        (0x0230)
#define S32K3XX_EMAC_MAC_FPE_CTRL_STS_OFFSET                       (0x0234)
#define S32K3XX_EMAC_MAC_PRESN_TIME_NS_OFFSET                      (0x0240)
#define S32K3XX_EMAC_MAC_PRESN_TIME_UPDT_OFFSET                    (0x0244)
#define S32K3XX_EMAC_MAC_ADDRESS0_HIGH_OFFSET                      (0x0300)
#define S32K3XX_EMAC_MAC_ADDRESS0_LOW_OFFSET                       (0x0304)
#define S32K3XX_EMAC_MAC_ADDRESS1_HIGH_OFFSET                      (0x0308)
#define S32K3XX_EMAC_MAC_ADDRESS1_LOW_OFFSET                       (0x030c)
#define S32K3XX_EMAC_MAC_ADDRESS2_HIGH_OFFSET                      (0x0310)
#define S32K3XX_EMAC_MAC_ADDRESS2_LOW_OFFSET                       (0x0314)
#define S32K3XX_EMAC_MMC_CONTROL_OFFSET                            (0x0700)
#define S32K3XX_EMAC_MMC_RX_INTERRUPT_OFFSET                       (0x0704)
#define S32K3XX_EMAC_MMC_TX_INTERRUPT_OFFSET                       (0x0708)
#define S32K3XX_EMAC_MMC_RX_INTERRUPT_MASK_OFFSET                  (0x070c)
#define S32K3XX_EMAC_MMC_TX_INTERRUPT_MASK_OFFSET                  (0x0710)
#define S32K3XX_EMAC_TX_OCTET_COUNT_GOOD_BAD_OFFSET                (0x0714)
#define S32K3XX_EMAC_TX_PACKET_COUNT_GOOD_BAD_OFFSET               (0x0718)
#define S32K3XX_EMAC_TX_BROADCAST_PACKETS_GOOD_OFFSET              (0x071c)
#define S32K3XX_EMAC_TX_MULTICAST_PACKETS_GOOD_OFFSET              (0x0720)
#define S32K3XX_EMAC_TX_64OCTETS_PACKETS_GOOD_BAD_OFFSET           (0x0724)
#define S32K3XX_EMAC_TX_65TO127OCTETS_PACKETS_GOOD_BAD_OFFSET      (0x0728)
#define S32K3XX_EMAC_TX_128TO255OCTETS_PACKETS_GOOD_BAD_OFFSET     (0x072c)
#define S32K3XX_EMAC_TX_256TO511OCTETS_PACKETS_GOOD_BAD_OFFSET     (0x0730)
#define S32K3XX_EMAC_TX_512TO1023OCTETS_PACKETS_GOOD_BAD_OFFSET    (0x0734)
#define S32K3XX_EMAC_TX_1024TOMAXOCTETS_PACKETS_GOOD_BAD_OFFSET    (0x0738)
#define S32K3XX_EMAC_TX_UNICAST_PACKETS_GOOD_BAD_OFFSET            (0x073c)
#define S32K3XX_EMAC_TX_MULTICAST_PACKETS_GOOD_BAD_OFFSET          (0x0740)
#define S32K3XX_EMAC_TX_BROADCAST_PACKETS_GOOD_BAD_OFFSET          (0x0744)
#define S32K3XX_EMAC_TX_UNDERFLOW_ERROR_PACKETS_OFFSET             (0x0748)
#define S32K3XX_EMAC_TX_SINGLE_COLLISION_GOOD_PACKETS_OFFSET       (0x074c)
#define S32K3XX_EMAC_TX_MULTIPLE_COLLISION_GOOD_PACKETS_OFFSET     (0x0750)
#define S32K3XX_EMAC_TX_DEFERRED_PACKETS_OFFSET                    (0x0754)
#define S32K3XX_EMAC_TX_LATE_COLLISION_PACKETS_OFFSET              (0x0758)
#define S32K3XX_EMAC_TX_EXCESSIVE_COLLISION_PACKETS_OFFSET         (0x075c)
#define S32K3XX_EMAC_TX_CARRIER_ERROR_PACKETS_OFFSET               (0x0760)
#define S32K3XX_EMAC_TX_OCTET_COUNT_GOOD_OFFSET                    (0x0764)
#define S32K3XX_EMAC_TX_PACKET_COUNT_GOOD_OFFSET                   (0x0768)
#define S32K3XX_EMAC_TX_EXCESSIVE_DEFERRAL_ERROR_OFFSET            (0x076c)
#define S32K3XX_EMAC_TX_PAUSE_PACKETS_OFFSET                       (0x0770)
#define S32K3XX_EMAC_TX_VLAN_PACKETS_GOOD_OFFSET                   (0x0774)
#define S32K3XX_EMAC_TX_OSIZE_PACKETS_GOOD_OFFSET                  (0x0778)
#define S32K3XX_EMAC_RX_PACKETS_COUNT_GOOD_BAD_OFFSET              (0x0780)
#define S32K3XX_EMAC_RX_OCTET_COUNT_GOOD_BAD_OFFSET                (0x0784)
#define S32K3XX_EMAC_RX_OCTET_COUNT_GOOD_OFFSET                    (0x0788)
#define S32K3XX_EMAC_RX_BROADCAST_PACKETS_GOOD_OFFSET              (0x078c)
#define S32K3XX_EMAC_RX_MULTICAST_PACKETS_GOOD_OFFSET              (0x0790)
#define S32K3XX_EMAC_RX_CRC_ERROR_PACKETS_OFFSET                   (0x0794)
#define S32K3XX_EMAC_RX_ALIGNMENT_ERROR_PACKETS_OFFSET             (0x0798)
#define S32K3XX_EMAC_RX_RUNT_ERROR_PACKETS_OFFSET                  (0x079c)
#define S32K3XX_EMAC_RX_JABBER_ERROR_PACKETS_OFFSET                (0x07a0)
#define S32K3XX_EMAC_RX_UNDERSIZE_PACKETS_GOOD_OFFSET              (0x07a4)
#define S32K3XX_EMAC_RX_OVERSIZE_PACKETS_GOOD_OFFSET               (0x07a8)
#define S32K3XX_EMAC_RX_64OCTETS_PACKETS_GOOD_BAD_OFFSET           (0x07ac)
#define S32K3XX_EMAC_RX_65TO127OCTETS_PACKETS_GOOD_BAD_OFFSET      (0x07b0)
#define S32K3XX_EMAC_RX_128TO255OCTETS_PACKETS_GOOD_BAD_OFFSET     (0x07b4)
#define S32K3XX_EMAC_RX_256TO511OCTETS_PACKETS_GOOD_BAD_OFFSET     (0x07b8)
#define S32K3XX_EMAC_RX_512TO1023OCTETS_PACKETS_GOOD_BAD_OFFSET    (0x07bc)
#define S32K3XX_EMAC_RX_1024TOMAXOCTETS_PACKETS_GOOD_BAD_OFFSET    (0x07c0)
#define S32K3XX_EMAC_RX_UNICAST_PACKETS_GOOD_OFFSET                (0x07c4)
#define S32K3XX_EMAC_RX_LENGTH_ERROR_PACKETS_OFFSET                (0x07c8)
#define S32K3XX_EMAC_RX_OUT_OF_RANGE_TYPE_PACKETS_OFFSET           (0x07cc)
#define S32K3XX_EMAC_RX_PAUSE_PACKETS_OFFSET                       (0x07d0)
#define S32K3XX_EMAC_RX_FIFO_OVERFLOW_PACKETS_OFFSET               (0x07d4)
#define S32K3XX_EMAC_RX_VLAN_PACKETS_GOOD_BAD_OFFSET               (0x07d8)
#define S32K3XX_EMAC_RX_WATCHDOG_ERROR_PACKETS_OFFSET              (0x07dc)
#define S32K3XX_EMAC_RX_RECEIVE_ERROR_PACKETS_OFFSET               (0x07e0)
#define S32K3XX_EMAC_RX_CONTROL_PACKETS_GOOD_OFFSET                (0x07e4)
#define S32K3XX_EMAC_MMC_FPE_TX_INTERRUPT_OFFSET                   (0x08a0)
#define S32K3XX_EMAC_MMC_FPE_TX_INTERRUPT_MASK_OFFSET              (0x08a4)
#define S32K3XX_EMAC_MMC_TX_FPE_FRAGMENT_CNTR_OFFSET               (0x08a8)
#define S32K3XX_EMAC_MMC_TX_HOLD_REQ_CNTR_OFFSET                   (0x08ac)
#define S32K3XX_EMAC_MMC_FPE_RX_INTERRUPT_OFFSET                   (0x08c0)
#define S32K3XX_EMAC_MMC_FPE_RX_INTERRUPT_MASK_OFFSET              (0x08c4)
#define S32K3XX_EMAC_MMC_RX_PACKET_ASSEMBLY_ERR_CNTR_OFFSET        (0x08c8)
#define S32K3XX_EMAC_MMC_RX_PACKET_SMD_ERR_CNTR_OFFSET             (0x08cc)
#define S32K3XX_EMAC_MMC_RX_PACKET_ASSEMBLY_OK_CNTR_OFFSET         (0x08d0)
#define S32K3XX_EMAC_MMC_RX_FPE_FRAGMENT_CNTR_OFFSET               (0x08d4)
#define S32K3XX_EMAC_MAC_L3_L4_CONTROL0_OFFSET                     (0x0900)
#define S32K3XX_EMAC_MAC_LAYER4_ADDRESS0_OFFSET                    (0x0904)
#define S32K3XX_EMAC_MAC_LAYER3_ADDR0_REG0_OFFSET                  (0x0910)
#define S32K3XX_EMAC_MAC_LAYER3_ADDR1_REG0_OFFSET                  (0x0914)
#define S32K3XX_EMAC_MAC_LAYER3_ADDR2_REG0_OFFSET                  (0x0918)
#define S32K3XX_EMAC_MAC_LAYER3_ADDR3_REG0_OFFSET                  (0x091c)
#define S32K3XX_EMAC_MAC_L3_L4_CONTROL1_OFFSET                     (0x0930)
#define S32K3XX_EMAC_MAC_LAYER4_ADDRESS1_OFFSET                    (0x0934)
#define S32K3XX_EMAC_MAC_LAYER3_ADDR0_REG1_OFFSET                  (0x0940)
#define S32K3XX_EMAC_MAC_LAYER3_ADDR1_REG1_OFFSET                  (0x0944)
#define S32K3XX_EMAC_MAC_LAYER3_ADDR2_REG1_OFFSET                  (0x0948)
#define S32K3XX_EMAC_MAC_LAYER3_ADDR3_REG1_OFFSET                  (0x094c)
#define S32K3XX_EMAC_MAC_L3_L4_CONTROL2_OFFSET                     (0x0960)
#define S32K3XX_EMAC_MAC_LAYER4_ADDRESS2_OFFSET                    (0x0964)
#define S32K3XX_EMAC_MAC_LAYER3_ADDR0_REG2_OFFSET                  (0x0970)
#define S32K3XX_EMAC_MAC_LAYER3_ADDR1_REG2_OFFSET                  (0x0974)
#define S32K3XX_EMAC_MAC_LAYER3_ADDR2_REG2_OFFSET                  (0x0978)
#define S32K3XX_EMAC_MAC_LAYER3_ADDR3_REG2_OFFSET                  (0x097c)
#define S32K3XX_EMAC_MAC_L3_L4_CONTROL3_OFFSET                     (0x0990)
#define S32K3XX_EMAC_MAC_LAYER4_ADDRESS3_OFFSET                    (0x0994)
#define S32K3XX_EMAC_MAC_LAYER3_ADDR0_REG3_OFFSET                  (0x09a0)
#define S32K3XX_EMAC_MAC_LAYER3_ADDR1_REG3_OFFSET                  (0x09a4)
#define S32K3XX_EMAC_MAC_LAYER3_ADDR2_REG3_OFFSET                  (0x09a8)
#define S32K3XX_EMAC_MAC_LAYER3_ADDR3_REG3_OFFSET                  (0x09ac)
#define S32K3XX_EMAC_MAC_TIMESTAMP_CONTROL_OFFSET                  (0x0b00)
#define S32K3XX_EMAC_MAC_SUB_SECOND_INCREMENT_OFFSET               (0x0b04)
#define S32K3XX_EMAC_MAC_SYSTEM_TIME_SECONDS_OFFSET                (0x0b08)
#define S32K3XX_EMAC_MAC_SYSTEM_TIME_NANOSECONDS_OFFSET            (0x0b0c)
#define S32K3XX_EMAC_MAC_SYSTEM_TIME_SECONDS_UPDATE_OFFSET         (0x0b10)
#define S32K3XX_EMAC_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_OFFSET     (0x0b14)
#define S32K3XX_EMAC_MAC_TIMESTAMP_ADDEND_OFFSET                   (0x0b18)
#define S32K3XX_EMAC_MAC_SYSTEM_TIME_HIGHER_WORD_SECONDS_OFFSET    (0x0b1c)
#define S32K3XX_EMAC_MAC_TIMESTAMP_STATUS_OFFSET                   (0x0b20)
#define S32K3XX_EMAC_MAC_TX_TIMESTAMP_STATUS_NANOSECONDS_OFFSET    (0x0b30)
#define S32K3XX_EMAC_MAC_TX_TIMESTAMP_STATUS_SECONDS_OFFSET        (0x0b34)
#define S32K3XX_EMAC_MAC_TIMESTAMP_INGRESS_ASYM_CORR_OFFSET        (0x0b50)
#define S32K3XX_EMAC_MAC_TIMESTAMP_EGRESS_ASYM_CORR_OFFSET         (0x0b54)
#define S32K3XX_EMAC_MAC_TIMESTAMP_INGRESS_CORR_NANOSECOND_OFFSET  (0x0b58)
#define S32K3XX_EMAC_MAC_TIMESTAMP_EGRESS_CORR_NANOSECOND_OFFSET   (0x0b5c)
#define S32K3XX_EMAC_MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC_OFFSET  (0x0b60)
#define S32K3XX_EMAC_MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC_OFFSET   (0x0b64)
#define S32K3XX_EMAC_MAC_TIMESTAMP_INGRESS_LATENCY_OFFSET          (0x0b68)
#define S32K3XX_EMAC_MAC_TIMESTAMP_EGRESS_LATENCY_OFFSET           (0x0b6c)
#define S32K3XX_EMAC_MAC_PPS_CONTROL_OFFSET                        (0x0b70)
#define S32K3XX_EMAC_MAC_PPS0_TARGET_TIME_SECONDS_OFFSET           (0x0b80)
#define S32K3XX_EMAC_MAC_PPS0_TARGET_TIME_NANOSECONDS_OFFSET       (0x0b84)
#define S32K3XX_EMAC_MAC_PPS0_INTERVAL_OFFSET                      (0x0b88)
#define S32K3XX_EMAC_MAC_PPS0_WIDTH_OFFSET                         (0x0b8c)
#define S32K3XX_EMAC_MAC_PPS1_TARGET_TIME_SECONDS_OFFSET           (0x0b90)
#define S32K3XX_EMAC_MAC_PPS1_TARGET_TIME_NANOSECONDS_OFFSET       (0x0b94)
#define S32K3XX_EMAC_MAC_PPS1_INTERVAL_OFFSET                      (0x0b98)
#define S32K3XX_EMAC_MAC_PPS1_WIDTH_OFFSET                         (0x0b9c)
#define S32K3XX_EMAC_MAC_PPS2_TARGET_TIME_SECONDS_OFFSET           (0x0ba0)
#define S32K3XX_EMAC_MAC_PPS2_TARGET_TIME_NANOSECONDS_OFFSET       (0x0ba4)
#define S32K3XX_EMAC_MAC_PPS2_INTERVAL_OFFSET                      (0x0ba8)
#define S32K3XX_EMAC_MAC_PPS2_WIDTH_OFFSET                         (0x0bac)
#define S32K3XX_EMAC_MAC_PPS3_TARGET_TIME_SECONDS_OFFSET           (0x0bb0)
#define S32K3XX_EMAC_MAC_PPS3_TARGET_TIME_NANOSECONDS_OFFSET       (0x0bb4)
#define S32K3XX_EMAC_MAC_PPS3_INTERVAL_OFFSET                      (0x0bb8)
#define S32K3XX_EMAC_MAC_PPS3_WIDTH_OFFSET                         (0x0bbc)
#define S32K3XX_EMAC_MTL_OPERATION_MODE_OFFSET                     (0x0c00)
#define S32K3XX_EMAC_MTL_DBG_CTL_OFFSET                            (0x0c08)
#define S32K3XX_EMAC_MTL_DBG_STS_OFFSET                            (0x0c0c)
#define S32K3XX_EMAC_MTL_FIFO_DEBUG_DATA_OFFSET                    (0x0c10)
#define S32K3XX_EMAC_MTL_INTERRUPT_STATUS_OFFSET                   (0x0c20)
#define S32K3XX_EMAC_MTL_RXQ_DMA_MAP0_OFFSET                       (0x0c30)
#define S32K3XX_EMAC_MTL_TBS_CTRL_OFFSET                           (0x0c40)
#define S32K3XX_EMAC_MTL_EST_CONTROL_OFFSET                        (0x0c50)
#define S32K3XX_EMAC_MTL_EST_STATUS_OFFSET                         (0x0c58)
#define S32K3XX_EMAC_MTL_EST_SCH_ERROR_OFFSET                      (0x0c60)
#define S32K3XX_EMAC_MTL_EST_FRM_SIZE_ERROR_OFFSET                 (0x0c64)
#define S32K3XX_EMAC_MTL_EST_FRM_SIZE_CAPTURE_OFFSET               (0x0c68)
#define S32K3XX_EMAC_MTL_EST_INTR_ENABLE_OFFSET                    (0x0c70)
#define S32K3XX_EMAC_MTL_EST_GCL_CONTROL_OFFSET                    (0x0c80)
#define S32K3XX_EMAC_MTL_EST_GCL_DATA_OFFSET                       (0x0c84)
#define S32K3XX_EMAC_MTL_FPE_CTRL_STS_OFFSET                       (0x0c90)
#define S32K3XX_EMAC_MTL_FPE_ADVANCE_OFFSET                        (0x0c94)
#define S32K3XX_EMAC_MTL_RXP_CONTROL_STATUS_OFFSET                 (0x0ca0)
#define S32K3XX_EMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_OFFSET       (0x0ca4)
#define S32K3XX_EMAC_MTL_RXP_DROP_CNT_OFFSET                       (0x0ca8)
#define S32K3XX_EMAC_MTL_RXP_ERROR_CNT_OFFSET                      (0x0cac)
#define S32K3XX_EMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_OFFSET    (0x0cb0)
#define S32K3XX_EMAC_MTL_RXP_INDIRECT_ACC_DATA_OFFSET              (0x0cb4)
#define S32K3XX_EMAC_MTL_ECC_CONTROL_OFFSET                        (0x0cc0)
#define S32K3XX_EMAC_MTL_SAFETY_INTERRUPT_STATUS_OFFSET            (0x0cc4)
#define S32K3XX_EMAC_MTL_ECC_INTERRUPT_ENABLE_OFFSET               (0x0cc8)
#define S32K3XX_EMAC_MTL_ECC_INTERRUPT_STATUS_OFFSET               (0x0ccc)
#define S32K3XX_EMAC_MTL_ECC_ERR_STS_RCTL_OFFSET                   (0x0cd0)
#define S32K3XX_EMAC_MTL_ECC_ERR_ADDR_STATUS_OFFSET                (0x0cd4)
#define S32K3XX_EMAC_MTL_ECC_ERR_CNTR_STATUS_OFFSET                (0x0cd8)
#define S32K3XX_EMAC_MTL_DPP_CONTROL_OFFSET                        (0x0ce0)
#define S32K3XX_EMAC_MTL_TXQ0_OPERATION_MODE_OFFSET                (0x0d00)
#define S32K3XX_EMAC_MTL_TXQ0_UNDERFLOW_OFFSET                     (0x0d04)
#define S32K3XX_EMAC_MTL_TXQ0_DEBUG_OFFSET                         (0x0d08)
#define S32K3XX_EMAC_MTL_TXQ0_ETS_STATUS_OFFSET                    (0x0d14)
#define S32K3XX_EMAC_MTL_TXQ0_QUANTUM_WEIGHT_OFFSET                (0x0d18)
#define S32K3XX_EMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_OFFSET        (0x0d2c)
#define S32K3XX_EMAC_MTL_RXQ0_OPERATION_MODE_OFFSET                (0x0d30)
#define S32K3XX_EMAC_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_OFFSET    (0x0d34)
#define S32K3XX_EMAC_MTL_RXQ0_DEBUG_OFFSET                         (0x0d38)
#define S32K3XX_EMAC_MTL_RXQ0_CONTROL_OFFSET                       (0x0d3c)
#define S32K3XX_EMAC_MTL_TXQ1_OPERATION_MODE_OFFSET                (0x0d40)
#define S32K3XX_EMAC_MTL_TXQ1_UNDERFLOW_OFFSET                     (0x0d44)
#define S32K3XX_EMAC_MTL_TXQ1_DEBUG_OFFSET                         (0x0d48)
#define S32K3XX_EMAC_MTL_TXQ1_ETS_CONTROL_OFFSET                   (0x0d50)
#define S32K3XX_EMAC_MTL_TXQ1_ETS_STATUS_OFFSET                    (0x0d54)
#define S32K3XX_EMAC_MTL_TXQ1_QUANTUM_WEIGHT_OFFSET                (0x0d58)
#define S32K3XX_EMAC_MTL_TXQ1_SENDSLOPECREDIT_OFFSET               (0x0d5c)
#define S32K3XX_EMAC_MTL_TXQ1_HICREDIT_OFFSET                      (0x0d60)
#define S32K3XX_EMAC_MTL_TXQ1_LOCREDIT_OFFSET                      (0x0d64)
#define S32K3XX_EMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_OFFSET        (0x0d6c)
#define S32K3XX_EMAC_MTL_RXQ1_OPERATION_MODE_OFFSET                (0x0d70)
#define S32K3XX_EMAC_MTL_RXQ1_MISSED_PACKET_OVERFLOW_CNT_OFFSET    (0x0d74)
#define S32K3XX_EMAC_MTL_RXQ1_DEBUG_OFFSET                         (0x0d78)
#define S32K3XX_EMAC_MTL_RXQ1_CONTROL_OFFSET                       (0x0d7c)
#define S32K3XX_EMAC_DMA_MODE_OFFSET                               (0x1000)
#define S32K3XX_EMAC_DMA_SYSBUS_MODE_OFFSET                        (0x1004)
#define S32K3XX_EMAC_DMA_INTERRUPT_STATUS_OFFSET                   (0x1008)
#define S32K3XX_EMAC_DMA_DEBUG_STATUS0_OFFSET                      (0x100c)
#define S32K3XX_EMAC_DMA_TBS_CTRL_OFFSET                           (0x1050)
#define S32K3XX_EMAC_DMA_SAFETY_INTERRUPT_STATUS_OFFSET            (0x1080)
#define S32K3XX_EMAC_DMA_CH0_CONTROL_OFFSET                        (0x1100)
#define S32K3XX_EMAC_DMA_CH0_TX_CONTROL_OFFSET                     (0x1104)
#define S32K3XX_EMAC_DMA_CH0_RX_CONTROL_OFFSET                     (0x1108)
#define S32K3XX_EMAC_DMA_CH0_TXDESC_LIST_ADDRESS_OFFSET            (0x1114)
#define S32K3XX_EMAC_DMA_CH0_RXDESC_LIST_ADDRESS_OFFSET            (0x111c)
#define S32K3XX_EMAC_DMA_CH0_TXDESC_TAIL_POINTER_OFFSET            (0x1120)
#define S32K3XX_EMAC_DMA_CH0_RXDESC_TAIL_POINTER_OFFSET            (0x1128)
#define S32K3XX_EMAC_DMA_CH0_TXDESC_RING_LENGTH_OFFSET             (0x112c)
#define S32K3XX_EMAC_DMA_CH0_RXDESC_RING_LENGTH_OFFSET             (0x1130)
#define S32K3XX_EMAC_DMA_CH0_INTERRUPT_ENABLE_OFFSET               (0x1134)
#define S32K3XX_EMAC_DMA_CH0_RX_INTERRUPT_WATCHDOG_TIMER_OFFSET    (0x1138)
#define S32K3XX_EMAC_DMA_CH0_SLOT_FUNCTION_CONTROL_STATUS_OFFSET   (0x113c)
#define S32K3XX_EMAC_DMA_CH0_CURRENT_APP_TXDESC_OFFSET             (0x1144)
#define S32K3XX_EMAC_DMA_CH0_CURRENT_APP_RXDESC_OFFSET             (0x114c)
#define S32K3XX_EMAC_DMA_CH0_CURRENT_APP_TXBUFFER_OFFSET           (0x1154)
#define S32K3XX_EMAC_DMA_CH0_CURRENT_APP_RXBUFFER_OFFSET           (0x115c)
#define S32K3XX_EMAC_DMA_CH0_STATUS_OFFSET                         (0x1160)
#define S32K3XX_EMAC_DMA_CH0_MISS_FRAME_CNT_OFFSET                 (0x1164)
#define S32K3XX_EMAC_DMA_CH0_RXP_ACCEPT_CNT_OFFSET                 (0x1168)
#define S32K3XX_EMAC_DMA_CH0_RX_ERI_CNT_OFFSET                     (0x116c)
#define S32K3XX_EMAC_DMA_CH1_CONTROL_OFFSET                        (0x1180)
#define S32K3XX_EMAC_DMA_CH1_TX_CONTROL_OFFSET                     (0x1184)
#define S32K3XX_EMAC_DMA_CH1_RX_CONTROL_OFFSET                     (0x1188)
#define S32K3XX_EMAC_DMA_CH1_TXDESC_LIST_ADDRESS_OFFSET            (0x1194)
#define S32K3XX_EMAC_DMA_CH1_RXDESC_LIST_ADDRESS_OFFSET            (0x119c)
#define S32K3XX_EMAC_DMA_CH1_TXDESC_TAIL_POINTER_OFFSET            (0x11a0)
#define S32K3XX_EMAC_DMA_CH1_RXDESC_TAIL_POINTER_OFFSET            (0x11a8)
#define S32K3XX_EMAC_DMA_CH1_TXDESC_RING_LENGTH_OFFSET             (0x11ac)
#define S32K3XX_EMAC_DMA_CH1_RXDESC_RING_LENGTH_OFFSET             (0x11b0)
#define S32K3XX_EMAC_DMA_CH1_INTERRUPT_ENABLE_OFFSET               (0x11b4)
#define S32K3XX_EMAC_DMA_CH1_RX_INTERRUPT_WATCHDOG_TIMER_OFFSET    (0x11b8)
#define S32K3XX_EMAC_DMA_CH1_SLOT_FUNCTION_CONTROL_STATUS_OFFSET   (0x11bc)
#define S32K3XX_EMAC_DMA_CH1_CURRENT_APP_TXDESC_OFFSET             (0x11c4)
#define S32K3XX_EMAC_DMA_CH1_CURRENT_APP_RXDESC_OFFSET             (0x11cc)
#define S32K3XX_EMAC_DMA_CH1_CURRENT_APP_TXBUFFER_OFFSET           (0x11d4)
#define S32K3XX_EMAC_DMA_CH1_CURRENT_APP_RXBUFFER_OFFSET           (0x11dc)
#define S32K3XX_EMAC_DMA_CH1_STATUS_OFFSET                         (0x11e0)
#define S32K3XX_EMAC_DMA_CH1_MISS_FRAME_CNT_OFFSET                 (0x11e4)
#define S32K3XX_EMAC_DMA_CH1_RXP_ACCEPT_CNT_OFFSET                 (0x11e8)
#define S32K3XX_EMAC_DMA_CH1_RX_ERI_CNT_OFFSET                     (0x11ec)

/* EMAC Register Addresses **************************************************/

