apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_emac.h
#define S32K3XX_EMAC_MAC_CONFIGURATION                      (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_CONFIGURATION_OFFSET)
#define S32K3XX_EMAC_MAC_EXT_CONFIGURATION                  (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_EXT_CONFIGURATION_OFFSET)
#define S32K3XX_EMAC_MAC_PACKET_FILTER                      (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_PACKET_FILTER_OFFSET)
#define S32K3XX_EMAC_MAC_WATCHDOG_TIMEOUT                   (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_WATCHDOG_TIMEOUT_OFFSET)
#define S32K3XX_EMAC_MAC_HASH_TABLE_REG0                    (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_HASH_TABLE_REG0_OFFSET)
#define S32K3XX_EMAC_MAC_HASH_TABLE_REG1                    (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_HASH_TABLE_REG1_OFFSET)
#define S32K3XX_EMAC_MAC_VLAN_TAG                           (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_VLAN_TAG_OFFSET)
#define S32K3XX_EMAC_MAC_VLAN_TAG_CTRL                      (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_VLAN_TAG_CTRL_OFFSET)
#define S32K3XX_EMAC_MAC_VLAN_TAG_DATA                      (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_VLAN_TAG_DATA_OFFSET)
#define S32K3XX_EMAC_MAC_VLAN_TAG_FILTER0                   (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_VLAN_TAG_FILTER0_OFFSET)
#define S32K3XX_EMAC_MAC_VLAN_TAG_FILTER1                   (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_VLAN_TAG_FILTER1_OFFSET)
#define S32K3XX_EMAC_MAC_VLAN_TAG_FILTER2                   (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_VLAN_TAG_FILTER2_OFFSET)
#define S32K3XX_EMAC_MAC_VLAN_TAG_FILTER3                   (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_VLAN_TAG_FILTER3_OFFSET)
#define S32K3XX_EMAC_MAC_VLAN_HASH_TABLE                    (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_VLAN_HASH_TABLE_OFFSET)
#define S32K3XX_EMAC_MAC_VLAN_INCL                          (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_VLAN_INCL_OFFSET)
#define S32K3XX_EMAC_MAC_INNER_VLAN_INCL                    (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_INNER_VLAN_INCL_OFFSET)
#define S32K3XX_EMAC_MAC_Q0_TX_FLOW_CTRL                    (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_Q0_TX_FLOW_CTRL_OFFSET)
#define S32K3XX_EMAC_MAC_RX_FLOW_CTRL                       (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_RX_FLOW_CTRL_OFFSET)
#define S32K3XX_EMAC_MAC_RXQ_CTRL4                          (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_RXQ_CTRL4_OFFSET)
#define S32K3XX_EMAC_MAC_RXQ_CTRL0                          (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_RXQ_CTRL0_OFFSET)
#define S32K3XX_EMAC_MAC_RXQ_CTRL1                          (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_RXQ_CTRL1_OFFSET)
#define S32K3XX_EMAC_MAC_RXQ_CTRL2                          (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_RXQ_CTRL2_OFFSET)
#define S32K3XX_EMAC_MAC_INTERRUPT_STATUS                   (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_INTERRUPT_STATUS_OFFSET)
#define S32K3XX_EMAC_MAC_INTERRUPT_ENABLE                   (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_INTERRUPT_ENABLE_OFFSET)
#define S32K3XX_EMAC_MAC_RX_TX_STATUS                       (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_RX_TX_STATUS_OFFSET)
#define S32K3XX_EMAC_MAC_VERSION                            (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_VERSION_OFFSET)
#define S32K3XX_EMAC_MAC_DEBUG                              (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_DEBUG_OFFSET)
#define S32K3XX_EMAC_MAC_HW_FEATURE0                        (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_HW_FEATURE0_OFFSET)
#define S32K3XX_EMAC_MAC_HW_FEATURE1                        (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_HW_FEATURE1_OFFSET)
#define S32K3XX_EMAC_MAC_HW_FEATURE2                        (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_HW_FEATURE2_OFFSET)
#define S32K3XX_EMAC_MAC_HW_FEATURE3                        (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_HW_FEATURE3_OFFSET)
#define S32K3XX_EMAC_MAC_DPP_FSM_INTERRUPT_STATUS           (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_OFFSET)
#define S32K3XX_EMAC_MAC_FSM_CONTROL                        (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_FSM_CONTROL_OFFSET)
#define S32K3XX_EMAC_MAC_FSM_ACT_TIMER                      (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_FSM_ACT_TIMER_OFFSET)
#define S32K3XX_EMAC_SCS_REG1                               (S32K3XX_EMAC_BASE + S32K3XX_EMAC_SCS_REG1_OFFSET)
#define S32K3XX_EMAC_MAC_MDIO_ADDRESS                       (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_MDIO_ADDRESS_OFFSET)
#define S32K3XX_EMAC_MAC_MDIO_DATA                          (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_MDIO_DATA_OFFSET)
#define S32K3XX_EMAC_MAC_CSR_SW_CTRL                        (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_CSR_SW_CTRL_OFFSET)
#define S32K3XX_EMAC_MAC_FPE_CTRL_STS                       (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_FPE_CTRL_STS_OFFSET)
#define S32K3XX_EMAC_MAC_PRESN_TIME_NS                      (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_PRESN_TIME_NS_OFFSET)
#define S32K3XX_EMAC_MAC_PRESN_TIME_UPDT                    (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_PRESN_TIME_UPDT_OFFSET)
#define S32K3XX_EMAC_MAC_ADDRESS0_HIGH                      (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_ADDRESS0_HIGH_OFFSET)
#define S32K3XX_EMAC_MAC_ADDRESS0_LOW                       (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_ADDRESS0_LOW_OFFSET)
#define S32K3XX_EMAC_MAC_ADDRESS1_HIGH                      (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_ADDRESS1_HIGH_OFFSET)
#define S32K3XX_EMAC_MAC_ADDRESS1_LOW                       (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_ADDRESS1_LOW_OFFSET)
#define S32K3XX_EMAC_MAC_ADDRESS2_HIGH                      (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_ADDRESS2_HIGH_OFFSET)
#define S32K3XX_EMAC_MAC_ADDRESS2_LOW                       (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_ADDRESS2_LOW_OFFSET)
#define S32K3XX_EMAC_MMC_CONTROL                            (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MMC_CONTROL_OFFSET)
#define S32K3XX_EMAC_MMC_RX_INTERRUPT                       (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MMC_RX_INTERRUPT_OFFSET)
#define S32K3XX_EMAC_MMC_TX_INTERRUPT                       (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MMC_TX_INTERRUPT_OFFSET)
#define S32K3XX_EMAC_MMC_RX_INTERRUPT_MASK                  (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MMC_RX_INTERRUPT_MASK_OFFSET)
#define S32K3XX_EMAC_MMC_TX_INTERRUPT_MASK                  (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MMC_TX_INTERRUPT_MASK_OFFSET)
#define S32K3XX_EMAC_TX_OCTET_COUNT_GOOD_BAD                (S32K3XX_EMAC_BASE + S32K3XX_EMAC_TX_OCTET_COUNT_GOOD_BAD_OFFSET)
#define S32K3XX_EMAC_TX_PACKET_COUNT_GOOD_BAD               (S32K3XX_EMAC_BASE + S32K3XX_EMAC_TX_PACKET_COUNT_GOOD_BAD_OFFSET)
#define S32K3XX_EMAC_TX_BROADCAST_PACKETS_GOOD              (S32K3XX_EMAC_BASE + S32K3XX_EMAC_TX_BROADCAST_PACKETS_GOOD_OFFSET)
#define S32K3XX_EMAC_TX_MULTICAST_PACKETS_GOOD              (S32K3XX_EMAC_BASE + S32K3XX_EMAC_TX_MULTICAST_PACKETS_GOOD_OFFSET)
#define S32K3XX_EMAC_TX_64OCTETS_PACKETS_GOOD_BAD           (S32K3XX_EMAC_BASE + S32K3XX_EMAC_TX_64OCTETS_PACKETS_GOOD_BAD_OFFSET)
#define S32K3XX_EMAC_TX_65TO127OCTETS_PACKETS_GOOD_BAD      (S32K3XX_EMAC_BASE + S32K3XX_EMAC_TX_65TO127OCTETS_PACKETS_GOOD_BAD_OFFSET)
#define S32K3XX_EMAC_TX_128TO255OCTETS_PACKETS_GOOD_BAD     (S32K3XX_EMAC_BASE + S32K3XX_EMAC_TX_128TO255OCTETS_PACKETS_GOOD_BAD_OFFSET)
#define S32K3XX_EMAC_TX_256TO511OCTETS_PACKETS_GOOD_BAD     (S32K3XX_EMAC_BASE + S32K3XX_EMAC_TX_256TO511OCTETS_PACKETS_GOOD_BAD_OFFSET)
#define S32K3XX_EMAC_TX_512TO1023OCTETS_PACKETS_GOOD_BAD    (S32K3XX_EMAC_BASE + S32K3XX_EMAC_TX_512TO1023OCTETS_PACKETS_GOOD_BAD_OFFSET)
#define S32K3XX_EMAC_TX_1024TOMAXOCTETS_PACKETS_GOOD_BAD    (S32K3XX_EMAC_BASE + S32K3XX_EMAC_TX_1024TOMAXOCTETS_PACKETS_GOOD_BAD_OFFSET)
#define S32K3XX_EMAC_TX_UNICAST_PACKETS_GOOD_BAD            (S32K3XX_EMAC_BASE + S32K3XX_EMAC_TX_UNICAST_PACKETS_GOOD_BAD_OFFSET)
#define S32K3XX_EMAC_TX_MULTICAST_PACKETS_GOOD_BAD          (S32K3XX_EMAC_BASE + S32K3XX_EMAC_TX_MULTICAST_PACKETS_GOOD_BAD_OFFSET)
#define S32K3XX_EMAC_TX_BROADCAST_PACKETS_GOOD_BAD          (S32K3XX_EMAC_BASE + S32K3XX_EMAC_TX_BROADCAST_PACKETS_GOOD_BAD_OFFSET)
#define S32K3XX_EMAC_TX_UNDERFLOW_ERROR_PACKETS             (S32K3XX_EMAC_BASE + S32K3XX_EMAC_TX_UNDERFLOW_ERROR_PACKETS_OFFSET)
#define S32K3XX_EMAC_TX_SINGLE_COLLISION_GOOD_PACKETS       (S32K3XX_EMAC_BASE + S32K3XX_EMAC_TX_SINGLE_COLLISION_GOOD_PACKETS_OFFSET)
#define S32K3XX_EMAC_TX_MULTIPLE_COLLISION_GOOD_PACKETS     (S32K3XX_EMAC_BASE + S32K3XX_EMAC_TX_MULTIPLE_COLLISION_GOOD_PACKETS_OFFSET)
#define S32K3XX_EMAC_TX_DEFERRED_PACKETS                    (S32K3XX_EMAC_BASE + S32K3XX_EMAC_TX_DEFERRED_PACKETS_OFFSET)
#define S32K3XX_EMAC_TX_LATE_COLLISION_PACKETS              (S32K3XX_EMAC_BASE + S32K3XX_EMAC_TX_LATE_COLLISION_PACKETS_OFFSET)
#define S32K3XX_EMAC_TX_EXCESSIVE_COLLISION_PACKETS         (S32K3XX_EMAC_BASE + S32K3XX_EMAC_TX_EXCESSIVE_COLLISION_PACKETS_OFFSET)
#define S32K3XX_EMAC_TX_CARRIER_ERROR_PACKETS               (S32K3XX_EMAC_BASE + S32K3XX_EMAC_TX_CARRIER_ERROR_PACKETS_OFFSET)
#define S32K3XX_EMAC_TX_OCTET_COUNT_GOOD                    (S32K3XX_EMAC_BASE + S32K3XX_EMAC_TX_OCTET_COUNT_GOOD_OFFSET)
#define S32K3XX_EMAC_TX_PACKET_COUNT_GOOD                   (S32K3XX_EMAC_BASE + S32K3XX_EMAC_TX_PACKET_COUNT_GOOD_OFFSET)
#define S32K3XX_EMAC_TX_EXCESSIVE_DEFERRAL_ERROR            (S32K3XX_EMAC_BASE + S32K3XX_EMAC_TX_EXCESSIVE_DEFERRAL_ERROR_OFFSET)
#define S32K3XX_EMAC_TX_PAUSE_PACKETS                       (S32K3XX_EMAC_BASE + S32K3XX_EMAC_TX_PAUSE_PACKETS_OFFSET)
#define S32K3XX_EMAC_TX_VLAN_PACKETS_GOOD                   (S32K3XX_EMAC_BASE + S32K3XX_EMAC_TX_VLAN_PACKETS_GOOD_OFFSET)
#define S32K3XX_EMAC_TX_OSIZE_PACKETS_GOOD                  (S32K3XX_EMAC_BASE + S32K3XX_EMAC_TX_OSIZE_PACKETS_GOOD_OFFSET)
#define S32K3XX_EMAC_RX_PACKETS_COUNT_GOOD_BAD              (S32K3XX_EMAC_BASE + S32K3XX_EMAC_RX_PACKETS_COUNT_GOOD_BAD_OFFSET)
#define S32K3XX_EMAC_RX_OCTET_COUNT_GOOD_BAD                (S32K3XX_EMAC_BASE + S32K3XX_EMAC_RX_OCTET_COUNT_GOOD_BAD_OFFSET)
#define S32K3XX_EMAC_RX_OCTET_COUNT_GOOD                    (S32K3XX_EMAC_BASE + S32K3XX_EMAC_RX_OCTET_COUNT_GOOD_OFFSET)
#define S32K3XX_EMAC_RX_BROADCAST_PACKETS_GOOD              (S32K3XX_EMAC_BASE + S32K3XX_EMAC_RX_BROADCAST_PACKETS_GOOD_OFFSET)
#define S32K3XX_EMAC_RX_MULTICAST_PACKETS_GOOD              (S32K3XX_EMAC_BASE + S32K3XX_EMAC_RX_MULTICAST_PACKETS_GOOD_OFFSET)
#define S32K3XX_EMAC_RX_CRC_ERROR_PACKETS                   (S32K3XX_EMAC_BASE + S32K3XX_EMAC_RX_CRC_ERROR_PACKETS_OFFSET)
#define S32K3XX_EMAC_RX_ALIGNMENT_ERROR_PACKETS             (S32K3XX_EMAC_BASE + S32K3XX_EMAC_RX_ALIGNMENT_ERROR_PACKETS_OFFSET)
#define S32K3XX_EMAC_RX_RUNT_ERROR_PACKETS                  (S32K3XX_EMAC_BASE + S32K3XX_EMAC_RX_RUNT_ERROR_PACKETS_OFFSET)
#define S32K3XX_EMAC_RX_JABBER_ERROR_PACKETS                (S32K3XX_EMAC_BASE + S32K3XX_EMAC_RX_JABBER_ERROR_PACKETS_OFFSET)
#define S32K3XX_EMAC_RX_UNDERSIZE_PACKETS_GOOD              (S32K3XX_EMAC_BASE + S32K3XX_EMAC_RX_UNDERSIZE_PACKETS_GOOD_OFFSET)
#define S32K3XX_EMAC_RX_OVERSIZE_PACKETS_GOOD               (S32K3XX_EMAC_BASE + S32K3XX_EMAC_RX_OVERSIZE_PACKETS_GOOD_OFFSET)
#define S32K3XX_EMAC_RX_64OCTETS_PACKETS_GOOD_BAD           (S32K3XX_EMAC_BASE + S32K3XX_EMAC_RX_64OCTETS_PACKETS_GOOD_BAD_OFFSET)
#define S32K3XX_EMAC_RX_65TO127OCTETS_PACKETS_GOOD_BAD      (S32K3XX_EMAC_BASE + S32K3XX_EMAC_RX_65TO127OCTETS_PACKETS_GOOD_BAD_OFFSET)
#define S32K3XX_EMAC_RX_128TO255OCTETS_PACKETS_GOOD_BAD     (S32K3XX_EMAC_BASE + S32K3XX_EMAC_RX_128TO255OCTETS_PACKETS_GOOD_BAD_OFFSET)
#define S32K3XX_EMAC_RX_256TO511OCTETS_PACKETS_GOOD_BAD     (S32K3XX_EMAC_BASE + S32K3XX_EMAC_RX_256TO511OCTETS_PACKETS_GOOD_BAD_OFFSET)
#define S32K3XX_EMAC_RX_512TO1023OCTETS_PACKETS_GOOD_BAD    (S32K3XX_EMAC_BASE + S32K3XX_EMAC_RX_512TO1023OCTETS_PACKETS_GOOD_BAD_OFFSET)
#define S32K3XX_EMAC_RX_1024TOMAXOCTETS_PACKETS_GOOD_BAD    (S32K3XX_EMAC_BASE + S32K3XX_EMAC_RX_1024TOMAXOCTETS_PACKETS_GOOD_BAD_OFFSET)
#define S32K3XX_EMAC_RX_UNICAST_PACKETS_GOOD                (S32K3XX_EMAC_BASE + S32K3XX_EMAC_RX_UNICAST_PACKETS_GOOD_OFFSET)
#define S32K3XX_EMAC_RX_LENGTH_ERROR_PACKETS                (S32K3XX_EMAC_BASE + S32K3XX_EMAC_RX_LENGTH_ERROR_PACKETS_OFFSET)
#define S32K3XX_EMAC_RX_OUT_OF_RANGE_TYPE_PACKETS           (S32K3XX_EMAC_BASE + S32K3XX_EMAC_RX_OUT_OF_RANGE_TYPE_PACKETS_OFFSET)
#define S32K3XX_EMAC_RX_PAUSE_PACKETS                       (S32K3XX_EMAC_BASE + S32K3XX_EMAC_RX_PAUSE_PACKETS_OFFSET)
#define S32K3XX_EMAC_RX_FIFO_OVERFLOW_PACKETS               (S32K3XX_EMAC_BASE + S32K3XX_EMAC_RX_FIFO_OVERFLOW_PACKETS_OFFSET)
#define S32K3XX_EMAC_RX_VLAN_PACKETS_GOOD_BAD               (S32K3XX_EMAC_BASE + S32K3XX_EMAC_RX_VLAN_PACKETS_GOOD_BAD_OFFSET)
#define S32K3XX_EMAC_RX_WATCHDOG_ERROR_PACKETS              (S32K3XX_EMAC_BASE + S32K3XX_EMAC_RX_WATCHDOG_ERROR_PACKETS_OFFSET)
#define S32K3XX_EMAC_RX_RECEIVE_ERROR_PACKETS               (S32K3XX_EMAC_BASE + S32K3XX_EMAC_RX_RECEIVE_ERROR_PACKETS_OFFSET)
#define S32K3XX_EMAC_RX_CONTROL_PACKETS_GOOD                (S32K3XX_EMAC_BASE + S32K3XX_EMAC_RX_CONTROL_PACKETS_GOOD_OFFSET)
#define S32K3XX_EMAC_MMC_FPE_TX_INTERRUPT                   (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MMC_FPE_TX_INTERRUPT_OFFSET)
#define S32K3XX_EMAC_MMC_FPE_TX_INTERRUPT_MASK              (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MMC_FPE_TX_INTERRUPT_MASK_OFFSET)
#define S32K3XX_EMAC_MMC_TX_FPE_FRAGMENT_CNTR               (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MMC_TX_FPE_FRAGMENT_CNTR_OFFSET)
#define S32K3XX_EMAC_MMC_TX_HOLD_REQ_CNTR                   (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MMC_TX_HOLD_REQ_CNTR_OFFSET)
#define S32K3XX_EMAC_MMC_FPE_RX_INTERRUPT                   (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MMC_FPE_RX_INTERRUPT_OFFSET)
#define S32K3XX_EMAC_MMC_FPE_RX_INTERRUPT_MASK              (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MMC_FPE_RX_INTERRUPT_MASK_OFFSET)
#define S32K3XX_EMAC_MMC_RX_PACKET_ASSEMBLY_ERR_CNTR        (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MMC_RX_PACKET_ASSEMBLY_ERR_CNTR_OFFSET)
#define S32K3XX_EMAC_MMC_RX_PACKET_SMD_ERR_CNTR             (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MMC_RX_PACKET_SMD_ERR_CNTR_OFFSET)
#define S32K3XX_EMAC_MMC_RX_PACKET_ASSEMBLY_OK_CNTR         (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MMC_RX_PACKET_ASSEMBLY_OK_CNTR_OFFSET)
#define S32K3XX_EMAC_MMC_RX_FPE_FRAGMENT_CNTR               (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MMC_RX_FPE_FRAGMENT_CNTR_OFFSET)
#define S32K3XX_EMAC_MAC_L3_L4_CONTROL0                     (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_L3_L4_CONTROL0_OFFSET)
#define S32K3XX_EMAC_MAC_LAYER4_ADDRESS0                    (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_LAYER4_ADDRESS0_OFFSET)
#define S32K3XX_EMAC_MAC_LAYER3_ADDR0_REG0                  (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_LAYER3_ADDR0_REG0_OFFSET)
#define S32K3XX_EMAC_MAC_LAYER3_ADDR1_REG0                  (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_LAYER3_ADDR1_REG0_OFFSET)
#define S32K3XX_EMAC_MAC_LAYER3_ADDR2_REG0                  (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_LAYER3_ADDR2_REG0_OFFSET)
#define S32K3XX_EMAC_MAC_LAYER3_ADDR3_REG0                  (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_LAYER3_ADDR3_REG0_OFFSET)
#define S32K3XX_EMAC_MAC_L3_L4_CONTROL1                     (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_L3_L4_CONTROL1_OFFSET)
#define S32K3XX_EMAC_MAC_LAYER4_ADDRESS1                    (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_LAYER4_ADDRESS1_OFFSET)
#define S32K3XX_EMAC_MAC_LAYER3_ADDR0_REG1                  (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_LAYER3_ADDR0_REG1_OFFSET)
#define S32K3XX_EMAC_MAC_LAYER3_ADDR1_REG1                  (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_LAYER3_ADDR1_REG1_OFFSET)
#define S32K3XX_EMAC_MAC_LAYER3_ADDR2_REG1                  (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_LAYER3_ADDR2_REG1_OFFSET)
#define S32K3XX_EMAC_MAC_LAYER3_ADDR3_REG1                  (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_LAYER3_ADDR3_REG1_OFFSET)
#define S32K3XX_EMAC_MAC_L3_L4_CONTROL2                     (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_L3_L4_CONTROL2_OFFSET)
#define S32K3XX_EMAC_MAC_LAYER4_ADDRESS2                    (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_LAYER4_ADDRESS2_OFFSET)
#define S32K3XX_EMAC_MAC_LAYER3_ADDR0_REG2                  (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_LAYER3_ADDR0_REG2_OFFSET)
#define S32K3XX_EMAC_MAC_LAYER3_ADDR1_REG2                  (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_LAYER3_ADDR1_REG2_OFFSET)
#define S32K3XX_EMAC_MAC_LAYER3_ADDR2_REG2                  (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_LAYER3_ADDR2_REG2_OFFSET)
#define S32K3XX_EMAC_MAC_LAYER3_ADDR3_REG2                  (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_LAYER3_ADDR3_REG2_OFFSET)
#define S32K3XX_EMAC_MAC_L3_L4_CONTROL3                     (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_L3_L4_CONTROL3_OFFSET)
#define S32K3XX_EMAC_MAC_LAYER4_ADDRESS3                    (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_LAYER4_ADDRESS3_OFFSET)
#define S32K3XX_EMAC_MAC_LAYER3_ADDR0_REG3                  (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_LAYER3_ADDR0_REG3_OFFSET)
#define S32K3XX_EMAC_MAC_LAYER3_ADDR1_REG3                  (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_LAYER3_ADDR1_REG3_OFFSET)
#define S32K3XX_EMAC_MAC_LAYER3_ADDR2_REG3                  (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_LAYER3_ADDR2_REG3_OFFSET)
#define S32K3XX_EMAC_MAC_LAYER3_ADDR3_REG3                  (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_LAYER3_ADDR3_REG3_OFFSET)
#define S32K3XX_EMAC_MAC_TIMESTAMP_CONTROL                  (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_TIMESTAMP_CONTROL_OFFSET)
#define S32K3XX_EMAC_MAC_SUB_SECOND_INCREMENT               (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_SUB_SECOND_INCREMENT_OFFSET)
#define S32K3XX_EMAC_MAC_SYSTEM_TIME_SECONDS                (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_SYSTEM_TIME_SECONDS_OFFSET)
#define S32K3XX_EMAC_MAC_SYSTEM_TIME_NANOSECONDS            (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_SYSTEM_TIME_NANOSECONDS_OFFSET)
#define S32K3XX_EMAC_MAC_SYSTEM_TIME_SECONDS_UPDATE         (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_SYSTEM_TIME_SECONDS_UPDATE_OFFSET)
#define S32K3XX_EMAC_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE     (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_OFFSET)
#define S32K3XX_EMAC_MAC_TIMESTAMP_ADDEND                   (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_TIMESTAMP_ADDEND_OFFSET)
#define S32K3XX_EMAC_MAC_SYSTEM_TIME_HIGHER_WORD_SECONDS    (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_SYSTEM_TIME_HIGHER_WORD_SECONDS_OFFSET)
#define S32K3XX_EMAC_MAC_TIMESTAMP_STATUS                   (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_TIMESTAMP_STATUS_OFFSET)
#define S32K3XX_EMAC_MAC_TX_TIMESTAMP_STATUS_NANOSECONDS    (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_TX_TIMESTAMP_STATUS_NANOSECONDS_OFFSET)
#define S32K3XX_EMAC_MAC_TX_TIMESTAMP_STATUS_SECONDS        (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_TX_TIMESTAMP_STATUS_SECONDS_OFFSET)
#define S32K3XX_EMAC_MAC_TIMESTAMP_INGRESS_ASYM_CORR        (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_TIMESTAMP_INGRESS_ASYM_CORR_OFFSET)
#define S32K3XX_EMAC_MAC_TIMESTAMP_EGRESS_ASYM_CORR         (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_TIMESTAMP_EGRESS_ASYM_CORR_OFFSET)
#define S32K3XX_EMAC_MAC_TIMESTAMP_INGRESS_CORR_NANOSECOND  (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_TIMESTAMP_INGRESS_CORR_NANOSECOND_OFFSET)
#define S32K3XX_EMAC_MAC_TIMESTAMP_EGRESS_CORR_NANOSECOND   (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_TIMESTAMP_EGRESS_CORR_NANOSECOND_OFFSET)
#define S32K3XX_EMAC_MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC  (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC_OFFSET)
#define S32K3XX_EMAC_MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC   (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC_OFFSET)
#define S32K3XX_EMAC_MAC_TIMESTAMP_INGRESS_LATENCY          (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_TIMESTAMP_INGRESS_LATENCY_OFFSET)
#define S32K3XX_EMAC_MAC_TIMESTAMP_EGRESS_LATENCY           (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_TIMESTAMP_EGRESS_LATENCY_OFFSET)
#define S32K3XX_EMAC_MAC_PPS_CONTROL                        (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_PPS_CONTROL_OFFSET)
#define S32K3XX_EMAC_MAC_PPS0_TARGET_TIME_SECONDS           (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_PPS0_TARGET_TIME_SECONDS_OFFSET)
#define S32K3XX_EMAC_MAC_PPS0_TARGET_TIME_NANOSECONDS       (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_PPS0_TARGET_TIME_NANOSECONDS_OFFSET)
#define S32K3XX_EMAC_MAC_PPS0_INTERVAL                      (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_PPS0_INTERVAL_OFFSET)
#define S32K3XX_EMAC_MAC_PPS0_WIDTH                         (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_PPS0_WIDTH_OFFSET)
#define S32K3XX_EMAC_MAC_PPS1_TARGET_TIME_SECONDS           (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_PPS1_TARGET_TIME_SECONDS_OFFSET)
#define S32K3XX_EMAC_MAC_PPS1_TARGET_TIME_NANOSECONDS       (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_PPS1_TARGET_TIME_NANOSECONDS_OFFSET)
#define S32K3XX_EMAC_MAC_PPS1_INTERVAL                      (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_PPS1_INTERVAL_OFFSET)
#define S32K3XX_EMAC_MAC_PPS1_WIDTH                         (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_PPS1_WIDTH_OFFSET)
#define S32K3XX_EMAC_MAC_PPS2_TARGET_TIME_SECONDS           (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_PPS2_TARGET_TIME_SECONDS_OFFSET)
#define S32K3XX_EMAC_MAC_PPS2_TARGET_TIME_NANOSECONDS       (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_PPS2_TARGET_TIME_NANOSECONDS_OFFSET)
#define S32K3XX_EMAC_MAC_PPS2_INTERVAL                      (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_PPS2_INTERVAL_OFFSET)
#define S32K3XX_EMAC_MAC_PPS2_WIDTH                         (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_PPS2_WIDTH_OFFSET)
#define S32K3XX_EMAC_MAC_PPS3_TARGET_TIME_SECONDS           (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_PPS3_TARGET_TIME_SECONDS_OFFSET)
#define S32K3XX_EMAC_MAC_PPS3_TARGET_TIME_NANOSECONDS       (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_PPS3_TARGET_TIME_NANOSECONDS_OFFSET)
#define S32K3XX_EMAC_MAC_PPS3_INTERVAL                      (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_PPS3_INTERVAL_OFFSET)
#define S32K3XX_EMAC_MAC_PPS3_WIDTH                         (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MAC_PPS3_WIDTH_OFFSET)
#define S32K3XX_EMAC_MTL_OPERATION_MODE                     (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_OPERATION_MODE_OFFSET)
#define S32K3XX_EMAC_MTL_DBG_CTL                            (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_DBG_CTL_OFFSET)
#define S32K3XX_EMAC_MTL_DBG_STS                            (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_DBG_STS_OFFSET)
#define S32K3XX_EMAC_MTL_FIFO_DEBUG_DATA                    (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_FIFO_DEBUG_DATA_OFFSET)
#define S32K3XX_EMAC_MTL_INTERRUPT_STATUS                   (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_INTERRUPT_STATUS_OFFSET)
#define S32K3XX_EMAC_MTL_RXQ_DMA_MAP0                       (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_RXQ_DMA_MAP0_OFFSET)
#define S32K3XX_EMAC_MTL_TBS_CTRL                           (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_TBS_CTRL_OFFSET)
#define S32K3XX_EMAC_MTL_EST_CONTROL                        (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_EST_CONTROL_OFFSET)
#define S32K3XX_EMAC_MTL_EST_STATUS                         (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_EST_STATUS_OFFSET)
#define S32K3XX_EMAC_MTL_EST_SCH_ERROR                      (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_EST_SCH_ERROR_OFFSET)
#define S32K3XX_EMAC_MTL_EST_FRM_SIZE_ERROR                 (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_EST_FRM_SIZE_ERROR_OFFSET)
#define S32K3XX_EMAC_MTL_EST_FRM_SIZE_CAPTURE               (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_EST_FRM_SIZE_CAPTURE_OFFSET)
#define S32K3XX_EMAC_MTL_EST_INTR_ENABLE                    (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_EST_INTR_ENABLE_OFFSET)
#define S32K3XX_EMAC_MTL_EST_GCL_CONTROL                    (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_EST_GCL_CONTROL_OFFSET)
#define S32K3XX_EMAC_MTL_EST_GCL_DATA                       (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_EST_GCL_DATA_OFFSET)
#define S32K3XX_EMAC_MTL_FPE_CTRL_STS                       (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_FPE_CTRL_STS_OFFSET)
#define S32K3XX_EMAC_MTL_FPE_ADVANCE                        (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_FPE_ADVANCE_OFFSET)
#define S32K3XX_EMAC_MTL_RXP_CONTROL_STATUS                 (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_RXP_CONTROL_STATUS_OFFSET)
