apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_emac.h
#define S32K3XX_EMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS       (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_OFFSET)
#define S32K3XX_EMAC_MTL_RXP_DROP_CNT                       (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_RXP_DROP_CNT_OFFSET)
#define S32K3XX_EMAC_MTL_RXP_ERROR_CNT                      (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_RXP_ERROR_CNT_OFFSET)
#define S32K3XX_EMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS    (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_OFFSET)
#define S32K3XX_EMAC_MTL_RXP_INDIRECT_ACC_DATA              (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_RXP_INDIRECT_ACC_DATA_OFFSET)
#define S32K3XX_EMAC_MTL_ECC_CONTROL                        (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_ECC_CONTROL_OFFSET)
#define S32K3XX_EMAC_MTL_SAFETY_INTERRUPT_STATUS            (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_SAFETY_INTERRUPT_STATUS_OFFSET)
#define S32K3XX_EMAC_MTL_ECC_INTERRUPT_ENABLE               (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_ECC_INTERRUPT_ENABLE_OFFSET)
#define S32K3XX_EMAC_MTL_ECC_INTERRUPT_STATUS               (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_ECC_INTERRUPT_STATUS_OFFSET)
#define S32K3XX_EMAC_MTL_ECC_ERR_STS_RCTL                   (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_ECC_ERR_STS_RCTL_OFFSET)
#define S32K3XX_EMAC_MTL_ECC_ERR_ADDR_STATUS                (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_ECC_ERR_ADDR_STATUS_OFFSET)
#define S32K3XX_EMAC_MTL_ECC_ERR_CNTR_STATUS                (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_ECC_ERR_CNTR_STATUS_OFFSET)
#define S32K3XX_EMAC_MTL_DPP_CONTROL                        (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_DPP_CONTROL_OFFSET)
#define S32K3XX_EMAC_MTL_TXQ0_OPERATION_MODE                (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_TXQ0_OPERATION_MODE_OFFSET)
#define S32K3XX_EMAC_MTL_TXQ0_UNDERFLOW                     (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_TXQ0_UNDERFLOW_OFFSET)
#define S32K3XX_EMAC_MTL_TXQ0_DEBUG                         (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_TXQ0_DEBUG_OFFSET)
#define S32K3XX_EMAC_MTL_TXQ0_ETS_STATUS                    (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_TXQ0_ETS_STATUS_OFFSET)
#define S32K3XX_EMAC_MTL_TXQ0_QUANTUM_WEIGHT                (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_TXQ0_QUANTUM_WEIGHT_OFFSET)
#define S32K3XX_EMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS        (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_OFFSET)
#define S32K3XX_EMAC_MTL_RXQ0_OPERATION_MODE                (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_RXQ0_OPERATION_MODE_OFFSET)
#define S32K3XX_EMAC_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT    (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_OFFSET)
#define S32K3XX_EMAC_MTL_RXQ0_DEBUG                         (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_RXQ0_DEBUG_OFFSET)
#define S32K3XX_EMAC_MTL_RXQ0_CONTROL                       (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_RXQ0_CONTROL_OFFSET)
#define S32K3XX_EMAC_MTL_TXQ1_OPERATION_MODE                (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_TXQ1_OPERATION_MODE_OFFSET)
#define S32K3XX_EMAC_MTL_TXQ1_UNDERFLOW                     (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_TXQ1_UNDERFLOW_OFFSET)
#define S32K3XX_EMAC_MTL_TXQ1_DEBUG                         (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_TXQ1_DEBUG_OFFSET)
#define S32K3XX_EMAC_MTL_TXQ1_ETS_CONTROL                   (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_TXQ1_ETS_CONTROL_OFFSET)
#define S32K3XX_EMAC_MTL_TXQ1_ETS_STATUS                    (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_TXQ1_ETS_STATUS_OFFSET)
#define S32K3XX_EMAC_MTL_TXQ1_QUANTUM_WEIGHT                (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_TXQ1_QUANTUM_WEIGHT_OFFSET)
#define S32K3XX_EMAC_MTL_TXQ1_SENDSLOPECREDIT               (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_TXQ1_SENDSLOPECREDIT_OFFSET)
#define S32K3XX_EMAC_MTL_TXQ1_HICREDIT                      (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_TXQ1_HICREDIT_OFFSET)
#define S32K3XX_EMAC_MTL_TXQ1_LOCREDIT                      (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_TXQ1_LOCREDIT_OFFSET)
#define S32K3XX_EMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS        (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_OFFSET)
#define S32K3XX_EMAC_MTL_RXQ1_OPERATION_MODE                (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_RXQ1_OPERATION_MODE_OFFSET)
#define S32K3XX_EMAC_MTL_RXQ1_MISSED_PACKET_OVERFLOW_CNT    (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_RXQ1_MISSED_PACKET_OVERFLOW_CNT_OFFSET)
#define S32K3XX_EMAC_MTL_RXQ1_DEBUG                         (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_RXQ1_DEBUG_OFFSET)
#define S32K3XX_EMAC_MTL_RXQ1_CONTROL                       (S32K3XX_EMAC_BASE + S32K3XX_EMAC_MTL_RXQ1_CONTROL_OFFSET)
#define S32K3XX_EMAC_DMA_MODE                               (S32K3XX_EMAC_BASE + S32K3XX_EMAC_DMA_MODE_OFFSET)
#define S32K3XX_EMAC_DMA_SYSBUS_MODE                        (S32K3XX_EMAC_BASE + S32K3XX_EMAC_DMA_SYSBUS_MODE_OFFSET)
#define S32K3XX_EMAC_DMA_INTERRUPT_STATUS                   (S32K3XX_EMAC_BASE + S32K3XX_EMAC_DMA_INTERRUPT_STATUS_OFFSET)
#define S32K3XX_EMAC_DMA_DEBUG_STATUS0                      (S32K3XX_EMAC_BASE + S32K3XX_EMAC_DMA_DEBUG_STATUS0_OFFSET)
#define S32K3XX_EMAC_DMA_TBS_CTRL                           (S32K3XX_EMAC_BASE + S32K3XX_EMAC_DMA_TBS_CTRL_OFFSET)
#define S32K3XX_EMAC_DMA_SAFETY_INTERRUPT_STATUS            (S32K3XX_EMAC_BASE + S32K3XX_EMAC_DMA_SAFETY_INTERRUPT_STATUS_OFFSET)
#define S32K3XX_EMAC_DMA_CH0_CONTROL                        (S32K3XX_EMAC_BASE + S32K3XX_EMAC_DMA_CH0_CONTROL_OFFSET)
#define S32K3XX_EMAC_DMA_CH0_TX_CONTROL                     (S32K3XX_EMAC_BASE + S32K3XX_EMAC_DMA_CH0_TX_CONTROL_OFFSET)
#define S32K3XX_EMAC_DMA_CH0_RX_CONTROL                     (S32K3XX_EMAC_BASE + S32K3XX_EMAC_DMA_CH0_RX_CONTROL_OFFSET)
#define S32K3XX_EMAC_DMA_CH0_TXDESC_LIST_ADDRESS            (S32K3XX_EMAC_BASE + S32K3XX_EMAC_DMA_CH0_TXDESC_LIST_ADDRESS_OFFSET)
#define S32K3XX_EMAC_DMA_CH0_RXDESC_LIST_ADDRESS            (S32K3XX_EMAC_BASE + S32K3XX_EMAC_DMA_CH0_RXDESC_LIST_ADDRESS_OFFSET)
#define S32K3XX_EMAC_DMA_CH0_TXDESC_TAIL_POINTER            (S32K3XX_EMAC_BASE + S32K3XX_EMAC_DMA_CH0_TXDESC_TAIL_POINTER_OFFSET)
#define S32K3XX_EMAC_DMA_CH0_RXDESC_TAIL_POINTER            (S32K3XX_EMAC_BASE + S32K3XX_EMAC_DMA_CH0_RXDESC_TAIL_POINTER_OFFSET)
#define S32K3XX_EMAC_DMA_CH0_TXDESC_RING_LENGTH             (S32K3XX_EMAC_BASE + S32K3XX_EMAC_DMA_CH0_TXDESC_RING_LENGTH_OFFSET)
#define S32K3XX_EMAC_DMA_CH0_RXDESC_RING_LENGTH             (S32K3XX_EMAC_BASE + S32K3XX_EMAC_DMA_CH0_RXDESC_RING_LENGTH_OFFSET)
#define S32K3XX_EMAC_DMA_CH0_INTERRUPT_ENABLE               (S32K3XX_EMAC_BASE + S32K3XX_EMAC_DMA_CH0_INTERRUPT_ENABLE_OFFSET)
#define S32K3XX_EMAC_DMA_CH0_RX_INTERRUPT_WATCHDOG_TIMER    (S32K3XX_EMAC_BASE + S32K3XX_EMAC_DMA_CH0_RX_INTERRUPT_WATCHDOG_TIMER_OFFSET)
#define S32K3XX_EMAC_DMA_CH0_SLOT_FUNCTION_CONTROL_STATUS   (S32K3XX_EMAC_BASE + S32K3XX_EMAC_DMA_CH0_SLOT_FUNCTION_CONTROL_STATUS_OFFSET)
#define S32K3XX_EMAC_DMA_CH0_CURRENT_APP_TXDESC             (S32K3XX_EMAC_BASE + S32K3XX_EMAC_DMA_CH0_CURRENT_APP_TXDESC_OFFSET)
#define S32K3XX_EMAC_DMA_CH0_CURRENT_APP_RXDESC             (S32K3XX_EMAC_BASE + S32K3XX_EMAC_DMA_CH0_CURRENT_APP_RXDESC_OFFSET)
#define S32K3XX_EMAC_DMA_CH0_CURRENT_APP_TXBUFFER           (S32K3XX_EMAC_BASE + S32K3XX_EMAC_DMA_CH0_CURRENT_APP_TXBUFFER_OFFSET)
#define S32K3XX_EMAC_DMA_CH0_CURRENT_APP_RXBUFFER           (S32K3XX_EMAC_BASE + S32K3XX_EMAC_DMA_CH0_CURRENT_APP_RXBUFFER_OFFSET)
#define S32K3XX_EMAC_DMA_CH0_STATUS                         (S32K3XX_EMAC_BASE + S32K3XX_EMAC_DMA_CH0_STATUS_OFFSET)
#define S32K3XX_EMAC_DMA_CH0_MISS_FRAME_CNT                 (S32K3XX_EMAC_BASE + S32K3XX_EMAC_DMA_CH0_MISS_FRAME_CNT_OFFSET)
#define S32K3XX_EMAC_DMA_CH0_RXP_ACCEPT_CNT                 (S32K3XX_EMAC_BASE + S32K3XX_EMAC_DMA_CH0_RXP_ACCEPT_CNT_OFFSET)
#define S32K3XX_EMAC_DMA_CH0_RX_ERI_CNT                     (S32K3XX_EMAC_BASE + S32K3XX_EMAC_DMA_CH0_RX_ERI_CNT_OFFSET)
#define S32K3XX_EMAC_DMA_CH1_CONTROL                        (S32K3XX_EMAC_BASE + S32K3XX_EMAC_DMA_CH1_CONTROL_OFFSET)
#define S32K3XX_EMAC_DMA_CH1_TX_CONTROL                     (S32K3XX_EMAC_BASE + S32K3XX_EMAC_DMA_CH1_TX_CONTROL_OFFSET)
#define S32K3XX_EMAC_DMA_CH1_RX_CONTROL                     (S32K3XX_EMAC_BASE + S32K3XX_EMAC_DMA_CH1_RX_CONTROL_OFFSET)
#define S32K3XX_EMAC_DMA_CH1_TXDESC_LIST_ADDRESS            (S32K3XX_EMAC_BASE + S32K3XX_EMAC_DMA_CH1_TXDESC_LIST_ADDRESS_OFFSET)
#define S32K3XX_EMAC_DMA_CH1_RXDESC_LIST_ADDRESS            (S32K3XX_EMAC_BASE + S32K3XX_EMAC_DMA_CH1_RXDESC_LIST_ADDRESS_OFFSET)
#define S32K3XX_EMAC_DMA_CH1_TXDESC_TAIL_POINTER            (S32K3XX_EMAC_BASE + S32K3XX_EMAC_DMA_CH1_TXDESC_TAIL_POINTER_OFFSET)
#define S32K3XX_EMAC_DMA_CH1_RXDESC_TAIL_POINTER            (S32K3XX_EMAC_BASE + S32K3XX_EMAC_DMA_CH1_RXDESC_TAIL_POINTER_OFFSET)
#define S32K3XX_EMAC_DMA_CH1_TXDESC_RING_LENGTH             (S32K3XX_EMAC_BASE + S32K3XX_EMAC_DMA_CH1_TXDESC_RING_LENGTH_OFFSET)
#define S32K3XX_EMAC_DMA_CH1_RXDESC_RING_LENGTH             (S32K3XX_EMAC_BASE + S32K3XX_EMAC_DMA_CH1_RXDESC_RING_LENGTH_OFFSET)
#define S32K3XX_EMAC_DMA_CH1_INTERRUPT_ENABLE               (S32K3XX_EMAC_BASE + S32K3XX_EMAC_DMA_CH1_INTERRUPT_ENABLE_OFFSET)
#define S32K3XX_EMAC_DMA_CH1_RX_INTERRUPT_WATCHDOG_TIMER    (S32K3XX_EMAC_BASE + S32K3XX_EMAC_DMA_CH1_RX_INTERRUPT_WATCHDOG_TIMER_OFFSET)
#define S32K3XX_EMAC_DMA_CH1_SLOT_FUNCTION_CONTROL_STATUS   (S32K3XX_EMAC_BASE + S32K3XX_EMAC_DMA_CH1_SLOT_FUNCTION_CONTROL_STATUS_OFFSET)
#define S32K3XX_EMAC_DMA_CH1_CURRENT_APP_TXDESC             (S32K3XX_EMAC_BASE + S32K3XX_EMAC_DMA_CH1_CURRENT_APP_TXDESC_OFFSET)
#define S32K3XX_EMAC_DMA_CH1_CURRENT_APP_RXDESC             (S32K3XX_EMAC_BASE + S32K3XX_EMAC_DMA_CH1_CURRENT_APP_RXDESC_OFFSET)
#define S32K3XX_EMAC_DMA_CH1_CURRENT_APP_TXBUFFER           (S32K3XX_EMAC_BASE + S32K3XX_EMAC_DMA_CH1_CURRENT_APP_TXBUFFER_OFFSET)
#define S32K3XX_EMAC_DMA_CH1_CURRENT_APP_RXBUFFER           (S32K3XX_EMAC_BASE + S32K3XX_EMAC_DMA_CH1_CURRENT_APP_RXBUFFER_OFFSET)
#define S32K3XX_EMAC_DMA_CH1_STATUS                         (S32K3XX_EMAC_BASE + S32K3XX_EMAC_DMA_CH1_STATUS_OFFSET)
#define S32K3XX_EMAC_DMA_CH1_MISS_FRAME_CNT                 (S32K3XX_EMAC_BASE + S32K3XX_EMAC_DMA_CH1_MISS_FRAME_CNT_OFFSET)
#define S32K3XX_EMAC_DMA_CH1_RXP_ACCEPT_CNT                 (S32K3XX_EMAC_BASE + S32K3XX_EMAC_DMA_CH1_RXP_ACCEPT_CNT_OFFSET)
#define S32K3XX_EMAC_DMA_CH1_RX_ERI_CNT                     (S32K3XX_EMAC_BASE + S32K3XX_EMAC_DMA_CH1_RX_ERI_CNT_OFFSET)

