apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_emac.h
/* MAC Configuration (MAC_CONFIGURATION) */
#define EMAC_MAC_CONFIGURATION_RE            (1 << 0) /* Bit 0: Receiver Enable */
#define EMAC_MAC_CONFIGURATION_TE            (1 << 1) /* Bit 1: Transmitter Enable */
#define EMAC_MAC_CONFIGURATION_PRELEN_SHIFT  (2)      /* Bits 2-4: Preamble Length for Transmit Packets */
#define EMAC_MAC_CONFIGURATION_PRELEN_MASK   (0x3 << EMAC_MAC_CONFIGURATION_PRELEN_SHIFT)
#define EMAC_MAC_CONFIGURATION_PRELEN(n)     (((n) << EMAC_MAC_CONFIGURATION_PRELEN_SHIFT) & EMAC_MAC_CONFIGURATION_PRELEN_MASK)
#define EMAC_MAC_CONFIGURATION_DC            (1 << 4) /* Bit 4: Deferral Check */
#define EMAC_MAC_CONFIGURATION_BL_SHIFT      (5)      /* Bits 5-7: Back-Off Limit */
#define EMAC_MAC_CONFIGURATION_BL_MASK       (0x3 << EMAC_MAC_CONFIGURATION_BL_SHIFT)
#define EMAC_MAC_CONFIGURATION_BL(n)         (((n) << EMAC_MAC_CONFIGURATION_BL_SHIFT) & EMAC_MAC_CONFIGURATION_BL_MASK)
#define EMAC_MAC_CONFIGURATION_DR            (1 << 8)  /* Bit 8: Disable Retry */
#define EMAC_MAC_CONFIGURATION_DCRS          (1 << 9)  /* Bit 9: Disable Carrier Sense During Transmission */
#define EMAC_MAC_CONFIGURATION_DO            (1 << 10) /* Bit 10: Disable Receive Own */
#define EMAC_MAC_CONFIGURATION_ECRSFD        (1 << 11) /* Bit 11: Enable Carrier Sense In Full-Duplex Mode */
#define EMAC_MAC_CONFIGURATION_LM            (1 << 12) /* Bit 12: Loopback Mode */
#define EMAC_MAC_CONFIGURATION_DM            (1 << 13) /* Bit 13: Duplex Mode */
#define EMAC_MAC_CONFIGURATION_FES           (1 << 14) /* Bit 14: Speed */
#define EMAC_MAC_CONFIGURATION_PS            (1 << 15) /* Bit 15: Port Select */
#define EMAC_MAC_CONFIGURATION_JE            (1 << 16) /* Bit 16: Jumbo Packet Enable */
#define EMAC_MAC_CONFIGURATION_JD            (1 << 17) /* Bit 17: Jabber Disable */
#define EMAC_MAC_CONFIGURATION_WD            (1 << 19) /* Bit 19: Watchdog Disable */
#define EMAC_MAC_CONFIGURATION_ACS           (1 << 20) /* Bit 20: Automatic Pad Or CRC Stripping */
#define EMAC_MAC_CONFIGURATION_CST           (1 << 21) /* Bit 21: CRC Stripping For Type Packets */
#define EMAC_MAC_CONFIGURATION_S2KP          (1 << 22) /* Bit 22: IEEE 802.3 Support For 2K Packets */
#define EMAC_MAC_CONFIGURATION_GPSLCE        (1 << 23) /* Bit 23: Giant Packet Size Limit Control Enable */
#define EMAC_MAC_CONFIGURATION_IPG_SHIFT     (24)      /* Bits 24-27: Inter-Packet Gap */
#define EMAC_MAC_CONFIGURATION_IPG_MASK      (0x7 << EMAC_MAC_CONFIGURATION_IPG_SHIFT)
#define EMAC_MAC_CONFIGURATION_IPG(n)        (((n) << EMAC_MAC_CONFIGURATION_IPG_SHIFT) & EMAC_MAC_CONFIGURATION_IPG_MASK)
#define EMAC_MAC_CONFIGURATION_IPC           (1 << 27) /* Bit 27: Checksum Offload */
#define EMAC_MAC_CONFIGURATION_SARC_SHIFT    (28)      /* Bits 28-31: Source Address Insertion Or Replacement Control */
#define EMAC_MAC_CONFIGURATION_SARC_MASK     (0x7 << EMAC_MAC_CONFIGURATION_SARC_SHIFT)
#define EMAC_MAC_CONFIGURATION_SARC(n)       (((n) << EMAC_MAC_CONFIGURATION_SARC_SHIFT) & EMAC_MAC_CONFIGURATION_SARC_MASK)

/* MAC Extended Configuration (MAC_EXT_CONFIGURATION) */
#define EMAC_MAC_EXT_CONFIGURATION_GPSL_SHIFT  (0) /* Bits 0-14: Giant Packet Size Limit */
#define EMAC_MAC_EXT_CONFIGURATION_GPSL_MASK   (0x3fff << EMAC_MAC_EXT_CONFIGURATION_GPSL_SHIFT)
#define EMAC_MAC_EXT_CONFIGURATION_GPSL(n)     (((n) << EMAC_MAC_EXT_CONFIGURATION_GPSL_SHIFT) & EMAC_MAC_EXT_CONFIGURATION_GPSL_MASK)
#define EMAC_MAC_EXT_CONFIGURATION_DCRCC       (1 << 16) /* Bit 16: Disable CRC Checking For Received Packets */
#define EMAC_MAC_EXT_CONFIGURATION_SPEN        (1 << 17) /* Bit 17: Slow Protocol Detection Enable */
#define EMAC_MAC_EXT_CONFIGURATION_USP         (1 << 18) /* Bit 18: Unicast Slow Protocol Packet Detect */
#define EMAC_MAC_EXT_CONFIGURATION_PDC         (1 << 19) /* Bit 19: Packet Duplication Control */
#define EMAC_MAC_EXT_CONFIGURATION_EIPGEN      (1 << 24) /* Bit 24: Extended Inter-Packet Gap Enable */
#define EMAC_MAC_EXT_CONFIGURATION_EIPG_SHIFT  (25)      /* Bits 25-30: Extended Inter-Packet Gap */
#define EMAC_MAC_EXT_CONFIGURATION_EIPG_MASK   (0x1f << EMAC_MAC_EXT_CONFIGURATION_EIPG_SHIFT)
#define EMAC_MAC_EXT_CONFIGURATION_EIPG(n)     (((n) << EMAC_MAC_EXT_CONFIGURATION_EIPG_SHIFT) & EMAC_MAC_EXT_CONFIGURATION_EIPG_MASK)

/* MAC Packet Filter (MAC_PACKET_FILTER) */
#define EMAC_MAC_PACKET_FILTER_PR         (1 << 0) /* Bit 0: Promiscuous Mode */
#define EMAC_MAC_PACKET_FILTER_HUC        (1 << 1) /* Bit 1: Hash Unicast */
#define EMAC_MAC_PACKET_FILTER_HMC        (1 << 2) /* Bit 2: Hash Multicast */
#define EMAC_MAC_PACKET_FILTER_DAIF       (1 << 3) /* Bit 3: DA Inverse Filtering */
#define EMAC_MAC_PACKET_FILTER_PM         (1 << 4) /* Bit 4: Pass All Multicast */
#define EMAC_MAC_PACKET_FILTER_DBF        (1 << 5) /* Bit 5: Disable Broadcast Packets */
#define EMAC_MAC_PACKET_FILTER_PCF_SHIFT  (6)      /* Bits 6-8: Pass Control Packets */
#define EMAC_MAC_PACKET_FILTER_PCF_MASK   (0x3 << EMAC_MAC_PACKET_FILTER_PCF_SHIFT)
#define EMAC_MAC_PACKET_FILTER_PCF(n)     (((n) << EMAC_MAC_PACKET_FILTER_PCF_SHIFT) & EMAC_MAC_PACKET_FILTER_PCF_MASK)
#define EMAC_MAC_PACKET_FILTER_SAIF       (1 << 8)  /* Bit 8: SA Inverse Filtering */
#define EMAC_MAC_PACKET_FILTER_SAF        (1 << 9)  /* Bit 9: Source Address Filter Enable */
#define EMAC_MAC_PACKET_FILTER_HPF        (1 << 10) /* Bit 10: Hash Or Perfect Filter */
#define EMAC_MAC_PACKET_FILTER_VTFE       (1 << 16) /* Bit 16: VLAN Tag Filter Enable */
#define EMAC_MAC_PACKET_FILTER_IPFE       (1 << 20) /* Bit 20: Layer 3 and Layer 4 Filter Enable */
#define EMAC_MAC_PACKET_FILTER_DNTU       (1 << 21) /* Bit 21: Drop Non-TCP/UDP Over IP Packets */
#define EMAC_MAC_PACKET_FILTER_RA         (1 << 31) /* Bit 31: Receive All */

/* MAC Watchdog Timeout (MAC_WATCHDOG_TIMEOUT) */
#define EMAC_MAC_WATCHDOG_TIMEOUT_WTO_SHIFT  (0) /* Bits 0-4: Watchdog Timeout */
#define EMAC_MAC_WATCHDOG_TIMEOUT_WTO_MASK   (0xf << EMAC_MAC_WATCHDOG_TIMEOUT_WTO_SHIFT)
#define EMAC_MAC_WATCHDOG_TIMEOUT_WTO(n)     (((n) << EMAC_MAC_WATCHDOG_TIMEOUT_WTO_SHIFT) & EMAC_MAC_WATCHDOG_TIMEOUT_WTO_MASK)
#define EMAC_MAC_WATCHDOG_TIMEOUT_PWE        (1 << 8) /* Bit 8: Programmable Watchdog Enable */

/* MAC Hash Table First 32 Bits (MAC_HASH_TABLE_REG0) */
#define EMAC_MAC_HASH_TABLE_REG0_HT31T0_SHIFT  (0) /* Bits 0-32: MAC Hash Table First 32 Bits */
#define EMAC_MAC_HASH_TABLE_REG0_HT31T0_MASK   (0xffffffff << EMAC_MAC_HASH_TABLE_REG0_HT31T0_SHIFT)
#define EMAC_MAC_HASH_TABLE_REG0_HT31T0(n)     (((n) << EMAC_MAC_HASH_TABLE_REG0_HT31T0_SHIFT) & EMAC_MAC_HASH_TABLE_REG0_HT31T0_MASK)

/* MAC Hash Table Second 32 Bits (MAC_HASH_TABLE_REG1) */
#define EMAC_MAC_HASH_TABLE_REG1_HT63T32_SHIFT  (0) /* Bits 0-32: MAC Hash Table Second 32 Bits */
#define EMAC_MAC_HASH_TABLE_REG1_HT63T32_MASK   (0xffffffff << EMAC_MAC_HASH_TABLE_REG1_HT63T32_SHIFT)
#define EMAC_MAC_HASH_TABLE_REG1_HT63T32(n)     (((n) << EMAC_MAC_HASH_TABLE_REG1_HT63T32_SHIFT) & EMAC_MAC_HASH_TABLE_REG1_HT63T32_MASK)

