apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_emac.h
/* MAC VLAN Tag (MAC_VLAN_TAG) */
#define EMAC_MAC_VLAN_TAG_VL_SHIFT     (0) /* Bits 0-16: VLAN Tag Identifier for Receive Packets */
#define EMAC_MAC_VLAN_TAG_VL_MASK      (0xffff << EMAC_MAC_VLAN_TAG_VL_SHIFT)
#define EMAC_MAC_VLAN_TAG_VL(n)        (((n) << EMAC_MAC_VLAN_TAG_VL_SHIFT) & EMAC_MAC_VLAN_TAG_VL_MASK)
#define EMAC_MAC_VLAN_TAG_ETV          (1 << 16) /* Bit 16: Enable Tag For VLAN */
#define EMAC_MAC_VLAN_TAG_VTIM         (1 << 17) /* Bit 17: VLAN Tag Inverse Match Enable */
#define EMAC_MAC_VLAN_TAG_ESVL         (1 << 18) /* Bit 18: Enable S-VLAN */
#define EMAC_MAC_VLAN_TAG_ERSVLM       (1 << 19) /* Bit 19: Enable Receive S-VLAN Match */
#define EMAC_MAC_VLAN_TAG_DOVLTC       (1 << 20) /* Bit 20: Disable VLAN Type Check */
#define EMAC_MAC_VLAN_TAG_EVLS_SHIFT   (21)      /* Bits 21-23: Enable VLAN Tag Stripping */
#define EMAC_MAC_VLAN_TAG_EVLS_MASK    (0x3 << EMAC_MAC_VLAN_TAG_EVLS_SHIFT)
#define EMAC_MAC_VLAN_TAG_EVLS(n)      (((n) << EMAC_MAC_VLAN_TAG_EVLS_SHIFT) & EMAC_MAC_VLAN_TAG_EVLS_MASK)
#define EMAC_MAC_VLAN_TAG_EVLRXS       (1 << 24) /* Bit 24: Enable VLAN Tag In Receive Status */
#define EMAC_MAC_VLAN_TAG_VTHM         (1 << 25) /* Bit 25: VLAN Tag Hash Table Match */
#define EMAC_MAC_VLAN_TAG_EDVLP        (1 << 26) /* Bit 26: Enable Double VLAN Processing */
#define EMAC_MAC_VLAN_TAG_ERIVLT       (1 << 27) /* Bit 27: Enable Inner VLAN Tag Comparison */
#define EMAC_MAC_VLAN_TAG_EIVLS_SHIFT  (28)      /* Bits 28-30: Enable Inner VLAN Tag Stripping */
#define EMAC_MAC_VLAN_TAG_EIVLS_MASK   (0x3 << EMAC_MAC_VLAN_TAG_EIVLS_SHIFT)
#define EMAC_MAC_VLAN_TAG_EIVLS(n)     (((n) << EMAC_MAC_VLAN_TAG_EIVLS_SHIFT) & EMAC_MAC_VLAN_TAG_EIVLS_MASK)
#define EMAC_MAC_VLAN_TAG_EIVLRXS      (1 << 31) /* Bit 31: Enable Inner VLAN Tag In Receive Status */

/* MAC VLAN Tag Control (MAC_VLAN_TAG_CTRL) */
#define EMAC_MAC_VLAN_TAG_CTRL_OB           (1 << 0) /* Bit 0: Operation Busy */
#define EMAC_MAC_VLAN_TAG_CTRL_CT           (1 << 1) /* Bit 1: Command Type */
#define EMAC_MAC_VLAN_TAG_CTRL_OFS_SHIFT    (2)      /* Bits 2-4: Offset */
#define EMAC_MAC_VLAN_TAG_CTRL_OFS_MASK     (0x3 << EMAC_MAC_VLAN_TAG_CTRL_OFS_SHIFT)
#define EMAC_MAC_VLAN_TAG_CTRL_OFS(n)       (((n) << EMAC_MAC_VLAN_TAG_CTRL_OFS_SHIFT) & EMAC_MAC_VLAN_TAG_CTRL_OFS_MASK)
#define EMAC_MAC_VLAN_TAG_CTRL_ETV          (1 << 16) /* Bit 16: Enable Tag For VLAN */
#define EMAC_MAC_VLAN_TAG_CTRL_VTIM         (1 << 17) /* Bit 17: VLAN Tag Inverse Match Enable */
#define EMAC_MAC_VLAN_TAG_CTRL_ESVL         (1 << 18) /* Bit 18: Enable S-VLAN */
#define EMAC_MAC_VLAN_TAG_CTRL_ERSVLM       (1 << 19) /* Bit 19: Enable Receive S-VLAN Match */
#define EMAC_MAC_VLAN_TAG_CTRL_DOVLTC       (1 << 20) /* Bit 20: Disable VLAN Type Check */
#define EMAC_MAC_VLAN_TAG_CTRL_EVLS_SHIFT   (21)      /* Bits 21-23: Enable VLAN Tag Stripping */
#define EMAC_MAC_VLAN_TAG_CTRL_EVLS_MASK    (0x3 << EMAC_MAC_VLAN_TAG_CTRL_EVLS_SHIFT)
#define EMAC_MAC_VLAN_TAG_CTRL_EVLS(n)      (((n) << EMAC_MAC_VLAN_TAG_CTRL_EVLS_SHIFT) & EMAC_MAC_VLAN_TAG_CTRL_EVLS_MASK)
#define EMAC_MAC_VLAN_TAG_CTRL_EVLRXS       (1 << 24) /* Bit 24: Enable VLAN Tag In Receive Status */
#define EMAC_MAC_VLAN_TAG_CTRL_VTHM         (1 << 25) /* Bit 25: VLAN Tag Hash Table Match */
#define EMAC_MAC_VLAN_TAG_CTRL_EDVLP        (1 << 26) /* Bit 26: Enable Double VLAN Processing */
#define EMAC_MAC_VLAN_TAG_CTRL_ERIVLT       (1 << 27) /* Bit 27: Enable Inner VLAN Tag Comparison */
#define EMAC_MAC_VLAN_TAG_CTRL_EIVLS_SHIFT  (28)      /* Bits 28-30: Enable Inner VLAN Tag Stripping */
#define EMAC_MAC_VLAN_TAG_CTRL_EIVLS_MASK   (0x3 << EMAC_MAC_VLAN_TAG_CTRL_EIVLS_SHIFT)
#define EMAC_MAC_VLAN_TAG_CTRL_EIVLS(n)     (((n) << EMAC_MAC_VLAN_TAG_CTRL_EIVLS_SHIFT) & EMAC_MAC_VLAN_TAG_CTRL_EIVLS_MASK)
#define EMAC_MAC_VLAN_TAG_CTRL_EIVLRXS      (1 << 31) /* Bit 31: Enable Inner VLAN Tag In Receive Status */

/* MAC VLAN Tag Data (MAC_VLAN_TAG_DATA) */
#define EMAC_MAC_VLAN_TAG_DATA_VID_SHIFT  (0) /* Bits 0-16: VLAN Tag ID */
#define EMAC_MAC_VLAN_TAG_DATA_VID_MASK   (0xffff << EMAC_MAC_VLAN_TAG_DATA_VID_SHIFT)
#define EMAC_MAC_VLAN_TAG_DATA_VID(n)     (((n) << EMAC_MAC_VLAN_TAG_DATA_VID_SHIFT) & EMAC_MAC_VLAN_TAG_DATA_VID_MASK)
#define EMAC_MAC_VLAN_TAG_DATA_VEN        (1 << 16) /* Bit 16: VLAN Tag Enable */
#define EMAC_MAC_VLAN_TAG_DATA_ETV        (1 << 17) /* Bit 17: VLAN Comparison */
#define EMAC_MAC_VLAN_TAG_DATA_DOVLTC     (1 << 18) /* Bit 18: Disable VLAN Type Comparison */
#define EMAC_MAC_VLAN_TAG_DATA_ERSVLM     (1 << 19) /* Bit 19: Enable S-VLAN Match */
#define EMAC_MAC_VLAN_TAG_DATA_ERIVLT     (1 << 20) /* Bit 20: Enable Inner VLAN Tag */
#define EMAC_MAC_VLAN_TAG_DATA_DMACHEN    (1 << 24) /* Bit 24: DMA Channel Number Enable */
#define EMAC_MAC_VLAN_TAG_DATA_DMACHN     (1 << 25) /* Bit 25: DMA Channel Number */

/* MAC VLAN Tag Filter 0 (MAC_VLAN_TAG_FILTER0) */
#define EMAC_MAC_VLAN_TAG_FILTER0_VID_SHIFT  (0) /* Bits 0-16: VLAN Tag ID */
#define EMAC_MAC_VLAN_TAG_FILTER0_VID_MASK   (0xffff << EMAC_MAC_VLAN_TAG_FILTER0_VID_SHIFT)
#define EMAC_MAC_VLAN_TAG_FILTER0_VID(n)     (((n) << EMAC_MAC_VLAN_TAG_FILTER0_VID_SHIFT) & EMAC_MAC_VLAN_TAG_FILTER0_VID_MASK)
#define EMAC_MAC_VLAN_TAG_FILTER0_VEN        (1 << 16) /* Bit 16: VLAN Tag Enable */
#define EMAC_MAC_VLAN_TAG_FILTER0_ETV        (1 << 17) /* Bit 17: VLAN Comparison */
#define EMAC_MAC_VLAN_TAG_FILTER0_DOVLTC     (1 << 18) /* Bit 18: Disable VLAN Type Comparison */
#define EMAC_MAC_VLAN_TAG_FILTER0_ERSVLM     (1 << 19) /* Bit 19: Enable S-VLAN Match */
#define EMAC_MAC_VLAN_TAG_FILTER0_ERIVLT     (1 << 20) /* Bit 20: Enable Inner VLAN Tag */
#define EMAC_MAC_VLAN_TAG_FILTER0_DMACHEN    (1 << 24) /* Bit 24: DMA Channel Number Enable */
#define EMAC_MAC_VLAN_TAG_FILTER0_DMACHN     (1 << 25) /* Bit 25: DMA Channel Number */

/* MAC VLAN Tag Filter 1 (MAC_VLAN_TAG_FILTER1) */
#define EMAC_MAC_VLAN_TAG_FILTER1_VID_SHIFT  (0) /* Bits 0-16: VLAN Tag ID */
#define EMAC_MAC_VLAN_TAG_FILTER1_VID_MASK   (0xffff << EMAC_MAC_VLAN_TAG_FILTER1_VID_SHIFT)
#define EMAC_MAC_VLAN_TAG_FILTER1_VID(n)     (((n) << EMAC_MAC_VLAN_TAG_FILTER1_VID_SHIFT) & EMAC_MAC_VLAN_TAG_FILTER1_VID_MASK)
#define EMAC_MAC_VLAN_TAG_FILTER1_VEN        (1 << 16) /* Bit 16: VLAN Tag Enable */
#define EMAC_MAC_VLAN_TAG_FILTER1_ETV        (1 << 17) /* Bit 17: VLAN Comparison */
#define EMAC_MAC_VLAN_TAG_FILTER1_DOVLTC     (1 << 18) /* Bit 18: Disable VLAN Type Comparison */
#define EMAC_MAC_VLAN_TAG_FILTER1_ERSVLM     (1 << 19) /* Bit 19: Enable S-VLAN Match */
#define EMAC_MAC_VLAN_TAG_FILTER1_ERIVLT     (1 << 20) /* Bit 20: Enable Inner VLAN Tag */
#define EMAC_MAC_VLAN_TAG_FILTER1_DMACHEN    (1 << 24) /* Bit 24: DMA Channel Number Enable */
#define EMAC_MAC_VLAN_TAG_FILTER1_DMACHN     (1 << 25) /* Bit 25: DMA Channel Number */

/* MAC VLAN Tag Filter 2 (MAC_VLAN_TAG_FILTER2) */
#define EMAC_MAC_VLAN_TAG_FILTER2_VID_SHIFT  (0) /* Bits 0-16: VLAN Tag ID */
#define EMAC_MAC_VLAN_TAG_FILTER2_VID_MASK   (0xffff << EMAC_MAC_VLAN_TAG_FILTER2_VID_SHIFT)
#define EMAC_MAC_VLAN_TAG_FILTER2_VID(n)     (((n) << EMAC_MAC_VLAN_TAG_FILTER2_VID_SHIFT) & EMAC_MAC_VLAN_TAG_FILTER2_VID_MASK)
#define EMAC_MAC_VLAN_TAG_FILTER2_VEN        (1 << 16) /* Bit 16: VLAN Tag Enable */
#define EMAC_MAC_VLAN_TAG_FILTER2_ETV        (1 << 17) /* Bit 17: VLAN Comparison */
#define EMAC_MAC_VLAN_TAG_FILTER2_DOVLTC     (1 << 18) /* Bit 18: Disable VLAN Type Comparison */
#define EMAC_MAC_VLAN_TAG_FILTER2_ERSVLM     (1 << 19) /* Bit 19: Enable S-VLAN Match */
#define EMAC_MAC_VLAN_TAG_FILTER2_ERIVLT     (1 << 20) /* Bit 20: Enable Inner VLAN Tag */
#define EMAC_MAC_VLAN_TAG_FILTER2_DMACHEN    (1 << 24) /* Bit 24: DMA Channel Number Enable */
#define EMAC_MAC_VLAN_TAG_FILTER2_DMACHN     (1 << 25) /* Bit 25: DMA Channel Number */

