apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_emac.h
/* MAC VLAN Tag Filter 3 (MAC_VLAN_TAG_FILTER3) */
#define EMAC_MAC_VLAN_TAG_FILTER3_VID_SHIFT  (0) /* Bits 0-16: VLAN Tag ID */
#define EMAC_MAC_VLAN_TAG_FILTER3_VID_MASK   (0xffff << EMAC_MAC_VLAN_TAG_FILTER3_VID_SHIFT)
#define EMAC_MAC_VLAN_TAG_FILTER3_VID(n)     (((n) << EMAC_MAC_VLAN_TAG_FILTER3_VID_SHIFT) & EMAC_MAC_VLAN_TAG_FILTER3_VID_MASK)
#define EMAC_MAC_VLAN_TAG_FILTER3_VEN        (1 << 16) /* Bit 16: VLAN Tag Enable */
#define EMAC_MAC_VLAN_TAG_FILTER3_ETV        (1 << 17) /* Bit 17: VLAN Comparison */
#define EMAC_MAC_VLAN_TAG_FILTER3_DOVLTC     (1 << 18) /* Bit 18: Disable VLAN Type Comparison */
#define EMAC_MAC_VLAN_TAG_FILTER3_ERSVLM     (1 << 19) /* Bit 19: Enable S-VLAN Match */
#define EMAC_MAC_VLAN_TAG_FILTER3_ERIVLT     (1 << 20) /* Bit 20: Enable Inner VLAN Tag */
#define EMAC_MAC_VLAN_TAG_FILTER3_DMACHEN    (1 << 24) /* Bit 24: DMA Channel Number Enable */
#define EMAC_MAC_VLAN_TAG_FILTER3_DMACHN     (1 << 25) /* Bit 25: DMA Channel Number */

/* MAC VLAN Hash Table (MAC_VLAN_HASH_TABLE) */
#define EMAC_MAC_VLAN_HASH_TABLE_VLHT_SHIFT  (0) /* Bits 0-16: VLAN Hash Table */
#define EMAC_MAC_VLAN_HASH_TABLE_VLHT_MASK   (0xffff << EMAC_MAC_VLAN_HASH_TABLE_VLHT_SHIFT)
#define EMAC_MAC_VLAN_HASH_TABLE_VLHT(n)     (((n) << EMAC_MAC_VLAN_HASH_TABLE_VLHT_SHIFT) & EMAC_MAC_VLAN_HASH_TABLE_VLHT_MASK)

/* MAC VLAN Inclusion Or Replacement (MAC_VLAN_INCL) */
#define EMAC_MAC_VLAN_INCL_VLT_SHIFT  (0) /* Bits 0-16: VLAN Tag For Transmit Packets */
#define EMAC_MAC_VLAN_INCL_VLT_MASK   (0xffff << EMAC_MAC_VLAN_INCL_VLT_SHIFT)
#define EMAC_MAC_VLAN_INCL_VLT(n)     (((n) << EMAC_MAC_VLAN_INCL_VLT_SHIFT) & EMAC_MAC_VLAN_INCL_VLT_MASK)
#define EMAC_MAC_VLAN_INCL_VLC_SHIFT  (16) /* Bits 16-18: VLAN Tag Control */
#define EMAC_MAC_VLAN_INCL_VLC_MASK   (0x3 << EMAC_MAC_VLAN_INCL_VLC_SHIFT)
#define EMAC_MAC_VLAN_INCL_VLC(n)     (((n) << EMAC_MAC_VLAN_INCL_VLC_SHIFT) & EMAC_MAC_VLAN_INCL_VLC_MASK)
#define EMAC_MAC_VLAN_INCL_VLP        (1 << 18) /* Bit 18: VLAN Priority Control */
#define EMAC_MAC_VLAN_INCL_CSVL       (1 << 19) /* Bit 19: C-VLAN Or S-VLAN */
#define EMAC_MAC_VLAN_INCL_VLTI       (1 << 20) /* Bit 20: VLAN Tag Input */
#define EMAC_MAC_VLAN_INCL_CBTI       (1 << 21) /* Bit 21: Channel-Based Tag Insertion */
#define EMAC_MAC_VLAN_INCL_ADDR       (1 << 24) /* Bit 24: Address */
#define EMAC_MAC_VLAN_INCL_RDWR       (1 << 30) /* Bit 30: Read Write Control */
#define EMAC_MAC_VLAN_INCL_BUSY       (1 << 31) /* Bit 31: Busy */

/* Inner VLAN Tag Inclusion Or Replacement (MAC_INNER_VLAN_INCL) */
#define EMAC_MAC_INNER_VLAN_INCL_VLT_SHIFT  (0) /* Bits 0-16: VLAN Tag For Transmit Packets */
#define EMAC_MAC_INNER_VLAN_INCL_VLT_MASK   (0xffff << EMAC_MAC_INNER_VLAN_INCL_VLT_SHIFT)
#define EMAC_MAC_INNER_VLAN_INCL_VLT(n)     (((n) << EMAC_MAC_INNER_VLAN_INCL_VLT_SHIFT) & EMAC_MAC_INNER_VLAN_INCL_VLT_MASK)
#define EMAC_MAC_INNER_VLAN_INCL_VLC_SHIFT  (16) /* Bits 16-18: VLAN Tag Control in Transmit Packets */
#define EMAC_MAC_INNER_VLAN_INCL_VLC_MASK   (0x3 << EMAC_MAC_INNER_VLAN_INCL_VLC_SHIFT)
#define EMAC_MAC_INNER_VLAN_INCL_VLC(n)     (((n) << EMAC_MAC_INNER_VLAN_INCL_VLC_SHIFT) & EMAC_MAC_INNER_VLAN_INCL_VLC_MASK)
#define EMAC_MAC_INNER_VLAN_INCL_VLP        (1 << 18) /* Bit 18: VLAN Priority Control */
#define EMAC_MAC_INNER_VLAN_INCL_CSVL       (1 << 19) /* Bit 19: C-VLAN Or S-VLAN */
#define EMAC_MAC_INNER_VLAN_INCL_VLTI       (1 << 20) /* Bit 20: VLAN Tag Input */

/* MAC Q0 Tx Flow Control (MAC_Q0_TX_FLOW_CTRL) */
#define EMAC_MAC_Q0_TX_FLOW_CTRL_FCB_BPA    (1 << 0) /* Bit 0: Flow Control Busy Or Backpressure Activate */
#define EMAC_MAC_Q0_TX_FLOW_CTRL_TFE        (1 << 1) /* Bit 1: Transmit Flow Control Enable */
#define EMAC_MAC_Q0_TX_FLOW_CTRL_PLT_SHIFT  (4)      /* Bits 4-7: Pause Low Threshold */
#define EMAC_MAC_Q0_TX_FLOW_CTRL_PLT_MASK   (0x7 << EMAC_MAC_Q0_TX_FLOW_CTRL_PLT_SHIFT)
#define EMAC_MAC_Q0_TX_FLOW_CTRL_PLT(n)     (((n) << EMAC_MAC_Q0_TX_FLOW_CTRL_PLT_SHIFT) & EMAC_MAC_Q0_TX_FLOW_CTRL_PLT_MASK)
#define EMAC_MAC_Q0_TX_FLOW_CTRL_DZPQ       (1 << 7) /* Bit 7: Disable Zero-Quanta Pause */
#define EMAC_MAC_Q0_TX_FLOW_CTRL_PT_SHIFT   (16)     /* Bits 16-32: Pause Time */
#define EMAC_MAC_Q0_TX_FLOW_CTRL_PT_MASK    (0xffff << EMAC_MAC_Q0_TX_FLOW_CTRL_PT_SHIFT)
#define EMAC_MAC_Q0_TX_FLOW_CTRL_PT(n)      (((n) << EMAC_MAC_Q0_TX_FLOW_CTRL_PT_SHIFT) & EMAC_MAC_Q0_TX_FLOW_CTRL_PT_MASK)

/* MAC Receive Flow Control (MAC_RX_FLOW_CTRL) */
#define EMAC_MAC_RX_FLOW_CTRL_RFE  (1 << 0) /* Bit 0: Receive Flow Control Enable */
#define EMAC_MAC_RX_FLOW_CTRL_UP   (1 << 1) /* Bit 1: Unicast Pause Packet Detect */

/* MAC RxQ Control 4 (MAC_RXQ_CTRL4) */
#define EMAC_MAC_RXQ_CTRL4_UFFQE  (1 << 0)  /* Bit 0: Unicast Address Filter Fail Packets Queuing Enable */
#define EMAC_MAC_RXQ_CTRL4_UFFQ   (1 << 1)  /* Bit 1: Unicast Address Filter Fail Packets Queue */
#define EMAC_MAC_RXQ_CTRL4_MFFQE  (1 << 8)  /* Bit 8: Multicast Address Filter Fail Packets Queuing Enable */
#define EMAC_MAC_RXQ_CTRL4_MFFQ   (1 << 9)  /* Bit 9: Multicast Address Filter Fail Packets Queue */
#define EMAC_MAC_RXQ_CTRL4_VFFQE  (1 << 16) /* Bit 16: VLAN Tag Filter Fail Packets Queuing Enable */
#define EMAC_MAC_RXQ_CTRL4_VFFQ   (1 << 17) /* Bit 17: VLAN Tag Filter Fail Packets Queue */

/* MAC RxQ Control 0 (MAC_RXQ_CTRL0) */
#define EMAC_MAC_RXQ_CTRL0_RXQ0EN_SHIFT   (0) /* Bits 0-2: Receive Queue 0 Enable */
#define EMAC_MAC_RXQ_CTRL0_RXQ0EN_MASK    (0x3 << EMAC_MAC_RXQ_CTRL0_RXQ0EN_SHIFT)
#define EMAC_MAC_RXQ_CTRL0_RXQ0EN(n)      (((n) << EMAC_MAC_RXQ_CTRL0_RXQ0EN_SHIFT) & EMAC_MAC_RXQ_CTRL0_RXQ0EN_MASK)
#define EMAC_MAC_RXQ_CTRL0_RXQ0EN_DISABLE EMAC_MAC_RXQ_CTRL0_RXQ0EN(0)
#define EMAC_MAC_RXQ_CTRL0_RXQ0EN_AVB     EMAC_MAC_RXQ_CTRL0_RXQ0EN(0x1)
#define EMAC_MAC_RXQ_CTRL0_RXQ0EN_DCB_GEN EMAC_MAC_RXQ_CTRL0_RXQ0EN(0x2)
#define EMAC_MAC_RXQ_CTRL0_RXQ1EN_SHIFT   (2) /* Bits 2-4: Receive Queue 1 Enable */
#define EMAC_MAC_RXQ_CTRL0_RXQ1EN_MASK    (0x3 << EMAC_MAC_RXQ_CTRL0_RXQ1EN_SHIFT)
#define EMAC_MAC_RXQ_CTRL0_RXQ1EN(n)      (((n) << EMAC_MAC_RXQ_CTRL0_RXQ1EN_SHIFT) & EMAC_MAC_RXQ_CTRL0_RXQ1EN_MASK)
#define EMAC_MAC_RXQ_CTRL0_RXQ1EN_DISABLE EMAC_MAC_RXQ_CTRL0_RXQ1EN(0)
#define EMAC_MAC_RXQ_CTRL0_RXQ1EN_AVB     EMAC_MAC_RXQ_CTRL0_RXQ1EN(0x1)
#define EMAC_MAC_RXQ_CTRL0_RXQ1EN_DCB_GEN EMAC_MAC_RXQ_CTRL0_RXQ1EN(0x2)

/* Receive Queue Control 1 (MAC_RXQ_CTRL1) */
#define EMAC_MAC_RXQ_CTRL1_AVCPQ_SHIFT  (0) /* Bits 0-3: AV Untagged Control Packets Queue */
#define EMAC_MAC_RXQ_CTRL1_AVCPQ_MASK   (0x7 << EMAC_MAC_RXQ_CTRL1_AVCPQ_SHIFT)
#define EMAC_MAC_RXQ_CTRL1_AVCPQ(n)     (((n) << EMAC_MAC_RXQ_CTRL1_AVCPQ_SHIFT) & EMAC_MAC_RXQ_CTRL1_AVCPQ_MASK)
#define EMAC_MAC_RXQ_CTRL1_PTPQ_SHIFT   (4) /* Bits 4-7: PTP Packets Queue */
#define EMAC_MAC_RXQ_CTRL1_PTPQ_MASK    (0x7 << EMAC_MAC_RXQ_CTRL1_PTPQ_SHIFT)
#define EMAC_MAC_RXQ_CTRL1_PTPQ(n)      (((n) << EMAC_MAC_RXQ_CTRL1_PTPQ_SHIFT) & EMAC_MAC_RXQ_CTRL1_PTPQ_MASK)
#define EMAC_MAC_RXQ_CTRL1_UPQ_SHIFT    (12) /* Bits 12-15: Untagged Packet Queue */
#define EMAC_MAC_RXQ_CTRL1_UPQ_MASK     (0x7 << EMAC_MAC_RXQ_CTRL1_UPQ_SHIFT)
#define EMAC_MAC_RXQ_CTRL1_UPQ(n)       (((n) << EMAC_MAC_RXQ_CTRL1_UPQ_SHIFT) & EMAC_MAC_RXQ_CTRL1_UPQ_MASK)
#define EMAC_MAC_RXQ_CTRL1_MCBCQ_SHIFT  (16) /* Bits 16-19: Multicast And Broadcast Queue */
#define EMAC_MAC_RXQ_CTRL1_MCBCQ_MASK   (0x7 << EMAC_MAC_RXQ_CTRL1_MCBCQ_SHIFT)
#define EMAC_MAC_RXQ_CTRL1_MCBCQ(n)     (((n) << EMAC_MAC_RXQ_CTRL1_MCBCQ_SHIFT) & EMAC_MAC_RXQ_CTRL1_MCBCQ_MASK)
#define EMAC_MAC_RXQ_CTRL1_MCBCQEN      (1 << 20) /* Bit 20: Multicast And Broadcast Queue Enable */
#define EMAC_MAC_RXQ_CTRL1_TACPQE       (1 << 21) /* Bit 21: Tagged AV Control Packets Queuing Enable */
#define EMAC_MAC_RXQ_CTRL1_TPQC_SHIFT   (22)      /* Bits 22-24: Tagged PTP Over Ethernet Packets Queuing Control */
#define EMAC_MAC_RXQ_CTRL1_TPQC_MASK    (0x3 << EMAC_MAC_RXQ_CTRL1_TPQC_SHIFT)
#define EMAC_MAC_RXQ_CTRL1_TPQC(n)      (((n) << EMAC_MAC_RXQ_CTRL1_TPQC_SHIFT) & EMAC_MAC_RXQ_CTRL1_TPQC_MASK)
#define EMAC_MAC_RXQ_CTRL1_FPRQ_SHIFT   (24) /* Bits 24-27: Frame Preemption Residue Queue */
#define EMAC_MAC_RXQ_CTRL1_FPRQ_MASK    (0x7 << EMAC_MAC_RXQ_CTRL1_FPRQ_SHIFT)
#define EMAC_MAC_RXQ_CTRL1_FPRQ(n)      (((n) << EMAC_MAC_RXQ_CTRL1_FPRQ_SHIFT) & EMAC_MAC_RXQ_CTRL1_FPRQ_MASK)

/* MAC RxQ Control 2 (MAC_RXQ_CTRL2) */
#define EMAC_MAC_RXQ_CTRL2_PSRQ0_SHIFT  (0) /* Bits 0-8: Priorities Selected In Receive Queue 0 */
#define EMAC_MAC_RXQ_CTRL2_PSRQ0_MASK   (0xff << EMAC_MAC_RXQ_CTRL2_PSRQ0_SHIFT)
#define EMAC_MAC_RXQ_CTRL2_PSRQ0(n)     (((n) << EMAC_MAC_RXQ_CTRL2_PSRQ0_SHIFT) & EMAC_MAC_RXQ_CTRL2_PSRQ0_MASK)
#define EMAC_MAC_RXQ_CTRL2_PSRQ1_SHIFT  (8) /* Bits 8-16: Priorities Selected In Receive Queue 1 */
#define EMAC_MAC_RXQ_CTRL2_PSRQ1_MASK   (0xff << EMAC_MAC_RXQ_CTRL2_PSRQ1_SHIFT)
#define EMAC_MAC_RXQ_CTRL2_PSRQ1(n)     (((n) << EMAC_MAC_RXQ_CTRL2_PSRQ1_SHIFT) & EMAC_MAC_RXQ_CTRL2_PSRQ1_MASK)

/* MAC Interrupt Status (MAC_INTERRUPT_STATUS) */
#define EMAC_MAC_INTERRUPT_STATUS_PHYIS    (1 << 3)  /* Bit 3: PHY Interrupt */
#define EMAC_MAC_INTERRUPT_STATUS_MMCIS    (1 << 8)  /* Bit 8: MMC Interrupt Status */
#define EMAC_MAC_INTERRUPT_STATUS_MMCRXIS  (1 << 9)  /* Bit 9: MMC Receive Interrupt Status */
#define EMAC_MAC_INTERRUPT_STATUS_MMCTXIS  (1 << 10) /* Bit 10: MMC Transmit Interrupt Status */
#define EMAC_MAC_INTERRUPT_STATUS_TSIS     (1 << 12) /* Bit 12: Timestamp Interrupt Status */
#define EMAC_MAC_INTERRUPT_STATUS_TXSTSIS  (1 << 13) /* Bit 13: Transmit Status Interrupt */
#define EMAC_MAC_INTERRUPT_STATUS_RXSTSIS  (1 << 14) /* Bit 14: Receive Status Interrupt */
#define EMAC_MAC_INTERRUPT_STATUS_FPEIS    (1 << 17) /* Bit 17: Frame Preemption Interrupt Status */
#define EMAC_MAC_INTERRUPT_STATUS_MDIOIS   (1 << 18) /* Bit 18: MDIO Interrupt Status */
#define EMAC_MAC_INTERRUPT_STATUS_MFTIS    (1 << 19) /* Bit 19: MMC FPE Transmit Interrupt Status */
#define EMAC_MAC_INTERRUPT_STATUS_MFRIS    (1 << 20) /* Bit 20: MMC FPE Receive Interrupt Status */

