apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_emac.h
/* MAC Interrupt Enable (MAC_INTERRUPT_ENABLE) */
#define EMAC_MAC_INTERRUPT_ENABLE_PHYIE    (1 << 3)  /* Bit 3: PHY Interrupt Enable */
#define EMAC_MAC_INTERRUPT_ENABLE_TSIE     (1 << 12) /* Bit 12: Timestamp Interrupt Enable */
#define EMAC_MAC_INTERRUPT_ENABLE_TXSTSIE  (1 << 13) /* Bit 13: Transmit Status Interrupt Enable */
#define EMAC_MAC_INTERRUPT_ENABLE_RXSTSIE  (1 << 14) /* Bit 14: Receive Status Interrupt Enable */
#define EMAC_MAC_INTERRUPT_ENABLE_FPEIE    (1 << 17) /* Bit 17: Frame Preemption Interrupt Enable */
#define EMAC_MAC_INTERRUPT_ENABLE_MDIOIE   (1 << 18) /* Bit 18: MDIO Interrupt Enable */

/* MAC Rx Transmit Status (MAC_RX_TX_STATUS) */
#define EMAC_MAC_RX_TX_STATUS_TJT    (1 << 0) /* Bit 0: Transmit Jabber Timeout */
#define EMAC_MAC_RX_TX_STATUS_NCARR  (1 << 1) /* Bit 1: No Carrier */
#define EMAC_MAC_RX_TX_STATUS_LCARR  (1 << 2) /* Bit 2: Loss of Carrier */
#define EMAC_MAC_RX_TX_STATUS_EXDEF  (1 << 3) /* Bit 3: Excessive Deferral */
#define EMAC_MAC_RX_TX_STATUS_LCOL   (1 << 4) /* Bit 4: Late Collision */
#define EMAC_MAC_RX_TX_STATUS_EXCOL  (1 << 5) /* Bit 5: Excessive Collisions */
#define EMAC_MAC_RX_TX_STATUS_RWT    (1 << 8) /* Bit 8: Receive Watchdog Timeout */

/* MAC Version (MAC_VERSION) */
#define EMAC_MAC_VERSION_IPVER_SHIFT   (0) /* Bits 0-8: IP Version */
#define EMAC_MAC_VERSION_IPVER_MASK    (0xff << EMAC_MAC_VERSION_IPVER_SHIFT)
#define EMAC_MAC_VERSION_IPVER(n)      (((n) << EMAC_MAC_VERSION_IPVER_SHIFT) & EMAC_MAC_VERSION_IPVER_MASK)
#define EMAC_MAC_VERSION_CFGVER_SHIFT  (8) /* Bits 8-16: IP Configuration Version */
#define EMAC_MAC_VERSION_CFGVER_MASK   (0xff << EMAC_MAC_VERSION_CFGVER_SHIFT)
#define EMAC_MAC_VERSION_CFGVER(n)     (((n) << EMAC_MAC_VERSION_CFGVER_SHIFT) & EMAC_MAC_VERSION_CFGVER_MASK)

/* MAC Debug (MAC_DEBUG) */
#define EMAC_MAC_DEBUG_RPESTS          (1 << 0) /* Bit 0: Receive Protocol Engine Status */
#define EMAC_MAC_DEBUG_RFCFCSTS_SHIFT  (1)      /* Bits 1-3: MAC Receive Packet Controller FIFO Status */
#define EMAC_MAC_DEBUG_RFCFCSTS_MASK   (0x3 << EMAC_MAC_DEBUG_RFCFCSTS_SHIFT)
#define EMAC_MAC_DEBUG_RFCFCSTS(n)     (((n) << EMAC_MAC_DEBUG_RFCFCSTS_SHIFT) & EMAC_MAC_DEBUG_RFCFCSTS_MASK)
#define EMAC_MAC_DEBUG_TPESTS          (1 << 16) /* Bit 16: MAC GMII Or MII Transmit Protocol Engine Status */
#define EMAC_MAC_DEBUG_TFCSTS_SHIFT    (17)      /* Bits 17-19: MAC Transmit Packet Controller Status */
#define EMAC_MAC_DEBUG_TFCSTS_MASK     (0x3 << EMAC_MAC_DEBUG_TFCSTS_SHIFT)
#define EMAC_MAC_DEBUG_TFCSTS(n)       (((n) << EMAC_MAC_DEBUG_TFCSTS_SHIFT) & EMAC_MAC_DEBUG_TFCSTS_MASK)

/* MAC Hardware Feature 0 (MAC_HW_FEATURE0) */
#define EMAC_MAC_HW_FEATURE0_MIISEL              (1 << 0)  /* Bit 0: 10 or 100 Mbit/s Support Feature */
#define EMAC_MAC_HW_FEATURE0_GMIISEL             (1 << 1)  /* Bit 1: 1000 Mbit/s Support Feature */
#define EMAC_MAC_HW_FEATURE0_HDSEL               (1 << 2)  /* Bit 2: Half-Duplex Support Feature */
#define EMAC_MAC_HW_FEATURE0_PCSSEL              (1 << 3)  /* Bit 3: PCS Select */
#define EMAC_MAC_HW_FEATURE0_VLHASH              (1 << 4)  /* Bit 4: VLAN Hash Filter Feature */
#define EMAC_MAC_HW_FEATURE0_SMASEL              (1 << 5)  /* Bit 5: SMA (MDIO) Interface Feature */
#define EMAC_MAC_HW_FEATURE0_RWKSEL              (1 << 6)  /* Bit 6: PMT Remote Wake-Up Packet Feature */
#define EMAC_MAC_HW_FEATURE0_MGKSEL              (1 << 7)  /* Bit 7: PMT Magic Packet Feature */
#define EMAC_MAC_HW_FEATURE0_MMCSEL              (1 << 8)  /* Bit 8: MAC Management Counters (MMC) Feature */
#define EMAC_MAC_HW_FEATURE0_ARPOFFSEL           (1 << 9)  /* Bit 9: ARP Offload Feature */
#define EMAC_MAC_HW_FEATURE0_TSSEL               (1 << 12) /* Bit 12: IEEE 1588-2008 Timestamp Feature */
#define EMAC_MAC_HW_FEATURE0_EEESEL              (1 << 13) /* Bit 13: Energy Efficient Ethernet (EEE) Feature */
#define EMAC_MAC_HW_FEATURE0_TXCOESEL            (1 << 14) /* Bit 14: Transmit Checksum Offload Feature */
#define EMAC_MAC_HW_FEATURE0_RXCOESEL            (1 << 16) /* Bit 16: Receive Checksum Offload Feature */
#define EMAC_MAC_HW_FEATURE0_ADDMACADRSEL_SHIFT  (18)      /* Bits 18-23: MAC Addresses 1-31 */
#define EMAC_MAC_HW_FEATURE0_ADDMACADRSEL_MASK   (0x1f << EMAC_MAC_HW_FEATURE0_ADDMACADRSEL_SHIFT)
#define EMAC_MAC_HW_FEATURE0_ADDMACADRSEL(n)     (((n) << EMAC_MAC_HW_FEATURE0_ADDMACADRSEL_SHIFT) & EMAC_MAC_HW_FEATURE0_ADDMACADRSEL_MASK)
#define EMAC_MAC_HW_FEATURE0_MACADR32SEL         (1 << 23) /* Bit 23: MAC Addresses 32-63 */
#define EMAC_MAC_HW_FEATURE0_MACADR64SEL         (1 << 24) /* Bit 24: MAC Addresses 64-127 */
#define EMAC_MAC_HW_FEATURE0_TSSTSSEL_SHIFT      (25)      /* Bits 25-27: Timestamp System Time Source Feature */
#define EMAC_MAC_HW_FEATURE0_TSSTSSEL_MASK       (0x3 << EMAC_MAC_HW_FEATURE0_TSSTSSEL_SHIFT)
#define EMAC_MAC_HW_FEATURE0_TSSTSSEL(n)         (((n) << EMAC_MAC_HW_FEATURE0_TSSTSSEL_SHIFT) & EMAC_MAC_HW_FEATURE0_TSSTSSEL_MASK)
#define EMAC_MAC_HW_FEATURE0_SAVLANINS           (1 << 27) /* Bit 27: SA or VLAN Insertion Feature */
#define EMAC_MAC_HW_FEATURE0_ACTPHYSEL_SHIFT     (28)      /* Bits 28-31: Active PHY Feature */
#define EMAC_MAC_HW_FEATURE0_ACTPHYSEL_MASK      (0x7 << EMAC_MAC_HW_FEATURE0_ACTPHYSEL_SHIFT)
#define EMAC_MAC_HW_FEATURE0_ACTPHYSEL(n)        (((n) << EMAC_MAC_HW_FEATURE0_ACTPHYSEL_SHIFT) & EMAC_MAC_HW_FEATURE0_ACTPHYSEL_MASK)

/* MAC Hardware Feature 1 (MAC_HW_FEATURE1) */
#define EMAC_MAC_HW_FEATURE1_RXFIFOSIZE_SHIFT  (0) /* Bits 0-5: MTL Receive FIFO Size Feature */
#define EMAC_MAC_HW_FEATURE1_RXFIFOSIZE_MASK   (0x1f << EMAC_MAC_HW_FEATURE1_RXFIFOSIZE_SHIFT)
#define EMAC_MAC_HW_FEATURE1_RXFIFOSIZE(n)     (((n) << EMAC_MAC_HW_FEATURE1_RXFIFOSIZE_SHIFT) & EMAC_MAC_HW_FEATURE1_RXFIFOSIZE_MASK)
#define EMAC_MAC_HW_FEATURE1_SPRAM             (1 << 5) /* Bit 5: Single Port RAM Feature */
#define EMAC_MAC_HW_FEATURE1_TXFIFOSIZE_SHIFT  (6)      /* Bits 6-11: MTL Transmit FIFO Size Feature */
#define EMAC_MAC_HW_FEATURE1_TXFIFOSIZE_MASK   (0x1f << EMAC_MAC_HW_FEATURE1_TXFIFOSIZE_SHIFT)
#define EMAC_MAC_HW_FEATURE1_TXFIFOSIZE(n)     (((n) << EMAC_MAC_HW_FEATURE1_TXFIFOSIZE_SHIFT) & EMAC_MAC_HW_FEATURE1_TXFIFOSIZE_MASK)
#define EMAC_MAC_HW_FEATURE1_OSTEN             (1 << 11) /* Bit 11: One-Step Timestamping Enable Feature */
#define EMAC_MAC_HW_FEATURE1_PTOEN             (1 << 12) /* Bit 12: PTP Offload Enable Feature */
#define EMAC_MAC_HW_FEATURE1_ADVTHWORD         (1 << 13) /* Bit 13: IEEE 1588 High-Word Feature */
#define EMAC_MAC_HW_FEATURE1_ADDR64_SHIFT      (14)      /* Bits 14-16: Address Width Feature */
#define EMAC_MAC_HW_FEATURE1_ADDR64_MASK       (0x3 << EMAC_MAC_HW_FEATURE1_ADDR64_SHIFT)
#define EMAC_MAC_HW_FEATURE1_ADDR64(n)         (((n) << EMAC_MAC_HW_FEATURE1_ADDR64_SHIFT) & EMAC_MAC_HW_FEATURE1_ADDR64_MASK)
#define EMAC_MAC_HW_FEATURE1_DCBEN             (1 << 16) /* Bit 16: DCB Enable Feature */
#define EMAC_MAC_HW_FEATURE1_SPHEN             (1 << 17) /* Bit 17: Split Header Enable Feature */
#define EMAC_MAC_HW_FEATURE1_TSOEN             (1 << 18) /* Bit 18: TCP Segmentation Offload Enable Feature */
#define EMAC_MAC_HW_FEATURE1_DBGMEMA           (1 << 19) /* Bit 19: DMA Debug Registers Enable Feature */
#define EMAC_MAC_HW_FEATURE1_AVSEL             (1 << 20) /* Bit 20: AV Feature */
#define EMAC_MAC_HW_FEATURE1_RAVSEL            (1 << 21) /* Bit 21: Receive Side-Only AV Feature */
#define EMAC_MAC_HW_FEATURE1_POUOST            (1 << 23) /* Bit 23: One Step For PTP Over UDP/IP Feature */
#define EMAC_MAC_HW_FEATURE1_HASHTBLSZ_SHIFT   (24)      /* Bits 24-26: Hash Table Size */
#define EMAC_MAC_HW_FEATURE1_HASHTBLSZ_MASK    (0x3 << EMAC_MAC_HW_FEATURE1_HASHTBLSZ_SHIFT)
#define EMAC_MAC_HW_FEATURE1_HASHTBLSZ(n)      (((n) << EMAC_MAC_HW_FEATURE1_HASHTBLSZ_SHIFT) & EMAC_MAC_HW_FEATURE1_HASHTBLSZ_MASK)
#define EMAC_MAC_HW_FEATURE1_L3L4FNUM_SHIFT    (27) /* Bits 27-31: L3 Or L4 Filter Number */
#define EMAC_MAC_HW_FEATURE1_L3L4FNUM_MASK     (0xf << EMAC_MAC_HW_FEATURE1_L3L4FNUM_SHIFT)
#define EMAC_MAC_HW_FEATURE1_L3L4FNUM(n)       (((n) << EMAC_MAC_HW_FEATURE1_L3L4FNUM_SHIFT) & EMAC_MAC_HW_FEATURE1_L3L4FNUM_MASK)

/* MAC Hardware Feature 2 (MAC_HW_FEATURE2) */
#define EMAC_MAC_HW_FEATURE2_RXQCNT_SHIFT      (0) /* Bits 0-4: Number Of MTL Receive Queues */
#define EMAC_MAC_HW_FEATURE2_RXQCNT_MASK       (0xf << EMAC_MAC_HW_FEATURE2_RXQCNT_SHIFT)
#define EMAC_MAC_HW_FEATURE2_RXQCNT(n)         (((n) << EMAC_MAC_HW_FEATURE2_RXQCNT_SHIFT) & EMAC_MAC_HW_FEATURE2_RXQCNT_MASK)
#define EMAC_MAC_HW_FEATURE2_TXQCNT_SHIFT      (6) /* Bits 6-10: Number Of MTL Transmit Queues */
#define EMAC_MAC_HW_FEATURE2_TXQCNT_MASK       (0xf << EMAC_MAC_HW_FEATURE2_TXQCNT_SHIFT)
#define EMAC_MAC_HW_FEATURE2_TXQCNT(n)         (((n) << EMAC_MAC_HW_FEATURE2_TXQCNT_SHIFT) & EMAC_MAC_HW_FEATURE2_TXQCNT_MASK)
#define EMAC_MAC_HW_FEATURE2_RXCHCNT_SHIFT     (12) /* Bits 12-16: Number Of DMA Receive Channels */
#define EMAC_MAC_HW_FEATURE2_RXCHCNT_MASK      (0xf << EMAC_MAC_HW_FEATURE2_RXCHCNT_SHIFT)
#define EMAC_MAC_HW_FEATURE2_RXCHCNT(n)        (((n) << EMAC_MAC_HW_FEATURE2_RXCHCNT_SHIFT) & EMAC_MAC_HW_FEATURE2_RXCHCNT_MASK)
#define EMAC_MAC_HW_FEATURE2_TXCHCNT_SHIFT     (18) /* Bits 18-22: Number Of DMA Transmit Channels */
#define EMAC_MAC_HW_FEATURE2_TXCHCNT_MASK      (0xf << EMAC_MAC_HW_FEATURE2_TXCHCNT_SHIFT)
#define EMAC_MAC_HW_FEATURE2_TXCHCNT(n)        (((n) << EMAC_MAC_HW_FEATURE2_TXCHCNT_SHIFT) & EMAC_MAC_HW_FEATURE2_TXCHCNT_MASK)
#define EMAC_MAC_HW_FEATURE2_PPSOUTNUM_SHIFT   (24) /* Bits 24-27: Number Of PPS Outputs */
#define EMAC_MAC_HW_FEATURE2_PPSOUTNUM_MASK    (0x7 << EMAC_MAC_HW_FEATURE2_PPSOUTNUM_SHIFT)
#define EMAC_MAC_HW_FEATURE2_PPSOUTNUM(n)      (((n) << EMAC_MAC_HW_FEATURE2_PPSOUTNUM_SHIFT) & EMAC_MAC_HW_FEATURE2_PPSOUTNUM_MASK)
#define EMAC_MAC_HW_FEATURE2_AUXSNAPNUM_SHIFT  (28) /* Bits 28-31: Number Of Auxiliary Snapshot Inputs */
#define EMAC_MAC_HW_FEATURE2_AUXSNAPNUM_MASK   (0x7 << EMAC_MAC_HW_FEATURE2_AUXSNAPNUM_SHIFT)
#define EMAC_MAC_HW_FEATURE2_AUXSNAPNUM(n)     (((n) << EMAC_MAC_HW_FEATURE2_AUXSNAPNUM_SHIFT) & EMAC_MAC_HW_FEATURE2_AUXSNAPNUM_MASK)

/* MAC Hardware Feature 3 (MAC_HW_FEATURE3) */
#define EMAC_MAC_HW_FEATURE3_NRVF_SHIFT    (0) /* Bits 0-3: Number Of Extended VLAN Tag Filters Indicates the number of selected extended VLAN tag filters. */
#define EMAC_MAC_HW_FEATURE3_NRVF_MASK     (0x7 << EMAC_MAC_HW_FEATURE3_NRVF_SHIFT)
#define EMAC_MAC_HW_FEATURE3_NRVF(n)       (((n) << EMAC_MAC_HW_FEATURE3_NRVF_SHIFT) & EMAC_MAC_HW_FEATURE3_NRVF_MASK)
#define EMAC_MAC_HW_FEATURE3_CBTISEL       (1 << 4)  /* Bit 4: Queue/Channel Based VLAN Tag Insertion On Transmit Feature */
#define EMAC_MAC_HW_FEATURE3_DVLAN         (1 << 5)  /* Bit 5: Double VLAN Tag Processing Feature */
#define EMAC_MAC_HW_FEATURE3_PDUPSEL       (1 << 9)  /* Bit 9: Broadcast/Multicast Packet Duplication Feature */
#define EMAC_MAC_HW_FEATURE3_FRPSEL        (1 << 10) /* Bit 10: Flexible Receive Parser Feature */
#define EMAC_MAC_HW_FEATURE3_FRPBS_SHIFT   (11)      /* Bits 11-13: Flexible Receive Parser Buffer Size */
#define EMAC_MAC_HW_FEATURE3_FRPBS_MASK    (0x3 << EMAC_MAC_HW_FEATURE3_FRPBS_SHIFT)
#define EMAC_MAC_HW_FEATURE3_FRPBS(n)      (((n) << EMAC_MAC_HW_FEATURE3_FRPBS_SHIFT) & EMAC_MAC_HW_FEATURE3_FRPBS_MASK)
#define EMAC_MAC_HW_FEATURE3_FRPES_SHIFT   (13) /* Bits 13-15: Flexible Receive Parser Table Entry Size */
#define EMAC_MAC_HW_FEATURE3_FRPES_MASK    (0x3 << EMAC_MAC_HW_FEATURE3_FRPES_SHIFT)
#define EMAC_MAC_HW_FEATURE3_FRPES(n)      (((n) << EMAC_MAC_HW_FEATURE3_FRPES_SHIFT) & EMAC_MAC_HW_FEATURE3_FRPES_MASK)
#define EMAC_MAC_HW_FEATURE3_ESTSEL        (1 << 16) /* Bit 16: Enhancements To Scheduling Traffic Feature */
#define EMAC_MAC_HW_FEATURE3_ESTDEP_SHIFT  (17)      /* Bits 17-20: Depth Of Gate Control List */
#define EMAC_MAC_HW_FEATURE3_ESTDEP_MASK   (0x7 << EMAC_MAC_HW_FEATURE3_ESTDEP_SHIFT)
#define EMAC_MAC_HW_FEATURE3_ESTDEP(n)     (((n) << EMAC_MAC_HW_FEATURE3_ESTDEP_SHIFT) & EMAC_MAC_HW_FEATURE3_ESTDEP_MASK)
#define EMAC_MAC_HW_FEATURE3_ESTWID_SHIFT  (20) /* Bits 20-22: Estimated Time Interval Width */
#define EMAC_MAC_HW_FEATURE3_ESTWID_MASK   (0x3 << EMAC_MAC_HW_FEATURE3_ESTWID_SHIFT)
#define EMAC_MAC_HW_FEATURE3_ESTWID(n)     (((n) << EMAC_MAC_HW_FEATURE3_ESTWID_SHIFT) & EMAC_MAC_HW_FEATURE3_ESTWID_MASK)
#define EMAC_MAC_HW_FEATURE3_FPESEL        (1 << 26) /* Bit 26: Frame Preemption Feature */
#define EMAC_MAC_HW_FEATURE3_TBSSEL        (1 << 27) /* Bit 27: Time-Based Scheduling Feature */
#define EMAC_MAC_HW_FEATURE3_ASP_SHIFT     (28)      /* Bits 28-30: Automotive Safety Package */
#define EMAC_MAC_HW_FEATURE3_ASP_MASK      (0x3 << EMAC_MAC_HW_FEATURE3_ASP_SHIFT)
#define EMAC_MAC_HW_FEATURE3_ASP(n)        (((n) << EMAC_MAC_HW_FEATURE3_ASP_SHIFT) & EMAC_MAC_HW_FEATURE3_ASP_MASK)

/* MAC DPP FSM Interrupt Status (MAC_DPP_FSM_INTERRUPT_STATUS) */
#define EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_RDPES   (1 << 2)  /* Bit 2: Read Descriptor Parity Checker Error Status */
#define EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MPES    (1 << 3)  /* Bit 3: MTL Data Path Parity Checker Error Status */
#define EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MTSPES  (1 << 4)  /* Bit 4: MTL Transmit Status Data Path Parity Checker Error Status */
#define EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_ARPES   (1 << 5)  /* Bit 5: Application Receive Interface Data Path Parity Error Status */
#define EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_TTES    (1 << 8)  /* Bit 8: Transmit FSM Timeout Error Status */
#define EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_RTES    (1 << 9)  /* Bit 9: Receive FSM Timeout Error Status */
#define EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_ATES    (1 << 11) /* Bit 11: APP FSM Timeout Error Status */
#define EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_PTES    (1 << 12) /* Bit 12: PTP FSM Timeout Error Status */
#define EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MSTTES  (1 << 16) /* Bit 16: Master Read Or Write Timeout Error Status */
#define EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_FSMPES  (1 << 24) /* Bit 24: FSM State Parity Error Status */

