apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_emac.h
/* MAC FSM Control (MAC_FSM_CONTROL) */
#define EMAC_MAC_FSM_CONTROL_TMOUTEN  (1 << 0)  /* Bit 0: Time Out Enable */
#define EMAC_MAC_FSM_CONTROL_PRTYEN   (1 << 1)  /* Bit 1: Parity Enable */
#define EMAC_MAC_FSM_CONTROL_TTEIN    (1 << 8)  /* Bit 8: Transmit FSM Timeout Error Injection */
#define EMAC_MAC_FSM_CONTROL_RTEIN    (1 << 9)  /* Bit 9: Receive FSM Timeout Error Injection */
#define EMAC_MAC_FSM_CONTROL_ATEIN    (1 << 11) /* Bit 11: APP FSM Timeout Error Injection */
#define EMAC_MAC_FSM_CONTROL_PTEIN    (1 << 12) /* Bit 12: PTP FSM Timeout Error Injection */
#define EMAC_MAC_FSM_CONTROL_TPEIN    (1 << 16) /* Bit 16: Transmit FSM Parity Error Injection */
#define EMAC_MAC_FSM_CONTROL_RPEIN    (1 << 17) /* Bit 17: Receive FSM Parity Error Injection */
#define EMAC_MAC_FSM_CONTROL_APEIN    (1 << 19) /* Bit 19: APP FSM Parity Error Injection */
#define EMAC_MAC_FSM_CONTROL_PPEIN    (1 << 20) /* Bit 20: PTP FSM Parity Error Injection */
#define EMAC_MAC_FSM_CONTROL_TLGRNML  (1 << 24) /* Bit 24: Transmit Large Or Normal Mode Select */
#define EMAC_MAC_FSM_CONTROL_RLGRNML  (1 << 25) /* Bit 25: Receive Large Or Normal Mode Select */
#define EMAC_MAC_FSM_CONTROL_ALGRNML  (1 << 27) /* Bit 27: APP Large Or Normal Mode Select */
#define EMAC_MAC_FSM_CONTROL_PLGRNML  (1 << 28) /* Bit 28: PTP Large Or Normal Mode Select */

/* MAC FSM ACT Timer (MAC_FSM_ACT_TIMER) */
#define EMAC_MAC_FSM_ACT_TIMER_TMR_SHIFT     (0) /* Bits 0-10: CSR Clocks For 1 us Tic */
#define EMAC_MAC_FSM_ACT_TIMER_TMR_MASK      (0x3ff << EMAC_MAC_FSM_ACT_TIMER_TMR_SHIFT)
#define EMAC_MAC_FSM_ACT_TIMER_TMR(n)        (((n) << EMAC_MAC_FSM_ACT_TIMER_TMR_SHIFT) & EMAC_MAC_FSM_ACT_TIMER_TMR_MASK)
#define EMAC_MAC_FSM_ACT_TIMER_NTMRMD_SHIFT  (16) /* Bits 16-20: Normal Mode Timeout Value */
#define EMAC_MAC_FSM_ACT_TIMER_NTMRMD_MASK   (0xf << EMAC_MAC_FSM_ACT_TIMER_NTMRMD_SHIFT)
#define EMAC_MAC_FSM_ACT_TIMER_NTMRMD(n)     (((n) << EMAC_MAC_FSM_ACT_TIMER_NTMRMD_SHIFT) & EMAC_MAC_FSM_ACT_TIMER_NTMRMD_MASK)
#define EMAC_MAC_FSM_ACT_TIMER_LTMRMD_SHIFT  (20) /* Bits 20-24: Large Mode Timeout Value */
#define EMAC_MAC_FSM_ACT_TIMER_LTMRMD_MASK   (0xf << EMAC_MAC_FSM_ACT_TIMER_LTMRMD_SHIFT)
#define EMAC_MAC_FSM_ACT_TIMER_LTMRMD(n)     (((n) << EMAC_MAC_FSM_ACT_TIMER_LTMRMD_SHIFT) & EMAC_MAC_FSM_ACT_TIMER_LTMRMD_MASK)

/* SCS_REG 1 (SCS_REG1) */
#define EMAC_SCS_REG1_MAC_SCS1_SHIFT  (0) /* Bits 0-32: MAC SCS 1 */
#define EMAC_SCS_REG1_MAC_SCS1_MASK   (0xffffffff << EMAC_SCS_REG1_MAC_SCS1_SHIFT)
#define EMAC_SCS_REG1_MAC_SCS1(n)     (((n) << EMAC_SCS_REG1_MAC_SCS1_SHIFT) & EMAC_SCS_REG1_MAC_SCS1_MASK)

/* MAC MDIO Address (MAC_MDIO_ADDRESS) */
#define EMAC_MAC_MDIO_ADDRESS_GB         (1 << 0) /* Bit 0: GMII Busy */
#define EMAC_MAC_MDIO_ADDRESS_C45E       (1 << 1) /* Bit 1: Clause 45 PHY Enable */
#define EMAC_MAC_MDIO_ADDRESS_GOC_0      (1 << 2) /* Bit 2: GMII Operation Command 0 */
#define EMAC_MAC_MDIO_ADDRESS_GOC_1      (1 << 3) /* Bit 3: GMII Operation Command 1 */
#define EMAC_MAC_MDIO_ADDRESS_SKAP       (1 << 4) /* Bit 4: Skip Address Packet */
#define EMAC_MAC_MDIO_ADDRESS_CR_SHIFT   (8)      /* Bits 8-12: CSR Clock Range */
#define EMAC_MAC_MDIO_ADDRESS_CR_MASK    (0xf << EMAC_MAC_MDIO_ADDRESS_CR_SHIFT)
#define EMAC_MAC_MDIO_ADDRESS_CR(n)      (((n) << EMAC_MAC_MDIO_ADDRESS_CR_SHIFT) & EMAC_MAC_MDIO_ADDRESS_CR_MASK)
#define EMAC_MAC_MDIO_ADDRESS_NTC_SHIFT  (12) /* Bits 12-15: Number Of Trailing Clocks */
#define EMAC_MAC_MDIO_ADDRESS_NTC_MASK   (0x7 << EMAC_MAC_MDIO_ADDRESS_NTC_SHIFT)
#define EMAC_MAC_MDIO_ADDRESS_NTC(n)     (((n) << EMAC_MAC_MDIO_ADDRESS_NTC_SHIFT) & EMAC_MAC_MDIO_ADDRESS_NTC_MASK)
#define EMAC_MAC_MDIO_ADDRESS_RDA_SHIFT  (16) /* Bits 16-21: Register Or Device Address */
#define EMAC_MAC_MDIO_ADDRESS_RDA_MASK   (0x1f << EMAC_MAC_MDIO_ADDRESS_RDA_SHIFT)
#define EMAC_MAC_MDIO_ADDRESS_RDA(n)     (((n) << EMAC_MAC_MDIO_ADDRESS_RDA_SHIFT) & EMAC_MAC_MDIO_ADDRESS_RDA_MASK)
#define EMAC_MAC_MDIO_ADDRESS_PA_SHIFT   (21) /* Bits 21-26: Physical Layer Address */
#define EMAC_MAC_MDIO_ADDRESS_PA_MASK    (0x1f << EMAC_MAC_MDIO_ADDRESS_PA_SHIFT)
#define EMAC_MAC_MDIO_ADDRESS_PA(n)      (((n) << EMAC_MAC_MDIO_ADDRESS_PA_SHIFT) & EMAC_MAC_MDIO_ADDRESS_PA_MASK)
#define EMAC_MAC_MDIO_ADDRESS_BTB        (1 << 26) /* Bit 26: Back-To-Back Transactions */
#define EMAC_MAC_MDIO_ADDRESS_PSE        (1 << 27) /* Bit 27: Preamble Suppression Enable */

/* MAC MDIO Data (MAC_MDIO_DATA) */
#define EMAC_MAC_MDIO_DATA_GD_SHIFT  (0) /* Bits 0-16: GMII Data */
#define EMAC_MAC_MDIO_DATA_GD_MASK   (0xffff << EMAC_MAC_MDIO_DATA_GD_SHIFT)
#define EMAC_MAC_MDIO_DATA_GD(n)     (((n) << EMAC_MAC_MDIO_DATA_GD_SHIFT) & EMAC_MAC_MDIO_DATA_GD_MASK)
#define EMAC_MAC_MDIO_DATA_RA_SHIFT  (16) /* Bits 16-32: Register Address */
#define EMAC_MAC_MDIO_DATA_RA_MASK   (0xffff << EMAC_MAC_MDIO_DATA_RA_SHIFT)
#define EMAC_MAC_MDIO_DATA_RA(n)     (((n) << EMAC_MAC_MDIO_DATA_RA_SHIFT) & EMAC_MAC_MDIO_DATA_RA_MASK)

/* MAC CSR Software Control (MAC_CSR_SW_CTRL) */
#define EMAC_MAC_CSR_SW_CTRL_RCWE  (1 << 0) /* Bit 0: Enable Register Write 1 To Clear (W1C) */
#define EMAC_MAC_CSR_SW_CTRL_SEEN  (1 << 8) /* Bit 8: Slave Error Response Enable */

/* MAC FPE Control STS (MAC_FPE_CTRL_STS) */
#define EMAC_MAC_FPE_CTRL_STS_EFPE      (1 << 0)  /* Bit 0: Enable Transmit Frame Preemption */
#define EMAC_MAC_FPE_CTRL_STS_SVER      (1 << 1)  /* Bit 1: Send Verify mPacket */
#define EMAC_MAC_FPE_CTRL_STS_SRSP      (1 << 2)  /* Bit 2: Send Respond mPacket */
#define EMAC_MAC_FPE_CTRL_STS_S1_SET_0  (1 << 3)  /* Bit 3: S1 SET 0 */
#define EMAC_MAC_FPE_CTRL_STS_RVER      (1 << 16) /* Bit 16: Received Verify Frame */
#define EMAC_MAC_FPE_CTRL_STS_RRSP      (1 << 17) /* Bit 17: Received Respond Frame */
#define EMAC_MAC_FPE_CTRL_STS_TVER      (1 << 18) /* Bit 18: Transmitted Verify Frame */
#define EMAC_MAC_FPE_CTRL_STS_TRSP      (1 << 19) /* Bit 19: Transmitted Respond Frame */

/* MAC Presentation Time (MAC_PRESN_TIME_NS) */
#define EMAC_MAC_PRESN_TIME_NS_MPTN_SHIFT  (0) /* Bits 0-32: MAC 1722 Presentation Time (In Nanoseconds) */
#define EMAC_MAC_PRESN_TIME_NS_MPTN_MASK   (0xffffffff << EMAC_MAC_PRESN_TIME_NS_MPTN_SHIFT)
#define EMAC_MAC_PRESN_TIME_NS_MPTN(n)     (((n) << EMAC_MAC_PRESN_TIME_NS_MPTN_SHIFT) & EMAC_MAC_PRESN_TIME_NS_MPTN_MASK)

/* MAC Presentation Time Update (MAC_PRESN_TIME_UPDT) */
#define EMAC_MAC_PRESN_TIME_UPDT_MPTU_SHIFT  (0) /* Bits 0-32: MAC 1722 Presentation Time Update */
#define EMAC_MAC_PRESN_TIME_UPDT_MPTU_MASK   (0xffffffff << EMAC_MAC_PRESN_TIME_UPDT_MPTU_SHIFT)
#define EMAC_MAC_PRESN_TIME_UPDT_MPTU(n)     (((n) << EMAC_MAC_PRESN_TIME_UPDT_MPTU_SHIFT) & EMAC_MAC_PRESN_TIME_UPDT_MPTU_MASK)

