apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_emac.h
/* MAC Address 0 High (MAC_ADDRESS0_HIGH) */
#define EMAC_MAC_ADDRESS0_HIGH_ADDRHI_SHIFT  (0) /* Bits 0-16: MAC Address 0 [47:32] */
#define EMAC_MAC_ADDRESS0_HIGH_ADDRHI_MASK   (0xffff << EMAC_MAC_ADDRESS0_HIGH_ADDRHI_SHIFT)
#define EMAC_MAC_ADDRESS0_HIGH_ADDRHI(n)     (((n) << EMAC_MAC_ADDRESS0_HIGH_ADDRHI_SHIFT) & EMAC_MAC_ADDRESS0_HIGH_ADDRHI_MASK)
#define EMAC_MAC_ADDRESS0_HIGH_DCS_SHIFT     (16) /* Bits 16-18: DMA Channel Select */
#define EMAC_MAC_ADDRESS0_HIGH_DCS_MASK      (0x3 << EMAC_MAC_ADDRESS0_HIGH_DCS_SHIFT)
#define EMAC_MAC_ADDRESS0_HIGH_DCS(n)        (((n) << EMAC_MAC_ADDRESS0_HIGH_DCS_SHIFT) & EMAC_MAC_ADDRESS0_HIGH_DCS_MASK)
#define EMAC_MAC_ADDRESS0_HIGH_AE            (1 << 31) /* Bit 31: Address Enable */

/* MAC Address 0 Low (MAC_ADDRESS0_LOW) */
#define EMAC_MAC_ADDRESS0_LOW_ADDRLO_SHIFT  (0) /* Bits 0-32: MAC Address 0 [31:0] */
#define EMAC_MAC_ADDRESS0_LOW_ADDRLO_MASK   (0xffffffff << EMAC_MAC_ADDRESS0_LOW_ADDRLO_SHIFT)
#define EMAC_MAC_ADDRESS0_LOW_ADDRLO(n)     (((n) << EMAC_MAC_ADDRESS0_LOW_ADDRLO_SHIFT) & EMAC_MAC_ADDRESS0_LOW_ADDRLO_MASK)

/* MAC Address 1 High (MAC_ADDRESS1_HIGH) */
#define EMAC_MAC_ADDRESS1_HIGH_ADDRHI_SHIFT  (0) /* Bits 0-16: MAC Address 1 [47:32] */
#define EMAC_MAC_ADDRESS1_HIGH_ADDRHI_MASK   (0xffff << EMAC_MAC_ADDRESS1_HIGH_ADDRHI_SHIFT)
#define EMAC_MAC_ADDRESS1_HIGH_ADDRHI(n)     (((n) << EMAC_MAC_ADDRESS1_HIGH_ADDRHI_SHIFT) & EMAC_MAC_ADDRESS1_HIGH_ADDRHI_MASK)
#define EMAC_MAC_ADDRESS1_HIGH_DCS_SHIFT     (16) /* Bits 16-18: DMA Channel Select */
#define EMAC_MAC_ADDRESS1_HIGH_DCS_MASK      (0x3 << EMAC_MAC_ADDRESS1_HIGH_DCS_SHIFT)
#define EMAC_MAC_ADDRESS1_HIGH_DCS(n)        (((n) << EMAC_MAC_ADDRESS1_HIGH_DCS_SHIFT) & EMAC_MAC_ADDRESS1_HIGH_DCS_MASK)
#define EMAC_MAC_ADDRESS1_HIGH_MBC_SHIFT     (24) /* Bits 24-30: Mask Byte Control */
#define EMAC_MAC_ADDRESS1_HIGH_MBC_MASK      (0x3f << EMAC_MAC_ADDRESS1_HIGH_MBC_SHIFT)
#define EMAC_MAC_ADDRESS1_HIGH_MBC(n)        (((n) << EMAC_MAC_ADDRESS1_HIGH_MBC_SHIFT) & EMAC_MAC_ADDRESS1_HIGH_MBC_MASK)
#define EMAC_MAC_ADDRESS1_HIGH_SA            (1 << 30) /* Bit 30: Source Address */
#define EMAC_MAC_ADDRESS1_HIGH_AE            (1 << 31) /* Bit 31: Address Enable */

/* MAC Address 1 Low (MAC_ADDRESS1_LOW) */
#define EMAC_MAC_ADDRESS1_LOW_ADDRLO_SHIFT  (0) /* Bits 0-32: MAC Address 1 [31:0] */
#define EMAC_MAC_ADDRESS1_LOW_ADDRLO_MASK   (0xffffffff << EMAC_MAC_ADDRESS1_LOW_ADDRLO_SHIFT)
#define EMAC_MAC_ADDRESS1_LOW_ADDRLO(n)     (((n) << EMAC_MAC_ADDRESS1_LOW_ADDRLO_SHIFT) & EMAC_MAC_ADDRESS1_LOW_ADDRLO_MASK)

/* MAC Address 2 High (MAC_ADDRESS2_HIGH) */
#define EMAC_MAC_ADDRESS2_HIGH_ADDRHI_SHIFT  (0) /* Bits 0-16: MAC Address 1 [47:32] */
#define EMAC_MAC_ADDRESS2_HIGH_ADDRHI_MASK   (0xffff << EMAC_MAC_ADDRESS2_HIGH_ADDRHI_SHIFT)
#define EMAC_MAC_ADDRESS2_HIGH_ADDRHI(n)     (((n) << EMAC_MAC_ADDRESS2_HIGH_ADDRHI_SHIFT) & EMAC_MAC_ADDRESS2_HIGH_ADDRHI_MASK)
#define EMAC_MAC_ADDRESS2_HIGH_DCS_SHIFT     (16) /* Bits 16-18: DMA Channel Select */
#define EMAC_MAC_ADDRESS2_HIGH_DCS_MASK      (0x3 << EMAC_MAC_ADDRESS2_HIGH_DCS_SHIFT)
#define EMAC_MAC_ADDRESS2_HIGH_DCS(n)        (((n) << EMAC_MAC_ADDRESS2_HIGH_DCS_SHIFT) & EMAC_MAC_ADDRESS2_HIGH_DCS_MASK)
#define EMAC_MAC_ADDRESS2_HIGH_MBC_SHIFT     (24) /* Bits 24-30: Mask Byte Control */
#define EMAC_MAC_ADDRESS2_HIGH_MBC_MASK      (0x3f << EMAC_MAC_ADDRESS2_HIGH_MBC_SHIFT)
#define EMAC_MAC_ADDRESS2_HIGH_MBC(n)        (((n) << EMAC_MAC_ADDRESS2_HIGH_MBC_SHIFT) & EMAC_MAC_ADDRESS2_HIGH_MBC_MASK)
#define EMAC_MAC_ADDRESS2_HIGH_SA            (1 << 30) /* Bit 30: Source Address */
#define EMAC_MAC_ADDRESS2_HIGH_AE            (1 << 31) /* Bit 31: Address Enable */

/* MAC Address 2 Low (MAC_ADDRESS2_LOW) */
#define EMAC_MAC_ADDRESS2_LOW_ADDRLO_SHIFT  (0) /* Bits 0-32: MAC Address 1 [31:0] */
#define EMAC_MAC_ADDRESS2_LOW_ADDRLO_MASK   (0xffffffff << EMAC_MAC_ADDRESS2_LOW_ADDRLO_SHIFT)
#define EMAC_MAC_ADDRESS2_LOW_ADDRLO(n)     (((n) << EMAC_MAC_ADDRESS2_LOW_ADDRLO_SHIFT) & EMAC_MAC_ADDRESS2_LOW_ADDRLO_MASK)

/* MMC Control (MMC_CONTROL) */
#define EMAC_MMC_CONTROL_CNTRST      (1 << 0) /* Bit 0: Counters Reset */
#define EMAC_MMC_CONTROL_CNTSTOPRO   (1 << 1) /* Bit 1: Counter Stop Rollover */
#define EMAC_MMC_CONTROL_RSTONRD     (1 << 2) /* Bit 2: Reset On Read */
#define EMAC_MMC_CONTROL_CNTFREEZ    (1 << 3) /* Bit 3: MMC Counter Freeze */
#define EMAC_MMC_CONTROL_CNTPRST     (1 << 4) /* Bit 4: Counters Preset */
#define EMAC_MMC_CONTROL_CNTPRSTLVL  (1 << 5) /* Bit 5: Full-Half Preset */
#define EMAC_MMC_CONTROL_UCDBC       (1 << 8) /* Bit 8: Update MMC Counters For Dropped Broadcast Packets */

/* MMC Receive Interrupt (MMC_RX_INTERRUPT) */
#define EMAC_MMC_RX_INTERRUPT_RXGBPKTIS           (1 << 0)  /* Bit 0: MMC Receive Good Bad Packet Counter Interrupt Status */
#define EMAC_MMC_RX_INTERRUPT_RXGBOCTIS           (1 << 1)  /* Bit 1: MMC Receive Good Bad Octet Counter Interrupt Status */
#define EMAC_MMC_RX_INTERRUPT_RXGOCTIS            (1 << 2)  /* Bit 2: MMC Receive Good Octet Counter Interrupt Status */
#define EMAC_MMC_RX_INTERRUPT_RXBCGPIS            (1 << 3)  /* Bit 3: MMC Receive Broadcast Good Packet Counter Interrupt Status */
#define EMAC_MMC_RX_INTERRUPT_RXMCGPIS            (1 << 4)  /* Bit 4: MMC Receive Multicast Good Packet Counter Interrupt Status */
#define EMAC_MMC_RX_INTERRUPT_RXCRCERPIS          (1 << 5)  /* Bit 5: MMC Receive CRC Error Packet Counter Interrupt Status */
#define EMAC_MMC_RX_INTERRUPT_RXALGNERPIS         (1 << 6)  /* Bit 6: MMC Receive Alignment Error Packet Counter Interrupt Status */
#define EMAC_MMC_RX_INTERRUPT_RXRUNTPIS           (1 << 7)  /* Bit 7: MMC Receive Runt Packet Counter Interrupt Status */
#define EMAC_MMC_RX_INTERRUPT_RXJABERPIS          (1 << 8)  /* Bit 8: MMC Receive Jabber Error Packet Counter Interrupt Status */
#define EMAC_MMC_RX_INTERRUPT_RXUSIZEGPIS         (1 << 9)  /* Bit 9: MMC Receive Undersize Good Packet Counter Interrupt Status */
#define EMAC_MMC_RX_INTERRUPT_RXOSIZEGPIS         (1 << 10) /* Bit 10: MMC Receive Oversize Good Packet Counter Interrupt Status */
#define EMAC_MMC_RX_INTERRUPT_RX64OCTGBPIS        (1 << 11) /* Bit 11: MMC Receive 64 Octet Good Bad Packet Counter Interrupt Status */
#define EMAC_MMC_RX_INTERRUPT_RX65T127OCTGBPIS    (1 << 12) /* Bit 12: MMC Receive 65 To 127 Octet Good Bad Packet Counter Interrupt Status */
#define EMAC_MMC_RX_INTERRUPT_RX128T255OCTGBPIS   (1 << 13) /* Bit 13: MMC Receive 128 To 255 Octet Good Bad Packet Counter Interrupt Status */
#define EMAC_MMC_RX_INTERRUPT_RX256T511OCTGBPIS   (1 << 14) /* Bit 14: MMC Receive 256 To 511 Octet Good Bad Packet Counter Interrupt Status */
#define EMAC_MMC_RX_INTERRUPT_RX512T1023OCTGBPIS  (1 << 15) /* Bit 15: MMC Receive 512 To 1023 Octet Good Bad Packet Counter Interrupt Status */
#define EMAC_MMC_RX_INTERRUPT_RX1024TMAXOCTGBPIS  (1 << 16) /* Bit 16: MMC Receive 1024 To Maximum Octet Good Bad Packet Counter Interrupt Status */
#define EMAC_MMC_RX_INTERRUPT_RXUCGPIS            (1 << 17) /* Bit 17: MMC Receive Unicast Good Packet Counter Interrupt Status */
#define EMAC_MMC_RX_INTERRUPT_RXLENERPIS          (1 << 18) /* Bit 18: MMC Receive Length Error Packet Counter Interrupt Status */
#define EMAC_MMC_RX_INTERRUPT_RXORANGEPIS         (1 << 19) /* Bit 19: MMC Receive Out-Of-Range Error Packet Counter Interrupt Status */
#define EMAC_MMC_RX_INTERRUPT_RXPAUSPIS           (1 << 20) /* Bit 20: MMC Receive Pause Packet Counter Interrupt Status */
#define EMAC_MMC_RX_INTERRUPT_RXFOVPIS            (1 << 21) /* Bit 21: MMC Receive FIFO Overflow Packet Counter Interrupt Status */
#define EMAC_MMC_RX_INTERRUPT_RXVLANGBPIS         (1 << 22) /* Bit 22: MMC Receive VLAN Good Bad Packet Counter Interrupt Status */
#define EMAC_MMC_RX_INTERRUPT_RXWDOGPIS           (1 << 23) /* Bit 23: MMC Receive Watchdog Error Packet Counter Interrupt Status */
#define EMAC_MMC_RX_INTERRUPT_RXRCVERRPIS         (1 << 24) /* Bit 24: MMC Receive Error Packet Counter Interrupt Status */
#define EMAC_MMC_RX_INTERRUPT_RXCTRLPIS           (1 << 25) /* Bit 25: MMC Receive Control Packet Counter Interrupt Status */

/* MMC Transmit Interrupt (MMC_TX_INTERRUPT) */
#define EMAC_MMC_TX_INTERRUPT_TXGBOCTIS           (1 << 0)  /* Bit 0: MMC Transmit Good Bad Octet Counter Interrupt Status */
#define EMAC_MMC_TX_INTERRUPT_TXGBPKTIS           (1 << 1)  /* Bit 1: MMC Transmit Good Bad Packet Counter Interrupt Status */
#define EMAC_MMC_TX_INTERRUPT_TXBCGPIS            (1 << 2)  /* Bit 2: MMC Transmit Broadcast Good Packet Counter Interrupt Status */
#define EMAC_MMC_TX_INTERRUPT_TXMCGPIS            (1 << 3)  /* Bit 3: MMC Transmit Multicast Good Packet Counter Interrupt Status */
#define EMAC_MMC_TX_INTERRUPT_TX64OCTGBPIS        (1 << 4)  /* Bit 4: MMC Transmit 64-Octet Good Bad Packet Counter Interrupt Status */
#define EMAC_MMC_TX_INTERRUPT_TX65T127OCTGBPIS    (1 << 5)  /* Bit 5: MMC Transmit 65 To 127 Octet Good Bad Packet Counter Interrupt Status */
#define EMAC_MMC_TX_INTERRUPT_TX128T255OCTGBPIS   (1 << 6)  /* Bit 6: MMC Transmit 128 To 255 Octet Good Bad Packet Counter Interrupt Status */
#define EMAC_MMC_TX_INTERRUPT_TX256T511OCTGBPIS   (1 << 7)  /* Bit 7: MMC Transmit 256 To 511 Octet Good Bad Packet Counter Interrupt Status */
#define EMAC_MMC_TX_INTERRUPT_TX512T1023OCTGBPIS  (1 << 8)  /* Bit 8: MMC Transmit 512 To 1023 Octet Good Bad Packet Counter Interrupt Status */
#define EMAC_MMC_TX_INTERRUPT_TX1024TMAXOCTGBPIS  (1 << 9)  /* Bit 9: MMC Transmit 1024 To Maximum Octet Good Bad Packet Counter Interrupt Status */
#define EMAC_MMC_TX_INTERRUPT_TXUCGBPIS           (1 << 10) /* Bit 10: MMC Transmit Unicast Good Bad Packet Counter Interrupt Status */
#define EMAC_MMC_TX_INTERRUPT_TXMCGBPIS           (1 << 11) /* Bit 11: MMC Transmit Multicast Good Bad Packet Counter Interrupt Status */
#define EMAC_MMC_TX_INTERRUPT_TXBCGBPIS           (1 << 12) /* Bit 12: MMC Transmit Broadcast Good Bad Packet Counter Interrupt Status */
#define EMAC_MMC_TX_INTERRUPT_TXUFLOWERPIS        (1 << 13) /* Bit 13: MMC Transmit Underflow Error Packet Counter Interrupt Status */
#define EMAC_MMC_TX_INTERRUPT_TXSCOLGPIS          (1 << 14) /* Bit 14: MMC Transmit Single Collision Good Packet Counter Interrupt Status */
#define EMAC_MMC_TX_INTERRUPT_TXMCOLGPIS          (1 << 15) /* Bit 15: MMC Transmit Multiple Collision Good Packet Counter Interrupt Status */
#define EMAC_MMC_TX_INTERRUPT_TXDEFPIS            (1 << 16) /* Bit 16: MMC Transmit Deferred Packet Counter Interrupt Status */
#define EMAC_MMC_TX_INTERRUPT_TXLATCOLPIS         (1 << 17) /* Bit 17: MMC Transmit Late Collision Packet Counter Interrupt Status */
#define EMAC_MMC_TX_INTERRUPT_TXEXCOLPIS          (1 << 18) /* Bit 18: MMC Transmit Excessive Collision Packet Counter Interrupt Status */
#define EMAC_MMC_TX_INTERRUPT_TXCARERPIS          (1 << 19) /* Bit 19: MMC Transmit Carrier Error Packet Counter Interrupt Status */
#define EMAC_MMC_TX_INTERRUPT_TXGOCTIS            (1 << 20) /* Bit 20: MMC Transmit Good Octet Counter Interrupt Status */
#define EMAC_MMC_TX_INTERRUPT_TXGPKTIS            (1 << 21) /* Bit 21: MMC Transmit Good Packet Counter Interrupt Status */
#define EMAC_MMC_TX_INTERRUPT_TXEXDEFPIS          (1 << 22) /* Bit 22: MMC Transmit Excessive Deferral Packet Counter Interrupt Status */
#define EMAC_MMC_TX_INTERRUPT_TXPAUSPIS           (1 << 23) /* Bit 23: MMC Transmit Pause Packet Counter Interrupt Status */
#define EMAC_MMC_TX_INTERRUPT_TXVLANGPIS          (1 << 24) /* Bit 24: MMC Transmit VLAN Good Packet Counter Interrupt Status */
#define EMAC_MMC_TX_INTERRUPT_TXOSIZEGPIS         (1 << 25) /* Bit 25: MMC Transmit Oversize Good Packet Counter Interrupt Status */

/* MMC Receive Interrupt Mask (MMC_RX_INTERRUPT_MASK) */
#define EMAC_MMC_RX_INTERRUPT_MASK_RXGBPKTIM           (1 << 0)  /* Bit 0: MMC Receive Good Bad Packet Counter Interrupt Mask */
#define EMAC_MMC_RX_INTERRUPT_MASK_RXGBOCTIM           (1 << 1)  /* Bit 1: MMC Receive Good Bad Octet Counter Interrupt Mask */
#define EMAC_MMC_RX_INTERRUPT_MASK_RXGOCTIM            (1 << 2)  /* Bit 2: MMC Receive Good Octet Counter Interrupt Mask */
#define EMAC_MMC_RX_INTERRUPT_MASK_RXBCGPIM            (1 << 3)  /* Bit 3: MMC Receive Broadcast Good Packet Counter Interrupt Mask */
#define EMAC_MMC_RX_INTERRUPT_MASK_RXMCGPIM            (1 << 4)  /* Bit 4: MMC Receive Multicast Good Packet Counter Interrupt Mask */
#define EMAC_MMC_RX_INTERRUPT_MASK_RXCRCERPIM          (1 << 5)  /* Bit 5: MMC Receive CRC Error Packet Counter Interrupt Mask */
#define EMAC_MMC_RX_INTERRUPT_MASK_RXALGNERPIM         (1 << 6)  /* Bit 6: MMC Receive Alignment Error Packet Counter Interrupt Mask */
#define EMAC_MMC_RX_INTERRUPT_MASK_RXRUNTPIM           (1 << 7)  /* Bit 7: MMC Receive Runt Packet Counter Interrupt Mask */
#define EMAC_MMC_RX_INTERRUPT_MASK_RXJABERPIM          (1 << 8)  /* Bit 8: MMC Receive Jabber Error Packet Counter Interrupt Mask */
#define EMAC_MMC_RX_INTERRUPT_MASK_RXUSIZEGPIM         (1 << 9)  /* Bit 9: MMC Receive Undersize Good Packet Counter Interrupt Mask */
#define EMAC_MMC_RX_INTERRUPT_MASK_RXOSIZEGPIM         (1 << 10) /* Bit 10: MMC Receive Oversize Good Packet Counter Interrupt Mask */
#define EMAC_MMC_RX_INTERRUPT_MASK_RX64OCTGBPIM        (1 << 11) /* Bit 11: MMC Receive 64-Octet Good Bad Packet Counter Interrupt Mask */
#define EMAC_MMC_RX_INTERRUPT_MASK_RX65T127OCTGBPIM    (1 << 12) /* Bit 12: MMC Receive 65 To 127 Octet Good Bad Packet Counter Interrupt Mask */
#define EMAC_MMC_RX_INTERRUPT_MASK_RX128T255OCTGBPIM   (1 << 13) /* Bit 13: MMC Receive 128 To 255 Octet Good Bad Packet Counter Interrupt Mask */
#define EMAC_MMC_RX_INTERRUPT_MASK_RX256T511OCTGBPIM   (1 << 14) /* Bit 14: MMC Receive 256 To 511 Octet Good Bad Packet Counter Interrupt Mask */
#define EMAC_MMC_RX_INTERRUPT_MASK_RX512T1023OCTGBPIM  (1 << 15) /* Bit 15: MMC Receive 512 To 1023 Octet Good Bad Packet Counter Interrupt Mask */
#define EMAC_MMC_RX_INTERRUPT_MASK_RX1024TMAXOCTGBPIM  (1 << 16) /* Bit 16: MMC Receive 1024 To Maximum Octet Good Bad Packet Counter Interrupt Mask */
#define EMAC_MMC_RX_INTERRUPT_MASK_RXUCGPIM            (1 << 17) /* Bit 17: MMC Receive Unicast Good Packet Counter Interrupt Mask */
#define EMAC_MMC_RX_INTERRUPT_MASK_RXLENERPIM          (1 << 18) /* Bit 18: MMC Receive Length Error Packet Counter Interrupt Mask */
#define EMAC_MMC_RX_INTERRUPT_MASK_RXORANGEPIM         (1 << 19) /* Bit 19: MMC Receive Out-Of-Range Error Packet Counter Interrupt Mask */
#define EMAC_MMC_RX_INTERRUPT_MASK_RXPAUSPIM           (1 << 20) /* Bit 20: MMC Receive Pause Packet Counter Interrupt Mask */
#define EMAC_MMC_RX_INTERRUPT_MASK_RXFOVPIM            (1 << 21) /* Bit 21: MMC Receive FIFO Overflow Packet Counter Interrupt Mask */
#define EMAC_MMC_RX_INTERRUPT_MASK_RXVLANGBPIM         (1 << 22) /* Bit 22: MMC Receive VLAN Good Bad Packet Counter Interrupt Mask */
#define EMAC_MMC_RX_INTERRUPT_MASK_RXWDOGPIM           (1 << 23) /* Bit 23: MMC Receive Watchdog Error Packet Counter Interrupt Mask */
#define EMAC_MMC_RX_INTERRUPT_MASK_RXRCVERRPIM         (1 << 24) /* Bit 24: MMC Receive Error Packet Counter Interrupt Mask */
#define EMAC_MMC_RX_INTERRUPT_MASK_RXCTRLPIM           (1 << 25) /* Bit 25: MMC Receive Control Packet Counter Interrupt Mask */

