apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_emac.h
/* MMC Transmit Interrupt Mask (MMC_TX_INTERRUPT_MASK) */
#define EMAC_MMC_TX_INTERRUPT_MASK_TXGBOCTIM           (1 << 0)  /* Bit 0: MMC Transmit Good Bad Octet Counter Interrupt Mask */
#define EMAC_MMC_TX_INTERRUPT_MASK_TXGBPKTIM           (1 << 1)  /* Bit 1: MMC Transmit Good Bad Packet Counter Interrupt Mask */
#define EMAC_MMC_TX_INTERRUPT_MASK_TXBCGPIM            (1 << 2)  /* Bit 2: MMC Transmit Broadcast Good Packet Counter Interrupt Mask */
#define EMAC_MMC_TX_INTERRUPT_MASK_TXMCGPIM            (1 << 3)  /* Bit 3: MMC Transmit Multicast Good Packet Counter Interrupt Mask */
#define EMAC_MMC_TX_INTERRUPT_MASK_TX64OCTGBPIM        (1 << 4)  /* Bit 4: MMC Transmit 64-Octet Good Bad Packet Counter Interrupt Mask */
#define EMAC_MMC_TX_INTERRUPT_MASK_TX65T127OCTGBPIM    (1 << 5)  /* Bit 5: MMC Transmit 65 To 127 Octet Good Bad Packet Counter Interrupt Mask */
#define EMAC_MMC_TX_INTERRUPT_MASK_TX128T255OCTGBPIM   (1 << 6)  /* Bit 6: MMC Transmit 128 To 255 Octet Good Bad Packet Counter Interrupt Mask */
#define EMAC_MMC_TX_INTERRUPT_MASK_TX256T511OCTGBPIM   (1 << 7)  /* Bit 7: MMC Transmit 256 To 511 Octet Good Bad Packet Counter Interrupt Mask */
#define EMAC_MMC_TX_INTERRUPT_MASK_TX512T1023OCTGBPIM  (1 << 8)  /* Bit 8: MMC Transmit 512 To 1023 Octet Good Bad Packet Counter Interrupt Mask */
#define EMAC_MMC_TX_INTERRUPT_MASK_TX1024TMAXOCTGBPIM  (1 << 9)  /* Bit 9: MMC Transmit 1024 To Maximum Octet Good Bad Packet Counter Interrupt Mask */
#define EMAC_MMC_TX_INTERRUPT_MASK_TXUCGBPIM           (1 << 10) /* Bit 10: MMC Transmit Unicast Good Bad Packet Counter Interrupt Mask */
#define EMAC_MMC_TX_INTERRUPT_MASK_TXMCGBPIM           (1 << 11) /* Bit 11: MMC Transmit Multicast Good Bad Packet Counter Interrupt Mask */
#define EMAC_MMC_TX_INTERRUPT_MASK_TXBCGBPIM           (1 << 12) /* Bit 12: MMC Transmit Broadcast Good Bad Packet Counter Interrupt Mask */
#define EMAC_MMC_TX_INTERRUPT_MASK_TXUFLOWERPIM        (1 << 13) /* Bit 13: MMC Transmit Underflow Error Packet Counter Interrupt Mask */
#define EMAC_MMC_TX_INTERRUPT_MASK_TXSCOLGPIM          (1 << 14) /* Bit 14: MMC Transmit Single Collision Good Packet Counter Interrupt Mask */
#define EMAC_MMC_TX_INTERRUPT_MASK_TXMCOLGPIM          (1 << 15) /* Bit 15: MMC Transmit Multiple Collision Good Packet Counter Interrupt Mask */
#define EMAC_MMC_TX_INTERRUPT_MASK_TXDEFPIM            (1 << 16) /* Bit 16: MMC Transmit Deferred Packet Counter Interrupt Mask */
#define EMAC_MMC_TX_INTERRUPT_MASK_TXLATCOLPIM         (1 << 17) /* Bit 17: MMC Transmit Late Collision Packet Counter Interrupt Mask */
#define EMAC_MMC_TX_INTERRUPT_MASK_TXEXCOLPIM          (1 << 18) /* Bit 18: MMC Transmit Excessive Collision Packet Counter Interrupt Mask */
#define EMAC_MMC_TX_INTERRUPT_MASK_TXCARERPIM          (1 << 19) /* Bit 19: MMC Transmit Carrier Error Packet Counter Interrupt Mask */
#define EMAC_MMC_TX_INTERRUPT_MASK_TXGOCTIM            (1 << 20) /* Bit 20: MMC Transmit Good Octet Counter Interrupt Mask */
#define EMAC_MMC_TX_INTERRUPT_MASK_TXGPKTIM            (1 << 21) /* Bit 21: MMC Transmit Good Packet Counter Interrupt Mask */
#define EMAC_MMC_TX_INTERRUPT_MASK_TXEXDEFPIM          (1 << 22) /* Bit 22: MMC Transmit Excessive Deferral Packet Counter Interrupt Mask */
#define EMAC_MMC_TX_INTERRUPT_MASK_TXPAUSPIM           (1 << 23) /* Bit 23: MMC Transmit Pause Packet Counter Interrupt Mask */
#define EMAC_MMC_TX_INTERRUPT_MASK_TXVLANGPIM          (1 << 24) /* Bit 24: MMC Transmit VLAN Good Packet Counter Interrupt Mask */
#define EMAC_MMC_TX_INTERRUPT_MASK_TXOSIZEGPIM         (1 << 25) /* Bit 25: MMC Transmit Oversize Good Packet Counter Interrupt Mask */

/* Transmit Octet Count Good Bad (TX_OCTET_COUNT_GOOD_BAD) */
#define EMAC_TX_OCTET_COUNT_GOOD_BAD_TXOCTGB_SHIFT  (0) /* Bits 0-32: Transmit Octet Count Good Bad */
#define EMAC_TX_OCTET_COUNT_GOOD_BAD_TXOCTGB_MASK   (0xffffffff << EMAC_TX_OCTET_COUNT_GOOD_BAD_TXOCTGB_SHIFT)
#define EMAC_TX_OCTET_COUNT_GOOD_BAD_TXOCTGB(n)     (((n) << EMAC_TX_OCTET_COUNT_GOOD_BAD_TXOCTGB_SHIFT) & EMAC_TX_OCTET_COUNT_GOOD_BAD_TXOCTGB_MASK)

/* Transmit Packet Count Good Bad (TX_PACKET_COUNT_GOOD_BAD) */
#define EMAC_TX_PACKET_COUNT_GOOD_BAD_TXPKTGB_SHIFT  (0) /* Bits 0-32: Transmit Packet Count Good Bad */
#define EMAC_TX_PACKET_COUNT_GOOD_BAD_TXPKTGB_MASK   (0xffffffff << EMAC_TX_PACKET_COUNT_GOOD_BAD_TXPKTGB_SHIFT)
#define EMAC_TX_PACKET_COUNT_GOOD_BAD_TXPKTGB(n)     (((n) << EMAC_TX_PACKET_COUNT_GOOD_BAD_TXPKTGB_SHIFT) & EMAC_TX_PACKET_COUNT_GOOD_BAD_TXPKTGB_MASK)

/* Transmit Broadcast Packets Good (TX_BROADCAST_PACKETS_GOOD) */
#define EMAC_TX_BROADCAST_PACKETS_GOOD_TXBCASTG_SHIFT  (0) /* Bits 0-32: Transmit Broadcast Packets Good */
#define EMAC_TX_BROADCAST_PACKETS_GOOD_TXBCASTG_MASK   (0xffffffff << EMAC_TX_BROADCAST_PACKETS_GOOD_TXBCASTG_SHIFT)
#define EMAC_TX_BROADCAST_PACKETS_GOOD_TXBCASTG(n)     (((n) << EMAC_TX_BROADCAST_PACKETS_GOOD_TXBCASTG_SHIFT) & EMAC_TX_BROADCAST_PACKETS_GOOD_TXBCASTG_MASK)

/* Transmit Multicast Packets Good (TX_MULTICAST_PACKETS_GOOD) */
#define EMAC_TX_MULTICAST_PACKETS_GOOD_TXMCASTG_SHIFT  (0) /* Bits 0-32: Transmit Multicast Packets Good */
#define EMAC_TX_MULTICAST_PACKETS_GOOD_TXMCASTG_MASK   (0xffffffff << EMAC_TX_MULTICAST_PACKETS_GOOD_TXMCASTG_SHIFT)
#define EMAC_TX_MULTICAST_PACKETS_GOOD_TXMCASTG(n)     (((n) << EMAC_TX_MULTICAST_PACKETS_GOOD_TXMCASTG_SHIFT) & EMAC_TX_MULTICAST_PACKETS_GOOD_TXMCASTG_MASK)

/* Transmit 64-Octet Packets Good Bad (TX_64OCTETS_PACKETS_GOOD_BAD) */
#define EMAC_TX_64OCTETS_PACKETS_GOOD_BAD_TX64OCTGB_SHIFT  (0) /* Bits 0-32: Transmit 64-Octet Packets Good Bad */
#define EMAC_TX_64OCTETS_PACKETS_GOOD_BAD_TX64OCTGB_MASK   (0xffffffff << EMAC_TX_64OCTETS_PACKETS_GOOD_BAD_TX64OCTGB_SHIFT)
#define EMAC_TX_64OCTETS_PACKETS_GOOD_BAD_TX64OCTGB(n)     (((n) << EMAC_TX_64OCTETS_PACKETS_GOOD_BAD_TX64OCTGB_SHIFT) & EMAC_TX_64OCTETS_PACKETS_GOOD_BAD_TX64OCTGB_MASK)

/* Transmit 65 To 127 Octet Packets Good Bad
 * (TX_65TO127OCTETS_PACKETS_GOOD_BAD)
 */

#define EMAC_TX_65TO127OCTETS_PACKETS_GOOD_BAD_TX65_127OCTGB_SHIFT  (0) /* Bits 0-32: Transmit 65 To 127 Octet Packets Good Bad */
#define EMAC_TX_65TO127OCTETS_PACKETS_GOOD_BAD_TX65_127OCTGB_MASK   (0xffffffff << EMAC_TX_65TO127OCTETS_PACKETS_GOOD_BAD_TX65_127OCTGB_SHIFT)
#define EMAC_TX_65TO127OCTETS_PACKETS_GOOD_BAD_TX65_127OCTGB(n)     (((n) << EMAC_TX_65TO127OCTETS_PACKETS_GOOD_BAD_TX65_127OCTGB_SHIFT) & EMAC_TX_65TO127OCTETS_PACKETS_GOOD_BAD_TX65_127OCTGB_MASK)

/* Transmit 128 To 255 Octet Packets Good Bad
 * (TX_128TO255OCTETS_PACKETS_GOOD_BAD)
 */

#define EMAC_TX_128TO255OCTETS_PACKETS_GOOD_BAD_TX128_255OCTGB_SHIFT  (0) /* Bits 0-32: Transmit 128 To 255 Octet Packets Good Bad */
#define EMAC_TX_128TO255OCTETS_PACKETS_GOOD_BAD_TX128_255OCTGB_MASK   (0xffffffff << EMAC_TX_128TO255OCTETS_PACKETS_GOOD_BAD_TX128_255OCTGB_SHIFT)
#define EMAC_TX_128TO255OCTETS_PACKETS_GOOD_BAD_TX128_255OCTGB(n)     (((n) << EMAC_TX_128TO255OCTETS_PACKETS_GOOD_BAD_TX128_255OCTGB_SHIFT) & EMAC_TX_128TO255OCTETS_PACKETS_GOOD_BAD_TX128_255OCTGB_MASK)

/* Transmit 256 To 511 Octet Packets Good Bad
 * (TX_256TO511OCTETS_PACKETS_GOOD_BAD)
 */

