apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_emac.h
#define EMAC_TX_256TO511OCTETS_PACKETS_GOOD_BAD_TX256_511OCTGB_SHIFT  (0) /* Bits 0-32: Transmit 256 To 511 Octet Packets Good Bad */
#define EMAC_TX_256TO511OCTETS_PACKETS_GOOD_BAD_TX256_511OCTGB_MASK   (0xffffffff << EMAC_TX_256TO511OCTETS_PACKETS_GOOD_BAD_TX256_511OCTGB_SHIFT)
#define EMAC_TX_256TO511OCTETS_PACKETS_GOOD_BAD_TX256_511OCTGB(n)     (((n) << EMAC_TX_256TO511OCTETS_PACKETS_GOOD_BAD_TX256_511OCTGB_SHIFT) & EMAC_TX_256TO511OCTETS_PACKETS_GOOD_BAD_TX256_511OCTGB_MASK)

/* Transmit 512 To 1023 Octet Packets Good Bad
 * (TX_512TO1023OCTETS_PACKETS_GOOD_BAD)
 */

#define EMAC_TX_512TO1023OCTETS_PACKETS_GOOD_BAD_TX512_1023OCTGB_SHIFT  (0) /* Bits 0-32: Transmit 512 To 1023 Octet Packets Good Bad */
#define EMAC_TX_512TO1023OCTETS_PACKETS_GOOD_BAD_TX512_1023OCTGB_MASK   (0xffffffff << EMAC_TX_512TO1023OCTETS_PACKETS_GOOD_BAD_TX512_1023OCTGB_SHIFT)
#define EMAC_TX_512TO1023OCTETS_PACKETS_GOOD_BAD_TX512_1023OCTGB(n)     (((n) << EMAC_TX_512TO1023OCTETS_PACKETS_GOOD_BAD_TX512_1023OCTGB_SHIFT) & EMAC_TX_512TO1023OCTETS_PACKETS_GOOD_BAD_TX512_1023OCTGB_MASK)

/* Transmit 1024 To Max Octet Packets Good Bad
 * (TX_1024TOMAXOCTETS_PACKETS_GOOD_BAD)
 */

#define EMAC_TX_1024TOMAXOCTETS_PACKETS_GOOD_BAD_TX1024_MAXOCTGB_SHIFT  (0) /* Bits 0-32: Transmit 1024 To Max Octet Packets Good Bad */
#define EMAC_TX_1024TOMAXOCTETS_PACKETS_GOOD_BAD_TX1024_MAXOCTGB_MASK   (0xffffffff << EMAC_TX_1024TOMAXOCTETS_PACKETS_GOOD_BAD_TX1024_MAXOCTGB_SHIFT)
#define EMAC_TX_1024TOMAXOCTETS_PACKETS_GOOD_BAD_TX1024_MAXOCTGB(n)     (((n) << EMAC_TX_1024TOMAXOCTETS_PACKETS_GOOD_BAD_TX1024_MAXOCTGB_SHIFT) & EMAC_TX_1024TOMAXOCTETS_PACKETS_GOOD_BAD_TX1024_MAXOCTGB_MASK)

/* Transmit Unicast Packets Good Bad
 * (TX_UNICAST_PACKETS_GOOD_BAD)
 */

#define EMAC_TX_UNICAST_PACKETS_GOOD_BAD_TXUCASTGB_SHIFT  (0) /* Bits 0-32: Transmit Unicast Packets Good Bad */
#define EMAC_TX_UNICAST_PACKETS_GOOD_BAD_TXUCASTGB_MASK   (0xffffffff << EMAC_TX_UNICAST_PACKETS_GOOD_BAD_TXUCASTGB_SHIFT)
#define EMAC_TX_UNICAST_PACKETS_GOOD_BAD_TXUCASTGB(n)     (((n) << EMAC_TX_UNICAST_PACKETS_GOOD_BAD_TXUCASTGB_SHIFT) & EMAC_TX_UNICAST_PACKETS_GOOD_BAD_TXUCASTGB_MASK)

/* Transmit Multicast Packets Good Bad (TX_MULTICAST_PACKETS_GOOD_BAD) */
#define EMAC_TX_MULTICAST_PACKETS_GOOD_BAD_TXMCASTGB_SHIFT  (0) /* Bits 0-32: Transmit Multicast Packets Good Bad */
#define EMAC_TX_MULTICAST_PACKETS_GOOD_BAD_TXMCASTGB_MASK   (0xffffffff << EMAC_TX_MULTICAST_PACKETS_GOOD_BAD_TXMCASTGB_SHIFT)
#define EMAC_TX_MULTICAST_PACKETS_GOOD_BAD_TXMCASTGB(n)     (((n) << EMAC_TX_MULTICAST_PACKETS_GOOD_BAD_TXMCASTGB_SHIFT) & EMAC_TX_MULTICAST_PACKETS_GOOD_BAD_TXMCASTGB_MASK)

/* Transmit Broadcast Packets Good Bad (TX_BROADCAST_PACKETS_GOOD_BAD) */
#define EMAC_TX_BROADCAST_PACKETS_GOOD_BAD_TXBCASTGB_SHIFT  (0) /* Bits 0-32: Transmit Broadcast Packets Good Bad */
#define EMAC_TX_BROADCAST_PACKETS_GOOD_BAD_TXBCASTGB_MASK   (0xffffffff << EMAC_TX_BROADCAST_PACKETS_GOOD_BAD_TXBCASTGB_SHIFT)
#define EMAC_TX_BROADCAST_PACKETS_GOOD_BAD_TXBCASTGB(n)     (((n) << EMAC_TX_BROADCAST_PACKETS_GOOD_BAD_TXBCASTGB_SHIFT) & EMAC_TX_BROADCAST_PACKETS_GOOD_BAD_TXBCASTGB_MASK)

/* Transmit Underflow Error Packets (TX_UNDERFLOW_ERROR_PACKETS) */
#define EMAC_TX_UNDERFLOW_ERROR_PACKETS_TXUNDRFLW_SHIFT  (0) /* Bits 0-32: Transmit Underflow Error Packets */
#define EMAC_TX_UNDERFLOW_ERROR_PACKETS_TXUNDRFLW_MASK   (0xffffffff << EMAC_TX_UNDERFLOW_ERROR_PACKETS_TXUNDRFLW_SHIFT)
#define EMAC_TX_UNDERFLOW_ERROR_PACKETS_TXUNDRFLW(n)     (((n) << EMAC_TX_UNDERFLOW_ERROR_PACKETS_TXUNDRFLW_SHIFT) & EMAC_TX_UNDERFLOW_ERROR_PACKETS_TXUNDRFLW_MASK)

/* Transmit Single Collision Good Packets
 * (TX_SINGLE_COLLISION_GOOD_PACKETS)
 */

#define EMAC_TX_SINGLE_COLLISION_GOOD_PACKETS_TXSNGLCOLG_SHIFT  (0) /* Bits 0-32: Transmit Single Collision Good Packets */
#define EMAC_TX_SINGLE_COLLISION_GOOD_PACKETS_TXSNGLCOLG_MASK   (0xffffffff << EMAC_TX_SINGLE_COLLISION_GOOD_PACKETS_TXSNGLCOLG_SHIFT)
#define EMAC_TX_SINGLE_COLLISION_GOOD_PACKETS_TXSNGLCOLG(n)     (((n) << EMAC_TX_SINGLE_COLLISION_GOOD_PACKETS_TXSNGLCOLG_SHIFT) & EMAC_TX_SINGLE_COLLISION_GOOD_PACKETS_TXSNGLCOLG_MASK)

/* Transmit Multiple Collision Good Packets
 * (TX_MULTIPLE_COLLISION_GOOD_PACKETS)
 */

#define EMAC_TX_MULTIPLE_COLLISION_GOOD_PACKETS_TXMULTCOLG_SHIFT  (0) /* Bits 0-32: Transmit Multiple Collision Good Packets */
#define EMAC_TX_MULTIPLE_COLLISION_GOOD_PACKETS_TXMULTCOLG_MASK   (0xffffffff << EMAC_TX_MULTIPLE_COLLISION_GOOD_PACKETS_TXMULTCOLG_SHIFT)
#define EMAC_TX_MULTIPLE_COLLISION_GOOD_PACKETS_TXMULTCOLG(n)     (((n) << EMAC_TX_MULTIPLE_COLLISION_GOOD_PACKETS_TXMULTCOLG_SHIFT) & EMAC_TX_MULTIPLE_COLLISION_GOOD_PACKETS_TXMULTCOLG_MASK)

/* Transmit Deferred Packets (TX_DEFERRED_PACKETS) */
#define EMAC_TX_DEFERRED_PACKETS_TXDEFRD_SHIFT  (0) /* Bits 0-32: Transmit Deferred Packets */
#define EMAC_TX_DEFERRED_PACKETS_TXDEFRD_MASK   (0xffffffff << EMAC_TX_DEFERRED_PACKETS_TXDEFRD_SHIFT)
#define EMAC_TX_DEFERRED_PACKETS_TXDEFRD(n)     (((n) << EMAC_TX_DEFERRED_PACKETS_TXDEFRD_SHIFT) & EMAC_TX_DEFERRED_PACKETS_TXDEFRD_MASK)

/* Transmit Late Collision Packets (TX_LATE_COLLISION_PACKETS) */
#define EMAC_TX_LATE_COLLISION_PACKETS_TXLATECOL_SHIFT  (0) /* Bits 0-32: Transmit Late Collision Packets */
#define EMAC_TX_LATE_COLLISION_PACKETS_TXLATECOL_MASK   (0xffffffff << EMAC_TX_LATE_COLLISION_PACKETS_TXLATECOL_SHIFT)
#define EMAC_TX_LATE_COLLISION_PACKETS_TXLATECOL(n)     (((n) << EMAC_TX_LATE_COLLISION_PACKETS_TXLATECOL_SHIFT) & EMAC_TX_LATE_COLLISION_PACKETS_TXLATECOL_MASK)

/* Transmit Excessive Collision Packets (TX_EXCESSIVE_COLLISION_PACKETS) */
#define EMAC_TX_EXCESSIVE_COLLISION_PACKETS_TXEXSCOL_SHIFT  (0) /* Bits 0-32: Transmit Excessive Collision Packets */
#define EMAC_TX_EXCESSIVE_COLLISION_PACKETS_TXEXSCOL_MASK   (0xffffffff << EMAC_TX_EXCESSIVE_COLLISION_PACKETS_TXEXSCOL_SHIFT)
#define EMAC_TX_EXCESSIVE_COLLISION_PACKETS_TXEXSCOL(n)     (((n) << EMAC_TX_EXCESSIVE_COLLISION_PACKETS_TXEXSCOL_SHIFT) & EMAC_TX_EXCESSIVE_COLLISION_PACKETS_TXEXSCOL_MASK)

/* Transmit Carrier Error Packets (TX_CARRIER_ERROR_PACKETS) */
#define EMAC_TX_CARRIER_ERROR_PACKETS_TXCARR_SHIFT  (0) /* Bits 0-32: Transmit Carrier Error Packets */
#define EMAC_TX_CARRIER_ERROR_PACKETS_TXCARR_MASK   (0xffffffff << EMAC_TX_CARRIER_ERROR_PACKETS_TXCARR_SHIFT)
#define EMAC_TX_CARRIER_ERROR_PACKETS_TXCARR(n)     (((n) << EMAC_TX_CARRIER_ERROR_PACKETS_TXCARR_SHIFT) & EMAC_TX_CARRIER_ERROR_PACKETS_TXCARR_MASK)

/* Transmit Octet Count Good (TX_OCTET_COUNT_GOOD) */
#define EMAC_TX_OCTET_COUNT_GOOD_TXOCTG_SHIFT  (0) /* Bits 0-32: Transmit Octet Count Good */
#define EMAC_TX_OCTET_COUNT_GOOD_TXOCTG_MASK   (0xffffffff << EMAC_TX_OCTET_COUNT_GOOD_TXOCTG_SHIFT)
#define EMAC_TX_OCTET_COUNT_GOOD_TXOCTG(n)     (((n) << EMAC_TX_OCTET_COUNT_GOOD_TXOCTG_SHIFT) & EMAC_TX_OCTET_COUNT_GOOD_TXOCTG_MASK)

/* Transmit Packet Count Good (TX_PACKET_COUNT_GOOD) */
#define EMAC_TX_PACKET_COUNT_GOOD_TXPKTG_SHIFT  (0) /* Bits 0-32: Transmit Packet Count Good */
#define EMAC_TX_PACKET_COUNT_GOOD_TXPKTG_MASK   (0xffffffff << EMAC_TX_PACKET_COUNT_GOOD_TXPKTG_SHIFT)
#define EMAC_TX_PACKET_COUNT_GOOD_TXPKTG(n)     (((n) << EMAC_TX_PACKET_COUNT_GOOD_TXPKTG_SHIFT) & EMAC_TX_PACKET_COUNT_GOOD_TXPKTG_MASK)

/* Transmit Excessive Deferral Error (TX_EXCESSIVE_DEFERRAL_ERROR) */
#define EMAC_TX_EXCESSIVE_DEFERRAL_ERROR_TXEXSDEF_SHIFT  (0) /* Bits 0-32: Transmit Excessive Deferral Error */
#define EMAC_TX_EXCESSIVE_DEFERRAL_ERROR_TXEXSDEF_MASK   (0xffffffff << EMAC_TX_EXCESSIVE_DEFERRAL_ERROR_TXEXSDEF_SHIFT)
#define EMAC_TX_EXCESSIVE_DEFERRAL_ERROR_TXEXSDEF(n)     (((n) << EMAC_TX_EXCESSIVE_DEFERRAL_ERROR_TXEXSDEF_SHIFT) & EMAC_TX_EXCESSIVE_DEFERRAL_ERROR_TXEXSDEF_MASK)

