apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_emac.h
/* Transmit Pause Packets (TX_PAUSE_PACKETS) */
#define EMAC_TX_PAUSE_PACKETS_TXPAUSE_SHIFT  (0) /* Bits 0-32: Transmit Pause Packets */
#define EMAC_TX_PAUSE_PACKETS_TXPAUSE_MASK   (0xffffffff << EMAC_TX_PAUSE_PACKETS_TXPAUSE_SHIFT)
#define EMAC_TX_PAUSE_PACKETS_TXPAUSE(n)     (((n) << EMAC_TX_PAUSE_PACKETS_TXPAUSE_SHIFT) & EMAC_TX_PAUSE_PACKETS_TXPAUSE_MASK)

/* Transmit VLAN Packets Good (TX_VLAN_PACKETS_GOOD) */
#define EMAC_TX_VLAN_PACKETS_GOOD_TXVLANG_SHIFT  (0) /* Bits 0-32: Transmit VLAN Packets Good */
#define EMAC_TX_VLAN_PACKETS_GOOD_TXVLANG_MASK   (0xffffffff << EMAC_TX_VLAN_PACKETS_GOOD_TXVLANG_SHIFT)
#define EMAC_TX_VLAN_PACKETS_GOOD_TXVLANG(n)     (((n) << EMAC_TX_VLAN_PACKETS_GOOD_TXVLANG_SHIFT) & EMAC_TX_VLAN_PACKETS_GOOD_TXVLANG_MASK)

/* Transmit O Size Packets Good (TX_OSIZE_PACKETS_GOOD) */
#define EMAC_TX_OSIZE_PACKETS_GOOD_TXOSIZG_SHIFT  (0) /* Bits 0-32: Transmit O Size Packets Good */
#define EMAC_TX_OSIZE_PACKETS_GOOD_TXOSIZG_MASK   (0xffffffff << EMAC_TX_OSIZE_PACKETS_GOOD_TXOSIZG_SHIFT)
#define EMAC_TX_OSIZE_PACKETS_GOOD_TXOSIZG(n)     (((n) << EMAC_TX_OSIZE_PACKETS_GOOD_TXOSIZG_SHIFT) & EMAC_TX_OSIZE_PACKETS_GOOD_TXOSIZG_MASK)

/* Receive Packets Count Good Bad (RX_PACKETS_COUNT_GOOD_BAD) */
#define EMAC_RX_PACKETS_COUNT_GOOD_BAD_RXPKTGB_SHIFT  (0) /* Bits 0-32: Receive Packets Count Good Bad */
#define EMAC_RX_PACKETS_COUNT_GOOD_BAD_RXPKTGB_MASK   (0xffffffff << EMAC_RX_PACKETS_COUNT_GOOD_BAD_RXPKTGB_SHIFT)
#define EMAC_RX_PACKETS_COUNT_GOOD_BAD_RXPKTGB(n)     (((n) << EMAC_RX_PACKETS_COUNT_GOOD_BAD_RXPKTGB_SHIFT) & EMAC_RX_PACKETS_COUNT_GOOD_BAD_RXPKTGB_MASK)

/* Receive Octet Count Good Bad (RX_OCTET_COUNT_GOOD_BAD) */
#define EMAC_RX_OCTET_COUNT_GOOD_BAD_RXOCTGB_SHIFT  (0) /* Bits 0-32: Receive Octet Count Good Bad */
#define EMAC_RX_OCTET_COUNT_GOOD_BAD_RXOCTGB_MASK   (0xffffffff << EMAC_RX_OCTET_COUNT_GOOD_BAD_RXOCTGB_SHIFT)
#define EMAC_RX_OCTET_COUNT_GOOD_BAD_RXOCTGB(n)     (((n) << EMAC_RX_OCTET_COUNT_GOOD_BAD_RXOCTGB_SHIFT) & EMAC_RX_OCTET_COUNT_GOOD_BAD_RXOCTGB_MASK)

/* Receive Octet Count Good (RX_OCTET_COUNT_GOOD) */
#define EMAC_RX_OCTET_COUNT_GOOD_RXOCTG_SHIFT  (0) /* Bits 0-32: Receive Octet Count Good */
#define EMAC_RX_OCTET_COUNT_GOOD_RXOCTG_MASK   (0xffffffff << EMAC_RX_OCTET_COUNT_GOOD_RXOCTG_SHIFT)
#define EMAC_RX_OCTET_COUNT_GOOD_RXOCTG(n)     (((n) << EMAC_RX_OCTET_COUNT_GOOD_RXOCTG_SHIFT) & EMAC_RX_OCTET_COUNT_GOOD_RXOCTG_MASK)

/* Receive Broadcast Packets Good (RX_BROADCAST_PACKETS_GOOD) */
#define EMAC_RX_BROADCAST_PACKETS_GOOD_RXBCASTG_SHIFT  (0) /* Bits 0-32: Receive Broadcast Packets Good */
#define EMAC_RX_BROADCAST_PACKETS_GOOD_RXBCASTG_MASK   (0xffffffff << EMAC_RX_BROADCAST_PACKETS_GOOD_RXBCASTG_SHIFT)
#define EMAC_RX_BROADCAST_PACKETS_GOOD_RXBCASTG(n)     (((n) << EMAC_RX_BROADCAST_PACKETS_GOOD_RXBCASTG_SHIFT) & EMAC_RX_BROADCAST_PACKETS_GOOD_RXBCASTG_MASK)

/* Receive Multicast Packets Good (RX_MULTICAST_PACKETS_GOOD) */
#define EMAC_RX_MULTICAST_PACKETS_GOOD_RXMCASTG_SHIFT  (0) /* Bits 0-32: Receive Multicast Packets Good */
#define EMAC_RX_MULTICAST_PACKETS_GOOD_RXMCASTG_MASK   (0xffffffff << EMAC_RX_MULTICAST_PACKETS_GOOD_RXMCASTG_SHIFT)
#define EMAC_RX_MULTICAST_PACKETS_GOOD_RXMCASTG(n)     (((n) << EMAC_RX_MULTICAST_PACKETS_GOOD_RXMCASTG_SHIFT) & EMAC_RX_MULTICAST_PACKETS_GOOD_RXMCASTG_MASK)

/* Receive CRC Error Packets (RX_CRC_ERROR_PACKETS) */
#define EMAC_RX_CRC_ERROR_PACKETS_RXCRCERR_SHIFT  (0) /* Bits 0-32: Receive CRC Error Packets */
#define EMAC_RX_CRC_ERROR_PACKETS_RXCRCERR_MASK   (0xffffffff << EMAC_RX_CRC_ERROR_PACKETS_RXCRCERR_SHIFT)
#define EMAC_RX_CRC_ERROR_PACKETS_RXCRCERR(n)     (((n) << EMAC_RX_CRC_ERROR_PACKETS_RXCRCERR_SHIFT) & EMAC_RX_CRC_ERROR_PACKETS_RXCRCERR_MASK)

/* Receive Alignment Error Packets (RX_ALIGNMENT_ERROR_PACKETS) */
#define EMAC_RX_ALIGNMENT_ERROR_PACKETS_RXALGNERR_SHIFT  (0) /* Bits 0-32: Receive Alignment Error Packets */
#define EMAC_RX_ALIGNMENT_ERROR_PACKETS_RXALGNERR_MASK   (0xffffffff << EMAC_RX_ALIGNMENT_ERROR_PACKETS_RXALGNERR_SHIFT)
#define EMAC_RX_ALIGNMENT_ERROR_PACKETS_RXALGNERR(n)     (((n) << EMAC_RX_ALIGNMENT_ERROR_PACKETS_RXALGNERR_SHIFT) & EMAC_RX_ALIGNMENT_ERROR_PACKETS_RXALGNERR_MASK)

/* Receive Runt Error Packets (RX_RUNT_ERROR_PACKETS) */
#define EMAC_RX_RUNT_ERROR_PACKETS_RXRUNTERR_SHIFT  (0) /* Bits 0-32: Receive Runt Error Packets */
#define EMAC_RX_RUNT_ERROR_PACKETS_RXRUNTERR_MASK   (0xffffffff << EMAC_RX_RUNT_ERROR_PACKETS_RXRUNTERR_SHIFT)
#define EMAC_RX_RUNT_ERROR_PACKETS_RXRUNTERR(n)     (((n) << EMAC_RX_RUNT_ERROR_PACKETS_RXRUNTERR_SHIFT) & EMAC_RX_RUNT_ERROR_PACKETS_RXRUNTERR_MASK)

/* Receive Jabber Error Packets (RX_JABBER_ERROR_PACKETS) */
#define EMAC_RX_JABBER_ERROR_PACKETS_RXJABERR_SHIFT  (0) /* Bits 0-32: Receive Jabber Error Packets */
#define EMAC_RX_JABBER_ERROR_PACKETS_RXJABERR_MASK   (0xffffffff << EMAC_RX_JABBER_ERROR_PACKETS_RXJABERR_SHIFT)
#define EMAC_RX_JABBER_ERROR_PACKETS_RXJABERR(n)     (((n) << EMAC_RX_JABBER_ERROR_PACKETS_RXJABERR_SHIFT) & EMAC_RX_JABBER_ERROR_PACKETS_RXJABERR_MASK)

/* Receive Undersize Packets Good (RX_UNDERSIZE_PACKETS_GOOD) */
#define EMAC_RX_UNDERSIZE_PACKETS_GOOD_RXUNDERSZG_SHIFT  (0) /* Bits 0-32: Receive Undersize Packets Good */
#define EMAC_RX_UNDERSIZE_PACKETS_GOOD_RXUNDERSZG_MASK   (0xffffffff << EMAC_RX_UNDERSIZE_PACKETS_GOOD_RXUNDERSZG_SHIFT)
#define EMAC_RX_UNDERSIZE_PACKETS_GOOD_RXUNDERSZG(n)     (((n) << EMAC_RX_UNDERSIZE_PACKETS_GOOD_RXUNDERSZG_SHIFT) & EMAC_RX_UNDERSIZE_PACKETS_GOOD_RXUNDERSZG_MASK)

/* Receive Oversize Packets Good (RX_OVERSIZE_PACKETS_GOOD) */
#define EMAC_RX_OVERSIZE_PACKETS_GOOD_RXOVERSZG_SHIFT  (0) /* Bits 0-32: Receive Oversize Packets Good */
#define EMAC_RX_OVERSIZE_PACKETS_GOOD_RXOVERSZG_MASK   (0xffffffff << EMAC_RX_OVERSIZE_PACKETS_GOOD_RXOVERSZG_SHIFT)
#define EMAC_RX_OVERSIZE_PACKETS_GOOD_RXOVERSZG(n)     (((n) << EMAC_RX_OVERSIZE_PACKETS_GOOD_RXOVERSZG_SHIFT) & EMAC_RX_OVERSIZE_PACKETS_GOOD_RXOVERSZG_MASK)

/* Receive 64 Octets Packets Good Bad (RX_64OCTETS_PACKETS_GOOD_BAD) */
#define EMAC_RX_64OCTETS_PACKETS_GOOD_BAD_RX64OCTGB_SHIFT  (0) /* Bits 0-32: Receive 64 Octets Packets Good Bad */
#define EMAC_RX_64OCTETS_PACKETS_GOOD_BAD_RX64OCTGB_MASK   (0xffffffff << EMAC_RX_64OCTETS_PACKETS_GOOD_BAD_RX64OCTGB_SHIFT)
#define EMAC_RX_64OCTETS_PACKETS_GOOD_BAD_RX64OCTGB(n)     (((n) << EMAC_RX_64OCTETS_PACKETS_GOOD_BAD_RX64OCTGB_SHIFT) & EMAC_RX_64OCTETS_PACKETS_GOOD_BAD_RX64OCTGB_MASK)

/* Receive 65-127 Octets Packets Good Bad
 * (RX_65TO127OCTETS_PACKETS_GOOD_BAD)
 */

