apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_emac.h
#define EMAC_RX_65TO127OCTETS_PACKETS_GOOD_BAD_RX65_127OCTGB_SHIFT  (0) /* Bits 0-32: Receive 65-127 Octets Packets Good Bad */
#define EMAC_RX_65TO127OCTETS_PACKETS_GOOD_BAD_RX65_127OCTGB_MASK   (0xffffffff << EMAC_RX_65TO127OCTETS_PACKETS_GOOD_BAD_RX65_127OCTGB_SHIFT)
#define EMAC_RX_65TO127OCTETS_PACKETS_GOOD_BAD_RX65_127OCTGB(n)     (((n) << EMAC_RX_65TO127OCTETS_PACKETS_GOOD_BAD_RX65_127OCTGB_SHIFT) & EMAC_RX_65TO127OCTETS_PACKETS_GOOD_BAD_RX65_127OCTGB_MASK)

/* Receive 128-255 Octets Packets Good Bad
 * (RX_128TO255OCTETS_PACKETS_GOOD_BAD)
 */

#define EMAC_RX_128TO255OCTETS_PACKETS_GOOD_BAD_RX128_255OCTGB_SHIFT  (0) /* Bits 0-32: Receive 128-255 Octets Packets Good Bad */
#define EMAC_RX_128TO255OCTETS_PACKETS_GOOD_BAD_RX128_255OCTGB_MASK   (0xffffffff << EMAC_RX_128TO255OCTETS_PACKETS_GOOD_BAD_RX128_255OCTGB_SHIFT)
#define EMAC_RX_128TO255OCTETS_PACKETS_GOOD_BAD_RX128_255OCTGB(n)     (((n) << EMAC_RX_128TO255OCTETS_PACKETS_GOOD_BAD_RX128_255OCTGB_SHIFT) & EMAC_RX_128TO255OCTETS_PACKETS_GOOD_BAD_RX128_255OCTGB_MASK)

/* Receive 256-511 Octets Packets Good Bad
 * (RX_256TO511OCTETS_PACKETS_GOOD_BAD)
 */

#define EMAC_RX_256TO511OCTETS_PACKETS_GOOD_BAD_RX256_511OCTGB_SHIFT  (0) /* Bits 0-32: Receive 256-511 Octets Packets Good Bad */
#define EMAC_RX_256TO511OCTETS_PACKETS_GOOD_BAD_RX256_511OCTGB_MASK   (0xffffffff << EMAC_RX_256TO511OCTETS_PACKETS_GOOD_BAD_RX256_511OCTGB_SHIFT)
#define EMAC_RX_256TO511OCTETS_PACKETS_GOOD_BAD_RX256_511OCTGB(n)     (((n) << EMAC_RX_256TO511OCTETS_PACKETS_GOOD_BAD_RX256_511OCTGB_SHIFT) & EMAC_RX_256TO511OCTETS_PACKETS_GOOD_BAD_RX256_511OCTGB_MASK)

/* Receive 512-1023 Octets Packets Good Bad
 * (RX_512TO1023OCTETS_PACKETS_GOOD_BAD)
 */

#define EMAC_RX_512TO1023OCTETS_PACKETS_GOOD_BAD_RX512_1023OCTGB_SHIFT  (0) /* Bits 0-32: Receive 512-1023 Octets Packets Good Bad */
#define EMAC_RX_512TO1023OCTETS_PACKETS_GOOD_BAD_RX512_1023OCTGB_MASK   (0xffffffff << EMAC_RX_512TO1023OCTETS_PACKETS_GOOD_BAD_RX512_1023OCTGB_SHIFT)
#define EMAC_RX_512TO1023OCTETS_PACKETS_GOOD_BAD_RX512_1023OCTGB(n)     (((n) << EMAC_RX_512TO1023OCTETS_PACKETS_GOOD_BAD_RX512_1023OCTGB_SHIFT) & EMAC_RX_512TO1023OCTETS_PACKETS_GOOD_BAD_RX512_1023OCTGB_MASK)

/* Receive 1024 To Max Octets Good Bad
 * (RX_1024TOMAXOCTETS_PACKETS_GOOD_BAD)
 */

#define EMAC_RX_1024TOMAXOCTETS_PACKETS_GOOD_BAD_RX1024_MAXOCTGB_SHIFT  (0) /* Bits 0-32: Receive 1024-Max Octets Good Bad */
#define EMAC_RX_1024TOMAXOCTETS_PACKETS_GOOD_BAD_RX1024_MAXOCTGB_MASK   (0xffffffff << EMAC_RX_1024TOMAXOCTETS_PACKETS_GOOD_BAD_RX1024_MAXOCTGB_SHIFT)
#define EMAC_RX_1024TOMAXOCTETS_PACKETS_GOOD_BAD_RX1024_MAXOCTGB(n)     (((n) << EMAC_RX_1024TOMAXOCTETS_PACKETS_GOOD_BAD_RX1024_MAXOCTGB_SHIFT) & EMAC_RX_1024TOMAXOCTETS_PACKETS_GOOD_BAD_RX1024_MAXOCTGB_MASK)

/* Receive Unicast Packets Good (RX_UNICAST_PACKETS_GOOD) */
#define EMAC_RX_UNICAST_PACKETS_GOOD_RXUCASTG_SHIFT  (0) /* Bits 0-32: Receive Unicast Packets Good */
#define EMAC_RX_UNICAST_PACKETS_GOOD_RXUCASTG_MASK   (0xffffffff << EMAC_RX_UNICAST_PACKETS_GOOD_RXUCASTG_SHIFT)
#define EMAC_RX_UNICAST_PACKETS_GOOD_RXUCASTG(n)     (((n) << EMAC_RX_UNICAST_PACKETS_GOOD_RXUCASTG_SHIFT) & EMAC_RX_UNICAST_PACKETS_GOOD_RXUCASTG_MASK)

/* Receive Length Error Packets (RX_LENGTH_ERROR_PACKETS) */
#define EMAC_RX_LENGTH_ERROR_PACKETS_RXLENERR_SHIFT  (0) /* Bits 0-32: Receive Length Error Packets */
#define EMAC_RX_LENGTH_ERROR_PACKETS_RXLENERR_MASK   (0xffffffff << EMAC_RX_LENGTH_ERROR_PACKETS_RXLENERR_SHIFT)
#define EMAC_RX_LENGTH_ERROR_PACKETS_RXLENERR(n)     (((n) << EMAC_RX_LENGTH_ERROR_PACKETS_RXLENERR_SHIFT) & EMAC_RX_LENGTH_ERROR_PACKETS_RXLENERR_MASK)

/* Receive Out of Range Type Packet (RX_OUT_OF_RANGE_TYPE_PACKETS) */
#define EMAC_RX_OUT_OF_RANGE_TYPE_PACKETS_RXOUTOFRNG_SHIFT  (0) /* Bits 0-32: Receive Out of Range Type Packet */
#define EMAC_RX_OUT_OF_RANGE_TYPE_PACKETS_RXOUTOFRNG_MASK   (0xffffffff << EMAC_RX_OUT_OF_RANGE_TYPE_PACKETS_RXOUTOFRNG_SHIFT)
#define EMAC_RX_OUT_OF_RANGE_TYPE_PACKETS_RXOUTOFRNG(n)     (((n) << EMAC_RX_OUT_OF_RANGE_TYPE_PACKETS_RXOUTOFRNG_SHIFT) & EMAC_RX_OUT_OF_RANGE_TYPE_PACKETS_RXOUTOFRNG_MASK)

/* Receive Pause Packets (RX_PAUSE_PACKETS) */
#define EMAC_RX_PAUSE_PACKETS_RXPAUSEPKT_SHIFT  (0) /* Bits 0-32: Receive Pause Packets */
#define EMAC_RX_PAUSE_PACKETS_RXPAUSEPKT_MASK   (0xffffffff << EMAC_RX_PAUSE_PACKETS_RXPAUSEPKT_SHIFT)
#define EMAC_RX_PAUSE_PACKETS_RXPAUSEPKT(n)     (((n) << EMAC_RX_PAUSE_PACKETS_RXPAUSEPKT_SHIFT) & EMAC_RX_PAUSE_PACKETS_RXPAUSEPKT_MASK)

/* Receive FIFO Overflow Packets (RX_FIFO_OVERFLOW_PACKETS) */
#define EMAC_RX_FIFO_OVERFLOW_PACKETS_RXFIFOOVFL_SHIFT  (0) /* Bits 0-32: Receive FIFO Overflow Packets */
#define EMAC_RX_FIFO_OVERFLOW_PACKETS_RXFIFOOVFL_MASK   (0xffffffff << EMAC_RX_FIFO_OVERFLOW_PACKETS_RXFIFOOVFL_SHIFT)
#define EMAC_RX_FIFO_OVERFLOW_PACKETS_RXFIFOOVFL(n)     (((n) << EMAC_RX_FIFO_OVERFLOW_PACKETS_RXFIFOOVFL_SHIFT) & EMAC_RX_FIFO_OVERFLOW_PACKETS_RXFIFOOVFL_MASK)

/* Receive VLAN Packets Good Bad (RX_VLAN_PACKETS_GOOD_BAD) */
#define EMAC_RX_VLAN_PACKETS_GOOD_BAD_RXVLANPKTGB_SHIFT  (0) /* Bits 0-32: Receive VLAN Packets Good Bad */
#define EMAC_RX_VLAN_PACKETS_GOOD_BAD_RXVLANPKTGB_MASK   (0xffffffff << EMAC_RX_VLAN_PACKETS_GOOD_BAD_RXVLANPKTGB_SHIFT)
#define EMAC_RX_VLAN_PACKETS_GOOD_BAD_RXVLANPKTGB(n)     (((n) << EMAC_RX_VLAN_PACKETS_GOOD_BAD_RXVLANPKTGB_SHIFT) & EMAC_RX_VLAN_PACKETS_GOOD_BAD_RXVLANPKTGB_MASK)

/* Receive Watchdog Error Packets (RX_WATCHDOG_ERROR_PACKETS) */
#define EMAC_RX_WATCHDOG_ERROR_PACKETS_RXWDGERR_SHIFT  (0) /* Bits 0-32: Receive Watchdog Error Packets */
#define EMAC_RX_WATCHDOG_ERROR_PACKETS_RXWDGERR_MASK   (0xffffffff << EMAC_RX_WATCHDOG_ERROR_PACKETS_RXWDGERR_SHIFT)
#define EMAC_RX_WATCHDOG_ERROR_PACKETS_RXWDGERR(n)     (((n) << EMAC_RX_WATCHDOG_ERROR_PACKETS_RXWDGERR_SHIFT) & EMAC_RX_WATCHDOG_ERROR_PACKETS_RXWDGERR_MASK)

/* Receive Receive Error Packets (RX_RECEIVE_ERROR_PACKETS) */
#define EMAC_RX_RECEIVE_ERROR_PACKETS_RXRCVERR_SHIFT  (0) /* Bits 0-32: Receive Receive Error Packets */
#define EMAC_RX_RECEIVE_ERROR_PACKETS_RXRCVERR_MASK   (0xffffffff << EMAC_RX_RECEIVE_ERROR_PACKETS_RXRCVERR_SHIFT)
#define EMAC_RX_RECEIVE_ERROR_PACKETS_RXRCVERR(n)     (((n) << EMAC_RX_RECEIVE_ERROR_PACKETS_RXRCVERR_SHIFT) & EMAC_RX_RECEIVE_ERROR_PACKETS_RXRCVERR_MASK)

/* Receive Control Packets Good (RX_CONTROL_PACKETS_GOOD) */
#define EMAC_RX_CONTROL_PACKETS_GOOD_RXCTRLG_SHIFT  (0) /* Bits 0-32: Receive Control Packets Good */
#define EMAC_RX_CONTROL_PACKETS_GOOD_RXCTRLG_MASK   (0xffffffff << EMAC_RX_CONTROL_PACKETS_GOOD_RXCTRLG_SHIFT)
#define EMAC_RX_CONTROL_PACKETS_GOOD_RXCTRLG(n)     (((n) << EMAC_RX_CONTROL_PACKETS_GOOD_RXCTRLG_SHIFT) & EMAC_RX_CONTROL_PACKETS_GOOD_RXCTRLG_MASK)

/* MMC Transmit FPE Fragment Counter Interrupt Status
 * (MMC_FPE_TX_INTERRUPT)
 */

