apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_emac.h
#define EMAC_MMC_FPE_TX_INTERRUPT_FCIS   (1 << 0) /* Bit 0: MMC Transmit FPE Fragment Counter Interrupt Status */
#define EMAC_MMC_FPE_TX_INTERRUPT_HRCIS  (1 << 1) /* Bit 1: MMC Transmit Hold Request Counter Interrupt Status */

/* MMC FPE Transmit Interrupt Mask (MMC_FPE_TX_INTERRUPT_MASK) */
#define EMAC_MMC_FPE_TX_INTERRUPT_MASK_FCIM   (1 << 0) /* Bit 0: MMC Transmit Fragment Counter Interrupt Mask */
#define EMAC_MMC_FPE_TX_INTERRUPT_MASK_HRCIM  (1 << 1) /* Bit 1: MMC Transmit Hold Request Counter Interrupt Mask */

/* Transmit FPE Fragment Counter (MMC_TX_FPE_FRAGMENT_CNTR) */
#define EMAC_MMC_TX_FPE_FRAGMENT_CNTR_TXFFC_SHIFT  (0) /* Bits 0-32: Transmit FPE Fragment Counter */
#define EMAC_MMC_TX_FPE_FRAGMENT_CNTR_TXFFC_MASK   (0xffffffff << EMAC_MMC_TX_FPE_FRAGMENT_CNTR_TXFFC_SHIFT)
#define EMAC_MMC_TX_FPE_FRAGMENT_CNTR_TXFFC(n)     (((n) << EMAC_MMC_TX_FPE_FRAGMENT_CNTR_TXFFC_SHIFT) & EMAC_MMC_TX_FPE_FRAGMENT_CNTR_TXFFC_MASK)

/* Transmit Hold Request Counter (MMC_TX_HOLD_REQ_CNTR) */
#define EMAC_MMC_TX_HOLD_REQ_CNTR_TXHRC_SHIFT  (0) /* Bits 0-32: Transmit Hold Request Counter */
#define EMAC_MMC_TX_HOLD_REQ_CNTR_TXHRC_MASK   (0xffffffff << EMAC_MMC_TX_HOLD_REQ_CNTR_TXHRC_SHIFT)
#define EMAC_MMC_TX_HOLD_REQ_CNTR_TXHRC(n)     (((n) << EMAC_MMC_TX_HOLD_REQ_CNTR_TXHRC_SHIFT) & EMAC_MMC_TX_HOLD_REQ_CNTR_TXHRC_MASK)

/* MMC Receive Packet Assembly Error Counter Interrupt Status
 * (MMC_FPE_RX_INTERRUPT)
 */

#define EMAC_MMC_FPE_RX_INTERRUPT_PAECIS  (1 << 0) /* Bit 0: MMC Receive, transmit, Packet Assembly Error Counter Interrupt Status */
#define EMAC_MMC_FPE_RX_INTERRUPT_PSECIS  (1 << 1) /* Bit 1: MMC Receive, Transmit, Packet SMD Error Counter Interrupt Status */
#define EMAC_MMC_FPE_RX_INTERRUPT_PAOCIS  (1 << 2) /* Bit 2: MMC Receive Packet Assembly OK Counter Interrupt Status */
#define EMAC_MMC_FPE_RX_INTERRUPT_FCIS    (1 << 3) /* Bit 3: MMC Receive FPE Fragment Counter Interrupt Status */

/* MMC FPE Receive Interrupt Mask (MMC_FPE_RX_INTERRUPT_MASK) */
#define EMAC_MMC_FPE_RX_INTERRUPT_MASK_PAECIM  (1 << 0) /* Bit 0: MMC receive Packet Assembly Error Counter Interrupt Mask */
#define EMAC_MMC_FPE_RX_INTERRUPT_MASK_PSECIM  (1 << 1) /* Bit 1: MMC Receive Packet SMD Error Counter Interrupt Mask */
#define EMAC_MMC_FPE_RX_INTERRUPT_MASK_PAOCIM  (1 << 2) /* Bit 2: MMC Receive Packet Assembly OK Counter Interrupt Mask */
#define EMAC_MMC_FPE_RX_INTERRUPT_MASK_FCIM    (1 << 3) /* Bit 3: MMC Receive FPE Fragment Counter Interrupt Mask */

/* MMC Receive Packet Assembly Error Counter
 * (MMC_RX_PACKET_ASSEMBLY_ERR_CNTR)
 */

#define EMAC_MMC_RX_PACKET_ASSEMBLY_ERR_CNTR_PAEC_SHIFT  (0) /* Bits 0-32: Packet Assembly Error Counter */
#define EMAC_MMC_RX_PACKET_ASSEMBLY_ERR_CNTR_PAEC_MASK   (0xffffffff << EMAC_MMC_RX_PACKET_ASSEMBLY_ERR_CNTR_PAEC_SHIFT)
#define EMAC_MMC_RX_PACKET_ASSEMBLY_ERR_CNTR_PAEC(n)     (((n) << EMAC_MMC_RX_PACKET_ASSEMBLY_ERR_CNTR_PAEC_SHIFT) & EMAC_MMC_RX_PACKET_ASSEMBLY_ERR_CNTR_PAEC_MASK)

/* MMC Receive Packet SMD Error Counter (MMC_RX_PACKET_SMD_ERR_CNTR) */
#define EMAC_MMC_RX_PACKET_SMD_ERR_CNTR_PSEC_SHIFT  (0) /* Bits 0-32: Packet SMD Error Counter */
#define EMAC_MMC_RX_PACKET_SMD_ERR_CNTR_PSEC_MASK   (0xffffffff << EMAC_MMC_RX_PACKET_SMD_ERR_CNTR_PSEC_SHIFT)
#define EMAC_MMC_RX_PACKET_SMD_ERR_CNTR_PSEC(n)     (((n) << EMAC_MMC_RX_PACKET_SMD_ERR_CNTR_PSEC_SHIFT) & EMAC_MMC_RX_PACKET_SMD_ERR_CNTR_PSEC_MASK)

/* MMC Receive Packet Assembly OK Counter (MMC_RX_PACKET_ASSEMBLY_OK_CNTR) */
#define EMAC_MMC_RX_PACKET_ASSEMBLY_OK_CNTR_PAOC_SHIFT  (0) /* Bits 0-32: Packet Assembly OK Counter */
#define EMAC_MMC_RX_PACKET_ASSEMBLY_OK_CNTR_PAOC_MASK   (0xffffffff << EMAC_MMC_RX_PACKET_ASSEMBLY_OK_CNTR_PAOC_SHIFT)
#define EMAC_MMC_RX_PACKET_ASSEMBLY_OK_CNTR_PAOC(n)     (((n) << EMAC_MMC_RX_PACKET_ASSEMBLY_OK_CNTR_PAOC_SHIFT) & EMAC_MMC_RX_PACKET_ASSEMBLY_OK_CNTR_PAOC_MASK)

/* MMC Receive FPE Fragment Counter (MMC_RX_FPE_FRAGMENT_CNTR) */
#define EMAC_MMC_RX_FPE_FRAGMENT_CNTR_FFC_SHIFT  (0) /* Bits 0-32: FPE Fragment Counter */
#define EMAC_MMC_RX_FPE_FRAGMENT_CNTR_FFC_MASK   (0xffffffff << EMAC_MMC_RX_FPE_FRAGMENT_CNTR_FFC_SHIFT)
#define EMAC_MMC_RX_FPE_FRAGMENT_CNTR_FFC(n)     (((n) << EMAC_MMC_RX_FPE_FRAGMENT_CNTR_FFC_SHIFT) & EMAC_MMC_RX_FPE_FRAGMENT_CNTR_FFC_MASK)

/* MAC Layer 3 Layer 4 Control 0 (MAC_L3_L4_CONTROL0) */
#define EMAC_MAC_L3_L4_CONTROL0_L3PEN0         (1 << 0) /* Bit 0: Layer 3 Protocol Enable */
#define EMAC_MAC_L3_L4_CONTROL0_L3SAM0         (1 << 2) /* Bit 2: Layer 3 IP SA Match Enable */
#define EMAC_MAC_L3_L4_CONTROL0_L3SAIM0        (1 << 3) /* Bit 3: Layer 3 IP SA Inverse Match Enable */
#define EMAC_MAC_L3_L4_CONTROL0_L3DAM0         (1 << 4) /* Bit 4: Layer 3 IP DA Match Enable */
#define EMAC_MAC_L3_L4_CONTROL0_L3DAIM0        (1 << 5) /* Bit 5: Layer 3 IP DA Inverse Match Enable */
#define EMAC_MAC_L3_L4_CONTROL0_L3HSBM0_SHIFT  (6)      /* Bits 6-11: Layer 3 IP SA Higher Bits Match */
#define EMAC_MAC_L3_L4_CONTROL0_L3HSBM0_MASK   (0x1f << EMAC_MAC_L3_L4_CONTROL0_L3HSBM0_SHIFT)
#define EMAC_MAC_L3_L4_CONTROL0_L3HSBM0(n)     (((n) << EMAC_MAC_L3_L4_CONTROL0_L3HSBM0_SHIFT) & EMAC_MAC_L3_L4_CONTROL0_L3HSBM0_MASK)
#define EMAC_MAC_L3_L4_CONTROL0_L3HDBM0_SHIFT  (11) /* Bits 11-16: Layer 3 IP DA Higher Bits Match */
#define EMAC_MAC_L3_L4_CONTROL0_L3HDBM0_MASK   (0x1f << EMAC_MAC_L3_L4_CONTROL0_L3HDBM0_SHIFT)
#define EMAC_MAC_L3_L4_CONTROL0_L3HDBM0(n)     (((n) << EMAC_MAC_L3_L4_CONTROL0_L3HDBM0_SHIFT) & EMAC_MAC_L3_L4_CONTROL0_L3HDBM0_MASK)
#define EMAC_MAC_L3_L4_CONTROL0_L4PEN0         (1 << 16) /* Bit 16: Layer 4 Protocol Enable */
#define EMAC_MAC_L3_L4_CONTROL0_L4SPM0         (1 << 18) /* Bit 18: Layer 4 Source Port Match Enable */
#define EMAC_MAC_L3_L4_CONTROL0_L4SPIM0        (1 << 19) /* Bit 19: Layer 4 Source Port Inverse Match Enable */
#define EMAC_MAC_L3_L4_CONTROL0_L4DPM0         (1 << 20) /* Bit 20: Layer 4 Destination Port Match Enable */
#define EMAC_MAC_L3_L4_CONTROL0_L4DPIM0        (1 << 21) /* Bit 21: Layer 4 Destination Port Inverse Match Enable */
#define EMAC_MAC_L3_L4_CONTROL0_DMCHN0         (1 << 24) /* Bit 24: DMA Channel Number */
#define EMAC_MAC_L3_L4_CONTROL0_DMCHEN0        (1 << 28) /* Bit 28: DMA Channel Select Enable */

