apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_emac.h
/* MAC Layer 4 Address 0 (MAC_LAYER4_ADDRESS0) */
#define EMAC_MAC_LAYER4_ADDRESS0_L4SP0_SHIFT  (0) /* Bits 0-16: Layer 4 Source Port Number */
#define EMAC_MAC_LAYER4_ADDRESS0_L4SP0_MASK   (0xffff << EMAC_MAC_LAYER4_ADDRESS0_L4SP0_SHIFT)
#define EMAC_MAC_LAYER4_ADDRESS0_L4SP0(n)     (((n) << EMAC_MAC_LAYER4_ADDRESS0_L4SP0_SHIFT) & EMAC_MAC_LAYER4_ADDRESS0_L4SP0_MASK)
#define EMAC_MAC_LAYER4_ADDRESS0_L4DP0_SHIFT  (16) /* Bits 16-32: Layer 4 Destination Port Number */
#define EMAC_MAC_LAYER4_ADDRESS0_L4DP0_MASK   (0xffff << EMAC_MAC_LAYER4_ADDRESS0_L4DP0_SHIFT)
#define EMAC_MAC_LAYER4_ADDRESS0_L4DP0(n)     (((n) << EMAC_MAC_LAYER4_ADDRESS0_L4DP0_SHIFT) & EMAC_MAC_LAYER4_ADDRESS0_L4DP0_MASK)

/* MAC Layer 3 Address 0 Reg 0 (MAC_LAYER3_ADDR0_REG0) */
#define EMAC_MAC_LAYER3_ADDR0_REG0_L3A00_SHIFT  (0) /* Bits 0-32: Layer 3 Address 0 */
#define EMAC_MAC_LAYER3_ADDR0_REG0_L3A00_MASK   (0xffffffff << EMAC_MAC_LAYER3_ADDR0_REG0_L3A00_SHIFT)
#define EMAC_MAC_LAYER3_ADDR0_REG0_L3A00(n)     (((n) << EMAC_MAC_LAYER3_ADDR0_REG0_L3A00_SHIFT) & EMAC_MAC_LAYER3_ADDR0_REG0_L3A00_MASK)

/* MAC Layer 3 Address 1 Reg 0 (MAC_LAYER3_ADDR1_REG0) */
#define EMAC_MAC_LAYER3_ADDR1_REG0_L3A10_SHIFT  (0) /* Bits 0-32: Layer 3 Address 1 */
#define EMAC_MAC_LAYER3_ADDR1_REG0_L3A10_MASK   (0xffffffff << EMAC_MAC_LAYER3_ADDR1_REG0_L3A10_SHIFT)
#define EMAC_MAC_LAYER3_ADDR1_REG0_L3A10(n)     (((n) << EMAC_MAC_LAYER3_ADDR1_REG0_L3A10_SHIFT) & EMAC_MAC_LAYER3_ADDR1_REG0_L3A10_MASK)

/* MAC Layer 3 Address 2 Reg 0 (MAC_LAYER3_ADDR2_REG0) */
#define EMAC_MAC_LAYER3_ADDR2_REG0_L3A20_SHIFT  (0) /* Bits 0-32: Layer 3 Address 2 */
#define EMAC_MAC_LAYER3_ADDR2_REG0_L3A20_MASK   (0xffffffff << EMAC_MAC_LAYER3_ADDR2_REG0_L3A20_SHIFT)
#define EMAC_MAC_LAYER3_ADDR2_REG0_L3A20(n)     (((n) << EMAC_MAC_LAYER3_ADDR2_REG0_L3A20_SHIFT) & EMAC_MAC_LAYER3_ADDR2_REG0_L3A20_MASK)

/* MAC Layer 3 Address 3 Reg 0 (MAC_LAYER3_ADDR3_REG0) */
#define EMAC_MAC_LAYER3_ADDR3_REG0_L3A30_SHIFT  (0) /* Bits 0-32: Layer 3 Address 3 */
#define EMAC_MAC_LAYER3_ADDR3_REG0_L3A30_MASK   (0xffffffff << EMAC_MAC_LAYER3_ADDR3_REG0_L3A30_SHIFT)
#define EMAC_MAC_LAYER3_ADDR3_REG0_L3A30(n)     (((n) << EMAC_MAC_LAYER3_ADDR3_REG0_L3A30_SHIFT) & EMAC_MAC_LAYER3_ADDR3_REG0_L3A30_MASK)

/* MAC L3 L4 Control 1 (MAC_L3_L4_CONTROL1) */
#define EMAC_MAC_L3_L4_CONTROL1_L3PEN1         (1 << 0) /* Bit 0: Layer 3 Protocol Enable 1 */
#define EMAC_MAC_L3_L4_CONTROL1_L3SAM1         (1 << 2) /* Bit 2: Layer 3 IP SA Match Enable 1 */
#define EMAC_MAC_L3_L4_CONTROL1_L3SAIM1        (1 << 3) /* Bit 3: Layer 3 IP SA Inverse Match Enable 1 */
#define EMAC_MAC_L3_L4_CONTROL1_L3DAM1         (1 << 4) /* Bit 4: Layer 3 IP DA Match Enable 1 */
#define EMAC_MAC_L3_L4_CONTROL1_L3DAIM1        (1 << 5) /* Bit 5: Layer 3 IP DA Inverse Match Enable 1 */
#define EMAC_MAC_L3_L4_CONTROL1_L3HSBM1_SHIFT  (6)      /* Bits 6-11: Layer 3 IP SA Higher Bits Match 1 */
#define EMAC_MAC_L3_L4_CONTROL1_L3HSBM1_MASK   (0x1f << EMAC_MAC_L3_L4_CONTROL1_L3HSBM1_SHIFT)
#define EMAC_MAC_L3_L4_CONTROL1_L3HSBM1(n)     (((n) << EMAC_MAC_L3_L4_CONTROL1_L3HSBM1_SHIFT) & EMAC_MAC_L3_L4_CONTROL1_L3HSBM1_MASK)
#define EMAC_MAC_L3_L4_CONTROL1_L3HDBM1_SHIFT  (11) /* Bits 11-16: Layer 3 IP DA Higher Bits Match 1 */
#define EMAC_MAC_L3_L4_CONTROL1_L3HDBM1_MASK   (0x1f << EMAC_MAC_L3_L4_CONTROL1_L3HDBM1_SHIFT)
#define EMAC_MAC_L3_L4_CONTROL1_L3HDBM1(n)     (((n) << EMAC_MAC_L3_L4_CONTROL1_L3HDBM1_SHIFT) & EMAC_MAC_L3_L4_CONTROL1_L3HDBM1_MASK)
#define EMAC_MAC_L3_L4_CONTROL1_L4PEN1         (1 << 16) /* Bit 16: Layer 4 Protocol Enable 1 */
#define EMAC_MAC_L3_L4_CONTROL1_L4SPM1         (1 << 18) /* Bit 18: Layer 4 Source Port Match Enable 1 */
#define EMAC_MAC_L3_L4_CONTROL1_L4SPIM1        (1 << 19) /* Bit 19: Layer 4 Source Port Inverse Match Enable 1 */
#define EMAC_MAC_L3_L4_CONTROL1_L4DPM1         (1 << 20) /* Bit 20: Layer 4 Destination Port Match Enable 1 */
#define EMAC_MAC_L3_L4_CONTROL1_L4DPIM1        (1 << 21) /* Bit 21: Layer 4 Destination Port Inverse Match Enable 1 */
#define EMAC_MAC_L3_L4_CONTROL1_DMCHN1         (1 << 24) /* Bit 24: DMA Channel Number 1 */
#define EMAC_MAC_L3_L4_CONTROL1_DMCHEN1        (1 << 28) /* Bit 28: DMA Channel Select Enable 1 */

/* MAC Layer 4 Address 1 (MAC_LAYER4_ADDRESS1) */
#define EMAC_MAC_LAYER4_ADDRESS1_L4SP1_SHIFT  (0) /* Bits 0-16: Layer 4 Source Port Number 1 */
#define EMAC_MAC_LAYER4_ADDRESS1_L4SP1_MASK   (0xffff << EMAC_MAC_LAYER4_ADDRESS1_L4SP1_SHIFT)
#define EMAC_MAC_LAYER4_ADDRESS1_L4SP1(n)     (((n) << EMAC_MAC_LAYER4_ADDRESS1_L4SP1_SHIFT) & EMAC_MAC_LAYER4_ADDRESS1_L4SP1_MASK)
#define EMAC_MAC_LAYER4_ADDRESS1_L4DP1_SHIFT  (16) /* Bits 16-32: Layer 4 Destination Port Number 1 */
#define EMAC_MAC_LAYER4_ADDRESS1_L4DP1_MASK   (0xffff << EMAC_MAC_LAYER4_ADDRESS1_L4DP1_SHIFT)
#define EMAC_MAC_LAYER4_ADDRESS1_L4DP1(n)     (((n) << EMAC_MAC_LAYER4_ADDRESS1_L4DP1_SHIFT) & EMAC_MAC_LAYER4_ADDRESS1_L4DP1_MASK)

/* MAC Layer 3 Address 0 Reg 1 (MAC_LAYER3_ADDR0_REG1) */
#define EMAC_MAC_LAYER3_ADDR0_REG1_L3A01_SHIFT  (0) /* Bits 0-32: Layer 3 Address 0 */
#define EMAC_MAC_LAYER3_ADDR0_REG1_L3A01_MASK   (0xffffffff << EMAC_MAC_LAYER3_ADDR0_REG1_L3A01_SHIFT)
#define EMAC_MAC_LAYER3_ADDR0_REG1_L3A01(n)     (((n) << EMAC_MAC_LAYER3_ADDR0_REG1_L3A01_SHIFT) & EMAC_MAC_LAYER3_ADDR0_REG1_L3A01_MASK)

/* MAC Layer 3 Address 1 Reg 1 (MAC_LAYER3_ADDR1_REG1) */
#define EMAC_MAC_LAYER3_ADDR1_REG1_L3A11_SHIFT  (0) /* Bits 0-32: Layer 3 Address 1 */
#define EMAC_MAC_LAYER3_ADDR1_REG1_L3A11_MASK   (0xffffffff << EMAC_MAC_LAYER3_ADDR1_REG1_L3A11_SHIFT)
#define EMAC_MAC_LAYER3_ADDR1_REG1_L3A11(n)     (((n) << EMAC_MAC_LAYER3_ADDR1_REG1_L3A11_SHIFT) & EMAC_MAC_LAYER3_ADDR1_REG1_L3A11_MASK)

/* MAC Layer 3 Address 2 Reg 1 (MAC_LAYER3_ADDR2_REG1) */
#define EMAC_MAC_LAYER3_ADDR2_REG1_L3A21_SHIFT  (0) /* Bits 0-32: Layer 3 Address 2 */
#define EMAC_MAC_LAYER3_ADDR2_REG1_L3A21_MASK   (0xffffffff << EMAC_MAC_LAYER3_ADDR2_REG1_L3A21_SHIFT)
#define EMAC_MAC_LAYER3_ADDR2_REG1_L3A21(n)     (((n) << EMAC_MAC_LAYER3_ADDR2_REG1_L3A21_SHIFT) & EMAC_MAC_LAYER3_ADDR2_REG1_L3A21_MASK)

/* MAC Layer 3 Address 3 Reg 1 (MAC_LAYER3_ADDR3_REG1) */
#define EMAC_MAC_LAYER3_ADDR3_REG1_L3A31_SHIFT  (0) /* Bits 0-32: Layer 3 Address 3 */
#define EMAC_MAC_LAYER3_ADDR3_REG1_L3A31_MASK   (0xffffffff << EMAC_MAC_LAYER3_ADDR3_REG1_L3A31_SHIFT)
#define EMAC_MAC_LAYER3_ADDR3_REG1_L3A31(n)     (((n) << EMAC_MAC_LAYER3_ADDR3_REG1_L3A31_SHIFT) & EMAC_MAC_LAYER3_ADDR3_REG1_L3A31_MASK)

