apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_emac.h
/* MAC L3 L4 Control 2 (MAC_L3_L4_CONTROL2) */
#define EMAC_MAC_L3_L4_CONTROL2_L3PEN2         (1 << 0) /* Bit 0: Layer 3 Protocol Enable 2 */
#define EMAC_MAC_L3_L4_CONTROL2_L3SAM2         (1 << 2) /* Bit 2: Layer 3 IP SA Match Enable 2 */
#define EMAC_MAC_L3_L4_CONTROL2_L3SAIM2        (1 << 3) /* Bit 3: Layer 3 IP SA Inverse Match Enable 2 */
#define EMAC_MAC_L3_L4_CONTROL2_L3DAM2         (1 << 4) /* Bit 4: Layer 3 IP DA Match Enable 2 */
#define EMAC_MAC_L3_L4_CONTROL2_L3DAIM2        (1 << 5) /* Bit 5: Layer 3 IP DA Inverse Match Enable 2 */
#define EMAC_MAC_L3_L4_CONTROL2_L3HSBM2_SHIFT  (6)      /* Bits 6-11: Layer 3 IP SA Higher Bits Match 2 */
#define EMAC_MAC_L3_L4_CONTROL2_L3HSBM2_MASK   (0x1f << EMAC_MAC_L3_L4_CONTROL2_L3HSBM2_SHIFT)
#define EMAC_MAC_L3_L4_CONTROL2_L3HSBM2(n)     (((n) << EMAC_MAC_L3_L4_CONTROL2_L3HSBM2_SHIFT) & EMAC_MAC_L3_L4_CONTROL2_L3HSBM2_MASK)
#define EMAC_MAC_L3_L4_CONTROL2_L3HDBM2_SHIFT  (11) /* Bits 11-16: Layer 3 IP DA Higher Bits Match 2 */
#define EMAC_MAC_L3_L4_CONTROL2_L3HDBM2_MASK   (0x1f << EMAC_MAC_L3_L4_CONTROL2_L3HDBM2_SHIFT)
#define EMAC_MAC_L3_L4_CONTROL2_L3HDBM2(n)     (((n) << EMAC_MAC_L3_L4_CONTROL2_L3HDBM2_SHIFT) & EMAC_MAC_L3_L4_CONTROL2_L3HDBM2_MASK)
#define EMAC_MAC_L3_L4_CONTROL2_L4PEN2         (1 << 16) /* Bit 16: Layer 4 Protocol Enable 2 */
#define EMAC_MAC_L3_L4_CONTROL2_L4SPM2         (1 << 18) /* Bit 18: Layer 4 Source Port Match Enable 2 */
#define EMAC_MAC_L3_L4_CONTROL2_L4SPIM2        (1 << 19) /* Bit 19: Layer 4 Source Port Inverse Match Enable 2 */
#define EMAC_MAC_L3_L4_CONTROL2_L4DPM2         (1 << 20) /* Bit 20: Layer 4 Destination Port Match Enable 2 */
#define EMAC_MAC_L3_L4_CONTROL2_L4DPIM2        (1 << 21) /* Bit 21: Layer 4 Destination Port Inverse Match Enable 2 */
#define EMAC_MAC_L3_L4_CONTROL2_DMCHN2         (1 << 24) /* Bit 24: DMA Channel Number 2 */
#define EMAC_MAC_L3_L4_CONTROL2_DMCHEN2        (1 << 28) /* Bit 28: DMA Channel Select Enable 2 */

/* MAC Layer 4 Address 2 (MAC_LAYER4_ADDRESS2) */
#define EMAC_MAC_LAYER4_ADDRESS2_L4SP2_SHIFT  (0) /* Bits 0-16: Layer 4 Source Port Number 2 */
#define EMAC_MAC_LAYER4_ADDRESS2_L4SP2_MASK   (0xffff << EMAC_MAC_LAYER4_ADDRESS2_L4SP2_SHIFT)
#define EMAC_MAC_LAYER4_ADDRESS2_L4SP2(n)     (((n) << EMAC_MAC_LAYER4_ADDRESS2_L4SP2_SHIFT) & EMAC_MAC_LAYER4_ADDRESS2_L4SP2_MASK)
#define EMAC_MAC_LAYER4_ADDRESS2_L4DP2_SHIFT  (16) /* Bits 16-32: Layer 4 Destination Port Number 2 */
#define EMAC_MAC_LAYER4_ADDRESS2_L4DP2_MASK   (0xffff << EMAC_MAC_LAYER4_ADDRESS2_L4DP2_SHIFT)
#define EMAC_MAC_LAYER4_ADDRESS2_L4DP2(n)     (((n) << EMAC_MAC_LAYER4_ADDRESS2_L4DP2_SHIFT) & EMAC_MAC_LAYER4_ADDRESS2_L4DP2_MASK)

/* MAC Layer 3 Address 0 Reg 2 (MAC_LAYER3_ADDR0_REG2) */
#define EMAC_MAC_LAYER3_ADDR0_REG2_L3A02_SHIFT  (0) /* Bits 0-32: Layer 3 Address 0 */
#define EMAC_MAC_LAYER3_ADDR0_REG2_L3A02_MASK   (0xffffffff << EMAC_MAC_LAYER3_ADDR0_REG2_L3A02_SHIFT)
#define EMAC_MAC_LAYER3_ADDR0_REG2_L3A02(n)     (((n) << EMAC_MAC_LAYER3_ADDR0_REG2_L3A02_SHIFT) & EMAC_MAC_LAYER3_ADDR0_REG2_L3A02_MASK)

/* MAC Layer 3 Address 1 Reg 2 (MAC_LAYER3_ADDR1_REG2) */
#define EMAC_MAC_LAYER3_ADDR1_REG2_L3A12_SHIFT  (0) /* Bits 0-32: Layer 3 Address 1 */
#define EMAC_MAC_LAYER3_ADDR1_REG2_L3A12_MASK   (0xffffffff << EMAC_MAC_LAYER3_ADDR1_REG2_L3A12_SHIFT)
#define EMAC_MAC_LAYER3_ADDR1_REG2_L3A12(n)     (((n) << EMAC_MAC_LAYER3_ADDR1_REG2_L3A12_SHIFT) & EMAC_MAC_LAYER3_ADDR1_REG2_L3A12_MASK)

/* MAC Layer 3 Address 2 Reg 2 (MAC_LAYER3_ADDR2_REG2) */
#define EMAC_MAC_LAYER3_ADDR2_REG2_L3A22_SHIFT  (0) /* Bits 0-32: Layer 3 Address 2 */
#define EMAC_MAC_LAYER3_ADDR2_REG2_L3A22_MASK   (0xffffffff << EMAC_MAC_LAYER3_ADDR2_REG2_L3A22_SHIFT)
#define EMAC_MAC_LAYER3_ADDR2_REG2_L3A22(n)     (((n) << EMAC_MAC_LAYER3_ADDR2_REG2_L3A22_SHIFT) & EMAC_MAC_LAYER3_ADDR2_REG2_L3A22_MASK)

/* MAC Layer 3 Address 3 Reg 2 (MAC_LAYER3_ADDR3_REG2) */
#define EMAC_MAC_LAYER3_ADDR3_REG2_L3A32_SHIFT  (0) /* Bits 0-32: Layer 3 Address 3 */
#define EMAC_MAC_LAYER3_ADDR3_REG2_L3A32_MASK   (0xffffffff << EMAC_MAC_LAYER3_ADDR3_REG2_L3A32_SHIFT)
#define EMAC_MAC_LAYER3_ADDR3_REG2_L3A32(n)     (((n) << EMAC_MAC_LAYER3_ADDR3_REG2_L3A32_SHIFT) & EMAC_MAC_LAYER3_ADDR3_REG2_L3A32_MASK)

/* MAC L3 L4 Control 3 (MAC_L3_L4_CONTROL3) */
#define EMAC_MAC_L3_L4_CONTROL3_L3PEN3         (1 << 0) /* Bit 0: Layer 3 Protocol Enable 3 */
#define EMAC_MAC_L3_L4_CONTROL3_L3SAM3         (1 << 2) /* Bit 2: Layer 3 IP SA Match Enable 3 */
#define EMAC_MAC_L3_L4_CONTROL3_L3SAIM3        (1 << 3) /* Bit 3: Layer 3 IP SA Inverse Match Enable 3 */
#define EMAC_MAC_L3_L4_CONTROL3_L3DAM3         (1 << 4) /* Bit 4: Layer 3 IP DA Match Enable 3 */
#define EMAC_MAC_L3_L4_CONTROL3_L3DAIM3        (1 << 5) /* Bit 5: Layer 3 IP DA Inverse Match Enable 3 */
#define EMAC_MAC_L3_L4_CONTROL3_L3HSBM3_SHIFT  (6)      /* Bits 6-11: Layer 3 IP SA Higher Bits Match 3 */
#define EMAC_MAC_L3_L4_CONTROL3_L3HSBM3_MASK   (0x1f << EMAC_MAC_L3_L4_CONTROL3_L3HSBM3_SHIFT)
#define EMAC_MAC_L3_L4_CONTROL3_L3HSBM3(n)     (((n) << EMAC_MAC_L3_L4_CONTROL3_L3HSBM3_SHIFT) & EMAC_MAC_L3_L4_CONTROL3_L3HSBM3_MASK)
#define EMAC_MAC_L3_L4_CONTROL3_L3HDBM3_SHIFT  (11) /* Bits 11-16: Layer 3 IP DA Higher Bits Match 3 */
#define EMAC_MAC_L3_L4_CONTROL3_L3HDBM3_MASK   (0x1f << EMAC_MAC_L3_L4_CONTROL3_L3HDBM3_SHIFT)
#define EMAC_MAC_L3_L4_CONTROL3_L3HDBM3(n)     (((n) << EMAC_MAC_L3_L4_CONTROL3_L3HDBM3_SHIFT) & EMAC_MAC_L3_L4_CONTROL3_L3HDBM3_MASK)
#define EMAC_MAC_L3_L4_CONTROL3_L4PEN3         (1 << 16) /* Bit 16: Layer 4 Protocol Enable 3 */
#define EMAC_MAC_L3_L4_CONTROL3_L4SPM3         (1 << 18) /* Bit 18: Layer 4 Source Port Match Enable 3 */
#define EMAC_MAC_L3_L4_CONTROL3_L4SPIM3        (1 << 19) /* Bit 19: Layer 4 Source Port Inverse Match Enable 3 */
#define EMAC_MAC_L3_L4_CONTROL3_L4DPM3         (1 << 20) /* Bit 20: Layer 4 Destination Port Match Enable 3 */
#define EMAC_MAC_L3_L4_CONTROL3_L4DPIM3        (1 << 21) /* Bit 21: Layer 4 Destination Port Inverse Match Enable 3 */
#define EMAC_MAC_L3_L4_CONTROL3_DMCHN3         (1 << 24) /* Bit 24: DMA Channel Number 2 */
#define EMAC_MAC_L3_L4_CONTROL3_DMCHEN3        (1 << 28) /* Bit 28: DMA Channel Select Enable 3 */

