apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_emac.h
/* MAC Layer 4 Address 3 (MAC_LAYER4_ADDRESS3) */
#define EMAC_MAC_LAYER4_ADDRESS3_L4SP3_SHIFT  (0) /* Bits 0-16: Layer 4 Source Port Number 3 */
#define EMAC_MAC_LAYER4_ADDRESS3_L4SP3_MASK   (0xffff << EMAC_MAC_LAYER4_ADDRESS3_L4SP3_SHIFT)
#define EMAC_MAC_LAYER4_ADDRESS3_L4SP3(n)     (((n) << EMAC_MAC_LAYER4_ADDRESS3_L4SP3_SHIFT) & EMAC_MAC_LAYER4_ADDRESS3_L4SP3_MASK)
#define EMAC_MAC_LAYER4_ADDRESS3_L4DP3_SHIFT  (16) /* Bits 16-32: Layer 4 Destination Port Number 3 */
#define EMAC_MAC_LAYER4_ADDRESS3_L4DP3_MASK   (0xffff << EMAC_MAC_LAYER4_ADDRESS3_L4DP3_SHIFT)
#define EMAC_MAC_LAYER4_ADDRESS3_L4DP3(n)     (((n) << EMAC_MAC_LAYER4_ADDRESS3_L4DP3_SHIFT) & EMAC_MAC_LAYER4_ADDRESS3_L4DP3_MASK)

/* MAC Layer 3 Address 0 Reg 3 (MAC_LAYER3_ADDR0_REG3) */
#define EMAC_MAC_LAYER3_ADDR0_REG3_L3A03_SHIFT  (0) /* Bits 0-32: Layer 3 Address 0 */
#define EMAC_MAC_LAYER3_ADDR0_REG3_L3A03_MASK   (0xffffffff << EMAC_MAC_LAYER3_ADDR0_REG3_L3A03_SHIFT)
#define EMAC_MAC_LAYER3_ADDR0_REG3_L3A03(n)     (((n) << EMAC_MAC_LAYER3_ADDR0_REG3_L3A03_SHIFT) & EMAC_MAC_LAYER3_ADDR0_REG3_L3A03_MASK)

/* MAC Layer 3 Address 1 Reg 3 (MAC_LAYER3_ADDR1_REG3) */
#define EMAC_MAC_LAYER3_ADDR1_REG3_L3A13_SHIFT  (0) /* Bits 0-32: Layer 3 Address 1 */
#define EMAC_MAC_LAYER3_ADDR1_REG3_L3A13_MASK   (0xffffffff << EMAC_MAC_LAYER3_ADDR1_REG3_L3A13_SHIFT)
#define EMAC_MAC_LAYER3_ADDR1_REG3_L3A13(n)     (((n) << EMAC_MAC_LAYER3_ADDR1_REG3_L3A13_SHIFT) & EMAC_MAC_LAYER3_ADDR1_REG3_L3A13_MASK)

/* MAC Layer 3 Address 2 Reg 3 (MAC_LAYER3_ADDR2_REG3) */
#define EMAC_MAC_LAYER3_ADDR2_REG3_L3A23_SHIFT  (0) /* Bits 0-32: Layer 3 Address 2 */
#define EMAC_MAC_LAYER3_ADDR2_REG3_L3A23_MASK   (0xffffffff << EMAC_MAC_LAYER3_ADDR2_REG3_L3A23_SHIFT)
#define EMAC_MAC_LAYER3_ADDR2_REG3_L3A23(n)     (((n) << EMAC_MAC_LAYER3_ADDR2_REG3_L3A23_SHIFT) & EMAC_MAC_LAYER3_ADDR2_REG3_L3A23_MASK)

/* MAC Layer 3 Address 3 Reg 3 (MAC_LAYER3_ADDR3_REG3) */
#define EMAC_MAC_LAYER3_ADDR3_REG3_L3A33_SHIFT  (0) /* Bits 0-32: Layer 3 Address 3 */
#define EMAC_MAC_LAYER3_ADDR3_REG3_L3A33_MASK   (0xffffffff << EMAC_MAC_LAYER3_ADDR3_REG3_L3A33_SHIFT)
#define EMAC_MAC_LAYER3_ADDR3_REG3_L3A33(n)     (((n) << EMAC_MAC_LAYER3_ADDR3_REG3_L3A33_SHIFT) & EMAC_MAC_LAYER3_ADDR3_REG3_L3A33_MASK)

/* MAC Timestamp Control (MAC_TIMESTAMP_CONTROL) */
#define EMAC_MAC_TIMESTAMP_CONTROL_TSENA             (1 << 0)  /* Bit 0: Timestamp Enable */
#define EMAC_MAC_TIMESTAMP_CONTROL_TSCFUPDT          (1 << 1)  /* Bit 1: Fine Or Coarse Timestamp Update */
#define EMAC_MAC_TIMESTAMP_CONTROL_TSINIT            (1 << 2)  /* Bit 2: Initialize Timestamp */
#define EMAC_MAC_TIMESTAMP_CONTROL_TSUPDT            (1 << 3)  /* Bit 3: Update Timestamp */
#define EMAC_MAC_TIMESTAMP_CONTROL_TSADDREG          (1 << 5)  /* Bit 5: Update Addend Register */
#define EMAC_MAC_TIMESTAMP_CONTROL_PTGE              (1 << 6)  /* Bit 6: Presentation Time Generation Enable */
#define EMAC_MAC_TIMESTAMP_CONTROL_TSENALL           (1 << 8)  /* Bit 8: Enable Timestamp For All Packets */
#define EMAC_MAC_TIMESTAMP_CONTROL_TSCTRLSSR         (1 << 9)  /* Bit 9: Timestamp Digital Or Binary Rollover Control */
#define EMAC_MAC_TIMESTAMP_CONTROL_TSVER2ENA         (1 << 10) /* Bit 10: Enable PTP Packet Processing For Version 2 Format */
#define EMAC_MAC_TIMESTAMP_CONTROL_TSIPENA           (1 << 11) /* Bit 11: Enable Processing Of PTP Over Ethernet Packets */
#define EMAC_MAC_TIMESTAMP_CONTROL_TSIPV6ENA         (1 << 12) /* Bit 12: Enable Processing Of PTP Packets Sent Over IPv6-UDP */
#define EMAC_MAC_TIMESTAMP_CONTROL_TSIPV4ENA         (1 << 13) /* Bit 13: Enable Processing Of PTP Packets Sent Over IPv4-UDP */
#define EMAC_MAC_TIMESTAMP_CONTROL_TSEVNTENA         (1 << 14) /* Bit 14: Enable Timestamp Snapshot For Event Messages */
#define EMAC_MAC_TIMESTAMP_CONTROL_TSMSTRENA         (1 << 15) /* Bit 15: Enable Snapshot For Messages Relevant To Master */
#define EMAC_MAC_TIMESTAMP_CONTROL_SNAPTYPSEL_SHIFT  (16)      /* Bits 16-18: Select PTP Packets For Taking Snapshots */
#define EMAC_MAC_TIMESTAMP_CONTROL_SNAPTYPSEL_MASK   (0x3 << EMAC_MAC_TIMESTAMP_CONTROL_SNAPTYPSEL_SHIFT)
#define EMAC_MAC_TIMESTAMP_CONTROL_SNAPTYPSEL(n)     (((n) << EMAC_MAC_TIMESTAMP_CONTROL_SNAPTYPSEL_SHIFT) & EMAC_MAC_TIMESTAMP_CONTROL_SNAPTYPSEL_MASK)
#define EMAC_MAC_TIMESTAMP_CONTROL_TSENMACADDR       (1 << 18) /* Bit 18: Enable MAC Address For PTP Packet Filtering */
#define EMAC_MAC_TIMESTAMP_CONTROL_ESTI              (1 << 20) /* Bit 20: External System Time Input */
#define EMAC_MAC_TIMESTAMP_CONTROL_TXTSSTSM          (1 << 24) /* Bit 24: Transmit Timestamp Status Mode */
#define EMAC_MAC_TIMESTAMP_CONTROL_AV8021ASMEN       (1 << 28) /* Bit 28: AV 802.1AS Mode Enable */

/* MAC Sub Second Increment (MAC_SUB_SECOND_INCREMENT) */
#define EMAC_MAC_SUB_SECOND_INCREMENT_SNSINC_SHIFT  (8) /* Bits 8-16: Sub-Nanosecond Increment Value */
#define EMAC_MAC_SUB_SECOND_INCREMENT_SNSINC_MASK   (0xff << EMAC_MAC_SUB_SECOND_INCREMENT_SNSINC_SHIFT)
#define EMAC_MAC_SUB_SECOND_INCREMENT_SNSINC(n)     (((n) << EMAC_MAC_SUB_SECOND_INCREMENT_SNSINC_SHIFT) & EMAC_MAC_SUB_SECOND_INCREMENT_SNSINC_MASK)
#define EMAC_MAC_SUB_SECOND_INCREMENT_SSINC_SHIFT   (16) /* Bits 16-24: Sub-Second Increment Value */
#define EMAC_MAC_SUB_SECOND_INCREMENT_SSINC_MASK    (0xff << EMAC_MAC_SUB_SECOND_INCREMENT_SSINC_SHIFT)
#define EMAC_MAC_SUB_SECOND_INCREMENT_SSINC(n)      (((n) << EMAC_MAC_SUB_SECOND_INCREMENT_SSINC_SHIFT) & EMAC_MAC_SUB_SECOND_INCREMENT_SSINC_MASK)

/* MAC System Time In Seconds (MAC_SYSTEM_TIME_SECONDS) */
#define EMAC_MAC_SYSTEM_TIME_SECONDS_TSS_SHIFT  (0) /* Bits 0-32: Timestamp Second */
#define EMAC_MAC_SYSTEM_TIME_SECONDS_TSS_MASK   (0xffffffff << EMAC_MAC_SYSTEM_TIME_SECONDS_TSS_SHIFT)
#define EMAC_MAC_SYSTEM_TIME_SECONDS_TSS(n)     (((n) << EMAC_MAC_SYSTEM_TIME_SECONDS_TSS_SHIFT) & EMAC_MAC_SYSTEM_TIME_SECONDS_TSS_MASK)

/* MAC System Time In Nanoseconds (MAC_SYSTEM_TIME_NANOSECONDS) */
#define EMAC_MAC_SYSTEM_TIME_NANOSECONDS_TSSS_SHIFT  (0) /* Bits 0-31: Timestamp Sub Seconds */
#define EMAC_MAC_SYSTEM_TIME_NANOSECONDS_TSSS_MASK   (0x7fffffff << EMAC_MAC_SYSTEM_TIME_NANOSECONDS_TSSS_SHIFT)
#define EMAC_MAC_SYSTEM_TIME_NANOSECONDS_TSSS(n)     (((n) << EMAC_MAC_SYSTEM_TIME_NANOSECONDS_TSSS_SHIFT) & EMAC_MAC_SYSTEM_TIME_NANOSECONDS_TSSS_MASK)

/* MAC System Time Seconds Update (MAC_SYSTEM_TIME_SECONDS_UPDATE) */
#define EMAC_MAC_SYSTEM_TIME_SECONDS_UPDATE_TSS_SHIFT  (0) /* Bits 0-32: Timestamp Seconds */
#define EMAC_MAC_SYSTEM_TIME_SECONDS_UPDATE_TSS_MASK   (0xffffffff << EMAC_MAC_SYSTEM_TIME_SECONDS_UPDATE_TSS_SHIFT)
#define EMAC_MAC_SYSTEM_TIME_SECONDS_UPDATE_TSS(n)     (((n) << EMAC_MAC_SYSTEM_TIME_SECONDS_UPDATE_TSS_SHIFT) & EMAC_MAC_SYSTEM_TIME_SECONDS_UPDATE_TSS_MASK)

/* MAC System Time Nanoseconds Update (MAC_SYSTEM_TIME_NANOSECONDS_UPDATE) */
#define EMAC_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_TSSS_SHIFT  (0) /* Bits 0-31: Timestamp Subseconds */
#define EMAC_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_TSSS_MASK   (0x7fffffff << EMAC_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_TSSS_SHIFT)
#define EMAC_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_TSSS(n)     (((n) << EMAC_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_TSSS_SHIFT) & EMAC_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_TSSS_MASK)
#define EMAC_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_ADDSUB      (1 << 31) /* Bit 31: Add Or Subtract Time */

/* MAC Timestamp Addend (MAC_TIMESTAMP_ADDEND) */
#define EMAC_MAC_TIMESTAMP_ADDEND_TSAR_SHIFT  (0) /* Bits 0-32: Timestamp Addend Register */
#define EMAC_MAC_TIMESTAMP_ADDEND_TSAR_MASK   (0xffffffff << EMAC_MAC_TIMESTAMP_ADDEND_TSAR_SHIFT)
#define EMAC_MAC_TIMESTAMP_ADDEND_TSAR(n)     (((n) << EMAC_MAC_TIMESTAMP_ADDEND_TSAR_SHIFT) & EMAC_MAC_TIMESTAMP_ADDEND_TSAR_MASK)

/* MAC System Time Higher Word In Seconds
 * (MAC_SYSTEM_TIME_HIGHER_WORD_SECONDS)
 */

#define EMAC_MAC_SYSTEM_TIME_HIGHER_WORD_SECONDS_TSHWR_SHIFT  (0) /* Bits 0-16: Timestamp Higher Word Register */
#define EMAC_MAC_SYSTEM_TIME_HIGHER_WORD_SECONDS_TSHWR_MASK   (0xffff << EMAC_MAC_SYSTEM_TIME_HIGHER_WORD_SECONDS_TSHWR_SHIFT)
#define EMAC_MAC_SYSTEM_TIME_HIGHER_WORD_SECONDS_TSHWR(n)     (((n) << EMAC_MAC_SYSTEM_TIME_HIGHER_WORD_SECONDS_TSHWR_SHIFT) & EMAC_MAC_SYSTEM_TIME_HIGHER_WORD_SECONDS_TSHWR_MASK)

