apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_emac.h
/* MAC Timestamp Status (MAC_TIMESTAMP_STATUS) */
#define EMAC_MAC_TIMESTAMP_STATUS_TSSOVF      (1 << 0)  /* Bit 0: Timestamp Seconds Overflow */
#define EMAC_MAC_TIMESTAMP_STATUS_TSTARGT0    (1 << 1)  /* Bit 1: Timestamp Target Time Reached */
#define EMAC_MAC_TIMESTAMP_STATUS_TSTRGTERR0  (1 << 3)  /* Bit 3: Timestamp Target Time Error */
#define EMAC_MAC_TIMESTAMP_STATUS_TSTARGT1    (1 << 4)  /* Bit 4: Timestamp Target Time Reached For Target Time PPS1 */
#define EMAC_MAC_TIMESTAMP_STATUS_TSTRGTERR1  (1 << 5)  /* Bit 5: Timestamp Target Time Error */
#define EMAC_MAC_TIMESTAMP_STATUS_TSTARGT2    (1 << 6)  /* Bit 6: Timestamp Target Time Reached For Target Time PPS2 */
#define EMAC_MAC_TIMESTAMP_STATUS_TSTRGTERR2  (1 << 7)  /* Bit 7: Timestamp Target Time Error */
#define EMAC_MAC_TIMESTAMP_STATUS_TSTARGT3    (1 << 8)  /* Bit 8: Timestamp Target Time Reached For Target Time PPS3 */
#define EMAC_MAC_TIMESTAMP_STATUS_TSTRGTERR3  (1 << 9)  /* Bit 9: Timestamp Target Time Error */
#define EMAC_MAC_TIMESTAMP_STATUS_TXTSSIS     (1 << 15) /* Bit 15: Transmit Timestamp Status Interrupt Status */

/* MAC Transmit Timestamp Status In Nanoseconds
 * (MAC_TX_TIMESTAMP_STATUS_NANOSECONDS)
 */

#define EMAC_MAC_TX_TIMESTAMP_STATUS_NANOSECONDS_TXTSSLO_SHIFT  (0) /* Bits 0-31: Transmit Timestamp Status Low */
#define EMAC_MAC_TX_TIMESTAMP_STATUS_NANOSECONDS_TXTSSLO_MASK   (0x7fffffff << EMAC_MAC_TX_TIMESTAMP_STATUS_NANOSECONDS_TXTSSLO_SHIFT)
#define EMAC_MAC_TX_TIMESTAMP_STATUS_NANOSECONDS_TXTSSLO(n)     (((n) << EMAC_MAC_TX_TIMESTAMP_STATUS_NANOSECONDS_TXTSSLO_SHIFT) & EMAC_MAC_TX_TIMESTAMP_STATUS_NANOSECONDS_TXTSSLO_MASK)
#define EMAC_MAC_TX_TIMESTAMP_STATUS_NANOSECONDS_TXTSSMIS       (1 << 31) /* Bit 31: Transmit Timestamp Status Missed */

/* MAC Transmit Timestamp Status In Seconds
 * (MAC_TX_TIMESTAMP_STATUS_SECONDS)
 */

#define EMAC_MAC_TX_TIMESTAMP_STATUS_SECONDS_TXTSSHI_SHIFT  (0) /* Bits 0-32: Transmit Timestamp Status High */
#define EMAC_MAC_TX_TIMESTAMP_STATUS_SECONDS_TXTSSHI_MASK   (0xffffffff << EMAC_MAC_TX_TIMESTAMP_STATUS_SECONDS_TXTSSHI_SHIFT)
#define EMAC_MAC_TX_TIMESTAMP_STATUS_SECONDS_TXTSSHI(n)     (((n) << EMAC_MAC_TX_TIMESTAMP_STATUS_SECONDS_TXTSSHI_SHIFT) & EMAC_MAC_TX_TIMESTAMP_STATUS_SECONDS_TXTSSHI_MASK)

/* MAC Timestamp Ingress Asymmetry Correction
 * (MAC_TIMESTAMP_INGRESS_ASYM_CORR)
 */

#define EMAC_MAC_TIMESTAMP_INGRESS_ASYM_CORR_OSTIAC_SHIFT  (0) /* Bits 0-32: One-Step Timestamp Ingress Asymmetry Correction */
#define EMAC_MAC_TIMESTAMP_INGRESS_ASYM_CORR_OSTIAC_MASK   (0xffffffff << EMAC_MAC_TIMESTAMP_INGRESS_ASYM_CORR_OSTIAC_SHIFT)
#define EMAC_MAC_TIMESTAMP_INGRESS_ASYM_CORR_OSTIAC(n)     (((n) << EMAC_MAC_TIMESTAMP_INGRESS_ASYM_CORR_OSTIAC_SHIFT) & EMAC_MAC_TIMESTAMP_INGRESS_ASYM_CORR_OSTIAC_MASK)

/* MAC Timestamp Egress Asymmetry Correction
 * (MAC_TIMESTAMP_EGRESS_ASYM_CORR)
 */

#define EMAC_MAC_TIMESTAMP_EGRESS_ASYM_CORR_OSTEAC_SHIFT  (0) /* Bits 0-32: One-Step Timestamp Egress Asymmetry Correction */
#define EMAC_MAC_TIMESTAMP_EGRESS_ASYM_CORR_OSTEAC_MASK   (0xffffffff << EMAC_MAC_TIMESTAMP_EGRESS_ASYM_CORR_OSTEAC_SHIFT)
#define EMAC_MAC_TIMESTAMP_EGRESS_ASYM_CORR_OSTEAC(n)     (((n) << EMAC_MAC_TIMESTAMP_EGRESS_ASYM_CORR_OSTEAC_SHIFT) & EMAC_MAC_TIMESTAMP_EGRESS_ASYM_CORR_OSTEAC_MASK)

/* MAC Timestamp Ingress Correction In Nanoseconds
 * (MAC_TIMESTAMP_INGRESS_CORR_NANOSECOND)
 */

#define EMAC_MAC_TIMESTAMP_INGRESS_CORR_NANOSECOND_TSIC_SHIFT  (0) /* Bits 0-32: Timestamp Ingress Correction */
#define EMAC_MAC_TIMESTAMP_INGRESS_CORR_NANOSECOND_TSIC_MASK   (0xffffffff << EMAC_MAC_TIMESTAMP_INGRESS_CORR_NANOSECOND_TSIC_SHIFT)
#define EMAC_MAC_TIMESTAMP_INGRESS_CORR_NANOSECOND_TSIC(n)     (((n) << EMAC_MAC_TIMESTAMP_INGRESS_CORR_NANOSECOND_TSIC_SHIFT) & EMAC_MAC_TIMESTAMP_INGRESS_CORR_NANOSECOND_TSIC_MASK)

/* MAC Timestamp Egress Correction In Nanoseconds
 * (MAC_TIMESTAMP_EGRESS_CORR_NANOSECOND)
 */

#define EMAC_MAC_TIMESTAMP_EGRESS_CORR_NANOSECOND_TSEC_SHIFT  (0) /* Bits 0-32: Timestamp Egress Correction */
#define EMAC_MAC_TIMESTAMP_EGRESS_CORR_NANOSECOND_TSEC_MASK   (0xffffffff << EMAC_MAC_TIMESTAMP_EGRESS_CORR_NANOSECOND_TSEC_SHIFT)
#define EMAC_MAC_TIMESTAMP_EGRESS_CORR_NANOSECOND_TSEC(n)     (((n) << EMAC_MAC_TIMESTAMP_EGRESS_CORR_NANOSECOND_TSEC_SHIFT) & EMAC_MAC_TIMESTAMP_EGRESS_CORR_NANOSECOND_TSEC_MASK)

/* MAC Timestamp Ingress Correction In Subnanoseconds
 * (MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC)
 */

#define EMAC_MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC_TSICSNS_SHIFT  (8) /* Bits 8-16: Timestamp Ingress Correction In Sub-Nanoseconds */
#define EMAC_MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC_TSICSNS_MASK   (0xff << EMAC_MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC_TSICSNS_SHIFT)
#define EMAC_MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC_TSICSNS(n)     (((n) << EMAC_MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC_TSICSNS_SHIFT) & EMAC_MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC_TSICSNS_MASK)

/* MAC Timestamp Engress Correction In Subnanoseconds
 * (MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC)
 */

#define EMAC_MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC_TSECSNS_SHIFT  (8) /* Bits 8-16: Timestamp Egress Correction In Sub-Nanoseconds */
#define EMAC_MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC_TSECSNS_MASK   (0xff << EMAC_MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC_TSECSNS_SHIFT)
#define EMAC_MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC_TSECSNS(n)     (((n) << EMAC_MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC_TSECSNS_SHIFT) & EMAC_MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC_TSECSNS_MASK)

/* MAC Timestamp Ingress Latency (MAC_TIMESTAMP_INGRESS_LATENCY) */
#define EMAC_MAC_TIMESTAMP_INGRESS_LATENCY_ITLSNS_SHIFT  (8) /* Bits 8-16: Ingress Timestamp Latency In Nanoseconds */
#define EMAC_MAC_TIMESTAMP_INGRESS_LATENCY_ITLSNS_MASK   (0xff << EMAC_MAC_TIMESTAMP_INGRESS_LATENCY_ITLSNS_SHIFT)
#define EMAC_MAC_TIMESTAMP_INGRESS_LATENCY_ITLSNS(n)     (((n) << EMAC_MAC_TIMESTAMP_INGRESS_LATENCY_ITLSNS_SHIFT) & EMAC_MAC_TIMESTAMP_INGRESS_LATENCY_ITLSNS_MASK)
#define EMAC_MAC_TIMESTAMP_INGRESS_LATENCY_ITLNS_SHIFT   (16) /* Bits 16-28: Ingress Timestamp Latency In Sub-Nanoseconds */
#define EMAC_MAC_TIMESTAMP_INGRESS_LATENCY_ITLNS_MASK    (0xfff << EMAC_MAC_TIMESTAMP_INGRESS_LATENCY_ITLNS_SHIFT)
#define EMAC_MAC_TIMESTAMP_INGRESS_LATENCY_ITLNS(n)      (((n) << EMAC_MAC_TIMESTAMP_INGRESS_LATENCY_ITLNS_SHIFT) & EMAC_MAC_TIMESTAMP_INGRESS_LATENCY_ITLNS_MASK)

/* MAC Timestamp Egress Latecy (MAC_TIMESTAMP_EGRESS_LATENCY) */
#define EMAC_MAC_TIMESTAMP_EGRESS_LATENCY_ETLSNS_SHIFT  (8) /* Bits 8-16: Egress Timestamp Latency In Sub-Nanoseconds */
#define EMAC_MAC_TIMESTAMP_EGRESS_LATENCY_ETLSNS_MASK   (0xff << EMAC_MAC_TIMESTAMP_EGRESS_LATENCY_ETLSNS_SHIFT)
#define EMAC_MAC_TIMESTAMP_EGRESS_LATENCY_ETLSNS(n)     (((n) << EMAC_MAC_TIMESTAMP_EGRESS_LATENCY_ETLSNS_SHIFT) & EMAC_MAC_TIMESTAMP_EGRESS_LATENCY_ETLSNS_MASK)
#define EMAC_MAC_TIMESTAMP_EGRESS_LATENCY_ETLNS_SHIFT   (16) /* Bits 16-28: Egress Timestamp Latency In Nanoseconds */
#define EMAC_MAC_TIMESTAMP_EGRESS_LATENCY_ETLNS_MASK    (0xfff << EMAC_MAC_TIMESTAMP_EGRESS_LATENCY_ETLNS_SHIFT)
#define EMAC_MAC_TIMESTAMP_EGRESS_LATENCY_ETLNS(n)      (((n) << EMAC_MAC_TIMESTAMP_EGRESS_LATENCY_ETLNS_SHIFT) & EMAC_MAC_TIMESTAMP_EGRESS_LATENCY_ETLNS_MASK)

/* MAC PPS Control (MAC_PPS_CONTROL) */
#define EMAC_MAC_PPS_CONTROL_PPSCTRL_PPSCMD_SHIFT  (0) /* Bits 0-4: PPS Output Frequency Control */
#define EMAC_MAC_PPS_CONTROL_PPSCTRL_PPSCMD_MASK   (0xf << EMAC_MAC_PPS_CONTROL_PPSCTRL_PPSCMD_SHIFT)
#define EMAC_MAC_PPS_CONTROL_PPSCTRL_PPSCMD(n)     (((n) << EMAC_MAC_PPS_CONTROL_PPSCTRL_PPSCMD_SHIFT) & EMAC_MAC_PPS_CONTROL_PPSCTRL_PPSCMD_MASK)
#define EMAC_MAC_PPS_CONTROL_PPSEN0                (1 << 4) /* Bit 4: Flexible PPS Output Mode Enable 0 */
#define EMAC_MAC_PPS_CONTROL_TRGTMODSEL0_SHIFT     (5)      /* Bits 5-7: Target Time Register Mode For PPS0 Output */
#define EMAC_MAC_PPS_CONTROL_TRGTMODSEL0_MASK      (0x3 << EMAC_MAC_PPS_CONTROL_TRGTMODSEL0_SHIFT)
#define EMAC_MAC_PPS_CONTROL_TRGTMODSEL0(n)        (((n) << EMAC_MAC_PPS_CONTROL_TRGTMODSEL0_SHIFT) & EMAC_MAC_PPS_CONTROL_TRGTMODSEL0_MASK)
#define EMAC_MAC_PPS_CONTROL_MCGREN0               (1 << 7) /* Bit 7: MCGR Mode Enable For PPS0 Output */
#define EMAC_MAC_PPS_CONTROL_PPSCMD1_SHIFT         (8)      /* Bits 8-12: Flexible PPS1 Output Control */
#define EMAC_MAC_PPS_CONTROL_PPSCMD1_MASK          (0xf << EMAC_MAC_PPS_CONTROL_PPSCMD1_SHIFT)
#define EMAC_MAC_PPS_CONTROL_PPSCMD1(n)            (((n) << EMAC_MAC_PPS_CONTROL_PPSCMD1_SHIFT) & EMAC_MAC_PPS_CONTROL_PPSCMD1_MASK)
#define EMAC_MAC_PPS_CONTROL_TRGTMODSEL1_SHIFT     (13) /* Bits 13-15: Target Time Register Mode For PPS1 Output */
#define EMAC_MAC_PPS_CONTROL_TRGTMODSEL1_MASK      (0x3 << EMAC_MAC_PPS_CONTROL_TRGTMODSEL1_SHIFT)
#define EMAC_MAC_PPS_CONTROL_TRGTMODSEL1(n)        (((n) << EMAC_MAC_PPS_CONTROL_TRGTMODSEL1_SHIFT) & EMAC_MAC_PPS_CONTROL_TRGTMODSEL1_MASK)
#define EMAC_MAC_PPS_CONTROL_MCGREN1               (1 << 15) /* Bit 15: MCGR Mode Enable For PPS1 Output */
#define EMAC_MAC_PPS_CONTROL_PPSCMD2_SHIFT         (16)      /* Bits 16-20: Flexible PPS2 Output Control */
#define EMAC_MAC_PPS_CONTROL_PPSCMD2_MASK          (0xf << EMAC_MAC_PPS_CONTROL_PPSCMD2_SHIFT)
#define EMAC_MAC_PPS_CONTROL_PPSCMD2(n)            (((n) << EMAC_MAC_PPS_CONTROL_PPSCMD2_SHIFT) & EMAC_MAC_PPS_CONTROL_PPSCMD2_MASK)
#define EMAC_MAC_PPS_CONTROL_TRGTMODSEL2_SHIFT     (21) /* Bits 21-23: Target Time Register Mode For PPS2 Output */
#define EMAC_MAC_PPS_CONTROL_TRGTMODSEL2_MASK      (0x3 << EMAC_MAC_PPS_CONTROL_TRGTMODSEL2_SHIFT)
#define EMAC_MAC_PPS_CONTROL_TRGTMODSEL2(n)        (((n) << EMAC_MAC_PPS_CONTROL_TRGTMODSEL2_SHIFT) & EMAC_MAC_PPS_CONTROL_TRGTMODSEL2_MASK)
#define EMAC_MAC_PPS_CONTROL_MCGREN2               (1 << 23) /* Bit 23: MCGR Mode Enable For PPS2 Output */
#define EMAC_MAC_PPS_CONTROL_PPSCMD3_SHIFT         (24)      /* Bits 24-28: Flexible PPS3 Output Control */
#define EMAC_MAC_PPS_CONTROL_PPSCMD3_MASK          (0xf << EMAC_MAC_PPS_CONTROL_PPSCMD3_SHIFT)
#define EMAC_MAC_PPS_CONTROL_PPSCMD3(n)            (((n) << EMAC_MAC_PPS_CONTROL_PPSCMD3_SHIFT) & EMAC_MAC_PPS_CONTROL_PPSCMD3_MASK)
#define EMAC_MAC_PPS_CONTROL_TRGTMODSEL3_SHIFT     (29) /* Bits 29-31: Target Time Register Mode For PPS3 Output */
#define EMAC_MAC_PPS_CONTROL_TRGTMODSEL3_MASK      (0x3 << EMAC_MAC_PPS_CONTROL_TRGTMODSEL3_SHIFT)
#define EMAC_MAC_PPS_CONTROL_TRGTMODSEL3(n)        (((n) << EMAC_MAC_PPS_CONTROL_TRGTMODSEL3_SHIFT) & EMAC_MAC_PPS_CONTROL_TRGTMODSEL3_MASK)
#define EMAC_MAC_PPS_CONTROL_MCGREN3               (1 << 31) /* Bit 31: MCGR Mode Enable For PPS3 Output */

