apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_emac.h
/* MAC PPS0 Target Time In Seconds (MAC_PPS0_TARGET_TIME_SECONDS) */
#define EMAC_MAC_PPS0_TARGET_TIME_SECONDS_TSTRH0_SHIFT  (0) /* Bits 0-32: PPS Target Time In Seconds Register */
#define EMAC_MAC_PPS0_TARGET_TIME_SECONDS_TSTRH0_MASK   (0xffffffff << EMAC_MAC_PPS0_TARGET_TIME_SECONDS_TSTRH0_SHIFT)
#define EMAC_MAC_PPS0_TARGET_TIME_SECONDS_TSTRH0(n)     (((n) << EMAC_MAC_PPS0_TARGET_TIME_SECONDS_TSTRH0_SHIFT) & EMAC_MAC_PPS0_TARGET_TIME_SECONDS_TSTRH0_MASK)

/* MAC PPS0 Target Time In Nanoseconds (MAC_PPS0_TARGET_TIME_NANOSECONDS) */
#define EMAC_MAC_PPS0_TARGET_TIME_NANOSECONDS_TTSL0_SHIFT  (0) /* Bits 0-31: Target Time Low For PPS0 */
#define EMAC_MAC_PPS0_TARGET_TIME_NANOSECONDS_TTSL0_MASK   (0x7fffffff << EMAC_MAC_PPS0_TARGET_TIME_NANOSECONDS_TTSL0_SHIFT)
#define EMAC_MAC_PPS0_TARGET_TIME_NANOSECONDS_TTSL0(n)     (((n) << EMAC_MAC_PPS0_TARGET_TIME_NANOSECONDS_TTSL0_SHIFT) & EMAC_MAC_PPS0_TARGET_TIME_NANOSECONDS_TTSL0_MASK)
#define EMAC_MAC_PPS0_TARGET_TIME_NANOSECONDS_TRGTBUSY0    (1 << 31) /* Bit 31: PPS Target Time Busy Status 0 */

/* MAC PPS0 Interval (MAC_PPS0_INTERVAL) */
#define EMAC_MAC_PPS0_INTERVAL_PPSINT0_SHIFT  (0) /* Bits 0-32: PPS Output Signal Interval 0 */
#define EMAC_MAC_PPS0_INTERVAL_PPSINT0_MASK   (0xffffffff << EMAC_MAC_PPS0_INTERVAL_PPSINT0_SHIFT)
#define EMAC_MAC_PPS0_INTERVAL_PPSINT0(n)     (((n) << EMAC_MAC_PPS0_INTERVAL_PPSINT0_SHIFT) & EMAC_MAC_PPS0_INTERVAL_PPSINT0_MASK)

/* MAC PPS0 Width (MAC_PPS0_WIDTH) */
#define EMAC_MAC_PPS0_WIDTH_PPSWIDTH0_SHIFT  (0) /* Bits 0-32: PPS Output Signal Width 0 */
#define EMAC_MAC_PPS0_WIDTH_PPSWIDTH0_MASK   (0xffffffff << EMAC_MAC_PPS0_WIDTH_PPSWIDTH0_SHIFT)
#define EMAC_MAC_PPS0_WIDTH_PPSWIDTH0(n)     (((n) << EMAC_MAC_PPS0_WIDTH_PPSWIDTH0_SHIFT) & EMAC_MAC_PPS0_WIDTH_PPSWIDTH0_MASK)

/* MAC PPS1 Target Time In Seconds (MAC_PPS1_TARGET_TIME_SECONDS) */
#define EMAC_MAC_PPS1_TARGET_TIME_SECONDS_TSTRH1_SHIFT  (0) /* Bits 0-32: PPS Target Time In Seconds 1 */
#define EMAC_MAC_PPS1_TARGET_TIME_SECONDS_TSTRH1_MASK   (0xffffffff << EMAC_MAC_PPS1_TARGET_TIME_SECONDS_TSTRH1_SHIFT)
#define EMAC_MAC_PPS1_TARGET_TIME_SECONDS_TSTRH1(n)     (((n) << EMAC_MAC_PPS1_TARGET_TIME_SECONDS_TSTRH1_SHIFT) & EMAC_MAC_PPS1_TARGET_TIME_SECONDS_TSTRH1_MASK)

/* MAC PPS1 Target Time In Nanoseconds (MAC_PPS1_TARGET_TIME_NANOSECONDS) */
#define EMAC_MAC_PPS1_TARGET_TIME_NANOSECONDS_TTSL1_SHIFT  (0) /* Bits 0-31: Target Time Low For PPS1 */
#define EMAC_MAC_PPS1_TARGET_TIME_NANOSECONDS_TTSL1_MASK   (0x7fffffff << EMAC_MAC_PPS1_TARGET_TIME_NANOSECONDS_TTSL1_SHIFT)
#define EMAC_MAC_PPS1_TARGET_TIME_NANOSECONDS_TTSL1(n)     (((n) << EMAC_MAC_PPS1_TARGET_TIME_NANOSECONDS_TTSL1_SHIFT) & EMAC_MAC_PPS1_TARGET_TIME_NANOSECONDS_TTSL1_MASK)
#define EMAC_MAC_PPS1_TARGET_TIME_NANOSECONDS_TRGTBUSY1    (1 << 31) /* Bit 31: PPS Target Time Busy Status 1 */

/* MAC PPS1 Interval (MAC_PPS1_INTERVAL) */
#define EMAC_MAC_PPS1_INTERVAL_PPSINT1_SHIFT  (0) /* Bits 0-32: PPS Output Signal Interval 1 */
#define EMAC_MAC_PPS1_INTERVAL_PPSINT1_MASK   (0xffffffff << EMAC_MAC_PPS1_INTERVAL_PPSINT1_SHIFT)
#define EMAC_MAC_PPS1_INTERVAL_PPSINT1(n)     (((n) << EMAC_MAC_PPS1_INTERVAL_PPSINT1_SHIFT) & EMAC_MAC_PPS1_INTERVAL_PPSINT1_MASK)

/* MAC PPS1 Width (MAC_PPS1_WIDTH) */
#define EMAC_MAC_PPS1_WIDTH_PPSWIDTH1_SHIFT  (0) /* Bits 0-32: PPS Output Signal Width 1 */
#define EMAC_MAC_PPS1_WIDTH_PPSWIDTH1_MASK   (0xffffffff << EMAC_MAC_PPS1_WIDTH_PPSWIDTH1_SHIFT)
#define EMAC_MAC_PPS1_WIDTH_PPSWIDTH1(n)     (((n) << EMAC_MAC_PPS1_WIDTH_PPSWIDTH1_SHIFT) & EMAC_MAC_PPS1_WIDTH_PPSWIDTH1_MASK)

/* MAC PPS2 Target Time In Seconds (MAC_PPS2_TARGET_TIME_SECONDS) */
#define EMAC_MAC_PPS2_TARGET_TIME_SECONDS_TSTRH2_SHIFT  (0) /* Bits 0-32: PPS Target Time In Seconds 2 */
#define EMAC_MAC_PPS2_TARGET_TIME_SECONDS_TSTRH2_MASK   (0xffffffff << EMAC_MAC_PPS2_TARGET_TIME_SECONDS_TSTRH2_SHIFT)
#define EMAC_MAC_PPS2_TARGET_TIME_SECONDS_TSTRH2(n)     (((n) << EMAC_MAC_PPS2_TARGET_TIME_SECONDS_TSTRH2_SHIFT) & EMAC_MAC_PPS2_TARGET_TIME_SECONDS_TSTRH2_MASK)

/* MAC PPS2 Target Time In Nanoseconds (MAC_PPS2_TARGET_TIME_NANOSECONDS) */
#define EMAC_MAC_PPS2_TARGET_TIME_NANOSECONDS_TTSL2_SHIFT  (0) /* Bits 0-31: Target Time Low For PPS2 */
#define EMAC_MAC_PPS2_TARGET_TIME_NANOSECONDS_TTSL2_MASK   (0x7fffffff << EMAC_MAC_PPS2_TARGET_TIME_NANOSECONDS_TTSL2_SHIFT)
#define EMAC_MAC_PPS2_TARGET_TIME_NANOSECONDS_TTSL2(n)     (((n) << EMAC_MAC_PPS2_TARGET_TIME_NANOSECONDS_TTSL2_SHIFT) & EMAC_MAC_PPS2_TARGET_TIME_NANOSECONDS_TTSL2_MASK)
#define EMAC_MAC_PPS2_TARGET_TIME_NANOSECONDS_TRGTBUSY2    (1 << 31) /* Bit 31: PPS Target Time Busy Status 2 */

/* MAC PPS2 Interval (MAC_PPS2_INTERVAL) */
#define EMAC_MAC_PPS2_INTERVAL_PPSINT2_SHIFT  (0) /* Bits 0-32: PPS Output Signal Interval 2 */
#define EMAC_MAC_PPS2_INTERVAL_PPSINT2_MASK   (0xffffffff << EMAC_MAC_PPS2_INTERVAL_PPSINT2_SHIFT)
#define EMAC_MAC_PPS2_INTERVAL_PPSINT2(n)     (((n) << EMAC_MAC_PPS2_INTERVAL_PPSINT2_SHIFT) & EMAC_MAC_PPS2_INTERVAL_PPSINT2_MASK)

/* MAC PPS2 Width (MAC_PPS2_WIDTH) */
#define EMAC_MAC_PPS2_WIDTH_PPSWIDTH2_SHIFT  (0) /* Bits 0-32: PPS Output Signal Width 2 */
#define EMAC_MAC_PPS2_WIDTH_PPSWIDTH2_MASK   (0xffffffff << EMAC_MAC_PPS2_WIDTH_PPSWIDTH2_SHIFT)
#define EMAC_MAC_PPS2_WIDTH_PPSWIDTH2(n)     (((n) << EMAC_MAC_PPS2_WIDTH_PPSWIDTH2_SHIFT) & EMAC_MAC_PPS2_WIDTH_PPSWIDTH2_MASK)

/* MAC PPS3 Target Time In Seconds (MAC_PPS3_TARGET_TIME_SECONDS) */
#define EMAC_MAC_PPS3_TARGET_TIME_SECONDS_TSTRH3_SHIFT  (0) /* Bits 0-32: PPS Target Time In Seconds 3 */
#define EMAC_MAC_PPS3_TARGET_TIME_SECONDS_TSTRH3_MASK   (0xffffffff << EMAC_MAC_PPS3_TARGET_TIME_SECONDS_TSTRH3_SHIFT)
#define EMAC_MAC_PPS3_TARGET_TIME_SECONDS_TSTRH3(n)     (((n) << EMAC_MAC_PPS3_TARGET_TIME_SECONDS_TSTRH3_SHIFT) & EMAC_MAC_PPS3_TARGET_TIME_SECONDS_TSTRH3_MASK)

/* MAC PPS3 Target Time In Nanoseconds (MAC_PPS3_TARGET_TIME_NANOSECONDS) */
#define EMAC_MAC_PPS3_TARGET_TIME_NANOSECONDS_TTSL3_SHIFT  (0) /* Bits 0-31: Target Time Low For PPS3 */
#define EMAC_MAC_PPS3_TARGET_TIME_NANOSECONDS_TTSL3_MASK   (0x7fffffff << EMAC_MAC_PPS3_TARGET_TIME_NANOSECONDS_TTSL3_SHIFT)
#define EMAC_MAC_PPS3_TARGET_TIME_NANOSECONDS_TTSL3(n)     (((n) << EMAC_MAC_PPS3_TARGET_TIME_NANOSECONDS_TTSL3_SHIFT) & EMAC_MAC_PPS3_TARGET_TIME_NANOSECONDS_TTSL3_MASK)
#define EMAC_MAC_PPS3_TARGET_TIME_NANOSECONDS_TRGTBUSY3    (1 << 31) /* Bit 31: PPS Target Time Register Busy 3 */

/* MAC PPS3 Interval (MAC_PPS3_INTERVAL) */
#define EMAC_MAC_PPS3_INTERVAL_PPSINT3_SHIFT  (0) /* Bits 0-32: PPS Output Signal Interval */
#define EMAC_MAC_PPS3_INTERVAL_PPSINT3_MASK   (0xffffffff << EMAC_MAC_PPS3_INTERVAL_PPSINT3_SHIFT)
#define EMAC_MAC_PPS3_INTERVAL_PPSINT3(n)     (((n) << EMAC_MAC_PPS3_INTERVAL_PPSINT3_SHIFT) & EMAC_MAC_PPS3_INTERVAL_PPSINT3_MASK)

