apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_emac.h
/* MAC PPS3 Width (MAC_PPS3_WIDTH) */
#define EMAC_MAC_PPS3_WIDTH_PPSWIDTH3_SHIFT  (0) /* Bits 0-32: PPS Output Signal Width 3 */
#define EMAC_MAC_PPS3_WIDTH_PPSWIDTH3_MASK   (0xffffffff << EMAC_MAC_PPS3_WIDTH_PPSWIDTH3_SHIFT)
#define EMAC_MAC_PPS3_WIDTH_PPSWIDTH3(n)     (((n) << EMAC_MAC_PPS3_WIDTH_PPSWIDTH3_SHIFT) & EMAC_MAC_PPS3_WIDTH_PPSWIDTH3_MASK)

/* MTL Operation Mode (MTL_OPERATION_MODE) */
#define EMAC_MTL_OPERATION_MODE_DTXSTS        (1 << 1) /* Bit 1: Drop Transmit Status */
#define EMAC_MTL_OPERATION_MODE_RAA           (1 << 2) /* Bit 2: Receive Arbitration Algorithm */
#define EMAC_MTL_OPERATION_MODE_SCHALG_SHIFT  (5)      /* Bits 5-7: Transmit Scheduling Algorithm */
#define EMAC_MTL_OPERATION_MODE_SCHALG_MASK   (0x3 << EMAC_MTL_OPERATION_MODE_SCHALG_SHIFT)
#define EMAC_MTL_OPERATION_MODE_SCHALG(n)     (((n) << EMAC_MTL_OPERATION_MODE_SCHALG_SHIFT) & EMAC_MTL_OPERATION_MODE_SCHALG_MASK)
#define EMAC_MTL_OPERATION_MODE_SCHALG_WRR    EMAC_MTL_OPERATION_MODE_SCHALG(0x0)
#define EMAC_MTL_OPERATION_MODE_SCHALG_WFQ    EMAC_MTL_OPERATION_MODE_SCHALG(0x1)
#define EMAC_MTL_OPERATION_MODE_SCHALG_DWRR   EMAC_MTL_OPERATION_MODE_SCHALG(0x2)
#define EMAC_MTL_OPERATION_MODE_SCHALG_SP     EMAC_MTL_OPERATION_MODE_SCHALG(0x3)
#define EMAC_MTL_OPERATION_MODE_CNTPRST       (1 << 8)  /* Bit 8: Counters Preset */
#define EMAC_MTL_OPERATION_MODE_CNTCLR        (1 << 9)  /* Bit 9: Counters Reset */
#define EMAC_MTL_OPERATION_MODE_FRPE          (1 << 15) /* Bit 15: Flexible Receive Parser Enable */

/* MTL Debug Control (MTL_DBG_CTL) */
#define EMAC_MTL_DBG_CTL_FDBGEN          (1 << 0) /* Bit 0: FIFO Debug Access Enable */
#define EMAC_MTL_DBG_CTL_DBGMOD          (1 << 1) /* Bit 1: Debug Mode Access to FIFO */
#define EMAC_MTL_DBG_CTL_BYTEEN_SHIFT    (2)      /* Bits 2-4: Byte Enables */
#define EMAC_MTL_DBG_CTL_BYTEEN_MASK     (0x3 << EMAC_MTL_DBG_CTL_BYTEEN_SHIFT)
#define EMAC_MTL_DBG_CTL_BYTEEN(n)       (((n) << EMAC_MTL_DBG_CTL_BYTEEN_SHIFT) & EMAC_MTL_DBG_CTL_BYTEEN_MASK)
#define EMAC_MTL_DBG_CTL_PKTSTATE_SHIFT  (5) /* Bits 5-7: Encoded Packet State */
#define EMAC_MTL_DBG_CTL_PKTSTATE_MASK   (0x3 << EMAC_MTL_DBG_CTL_PKTSTATE_SHIFT)
#define EMAC_MTL_DBG_CTL_PKTSTATE(n)     (((n) << EMAC_MTL_DBG_CTL_PKTSTATE_SHIFT) & EMAC_MTL_DBG_CTL_PKTSTATE_MASK)
#define EMAC_MTL_DBG_CTL_RSTALL          (1 << 8)  /* Bit 8: Reset All Pointers */
#define EMAC_MTL_DBG_CTL_RSTSEL          (1 << 9)  /* Bit 9: Reset Pointers Of Selected FIFO */
#define EMAC_MTL_DBG_CTL_FIFORDEN        (1 << 10) /* Bit 10: FIFO Read Enable */
#define EMAC_MTL_DBG_CTL_FIFOWREN        (1 << 11) /* Bit 11: FIFO Write Enable */
#define EMAC_MTL_DBG_CTL_FIFOSEL_SHIFT   (12)      /* Bits 12-14: FIFO Selected for Access */
#define EMAC_MTL_DBG_CTL_FIFOSEL_MASK    (0x3 << EMAC_MTL_DBG_CTL_FIFOSEL_SHIFT)
#define EMAC_MTL_DBG_CTL_FIFOSEL(n)      (((n) << EMAC_MTL_DBG_CTL_FIFOSEL_SHIFT) & EMAC_MTL_DBG_CTL_FIFOSEL_MASK)
#define EMAC_MTL_DBG_CTL_PKTIE           (1 << 14) /* Bit 14: Receive Packet Available Interrupt Status Enable */
#define EMAC_MTL_DBG_CTL_STSIE           (1 << 15) /* Bit 15: Transmit Status Available Interrupt Status Enable */
#define EMAC_MTL_DBG_CTL_EIEE            (1 << 16) /* Bit 16: ECC Inject Error Enable */
#define EMAC_MTL_DBG_CTL_EIEC_SHIFT      (17)      /* Bits 17-19: ECC Inject Error Control */
#define EMAC_MTL_DBG_CTL_EIEC_MASK       (0x3 << EMAC_MTL_DBG_CTL_EIEC_SHIFT)
#define EMAC_MTL_DBG_CTL_EIEC(n)         (((n) << EMAC_MTL_DBG_CTL_EIEC_SHIFT) & EMAC_MTL_DBG_CTL_EIEC_MASK)

/* MTL Debug Status (MTL_DBG_STS) */
#define EMAC_MTL_DBG_STS_FIFOBUSY        (1 << 0) /* Bit 0: FIFO Busy */
#define EMAC_MTL_DBG_STS_PKTSTATE_SHIFT  (1)      /* Bits 1-3: Encoded Packet State */
#define EMAC_MTL_DBG_STS_PKTSTATE_MASK   (0x3 << EMAC_MTL_DBG_STS_PKTSTATE_SHIFT)
#define EMAC_MTL_DBG_STS_PKTSTATE(n)     (((n) << EMAC_MTL_DBG_STS_PKTSTATE_SHIFT) & EMAC_MTL_DBG_STS_PKTSTATE_MASK)
#define EMAC_MTL_DBG_STS_BYTEEN_SHIFT    (3) /* Bits 3-5: Byte Enables */
#define EMAC_MTL_DBG_STS_BYTEEN_MASK     (0x3 << EMAC_MTL_DBG_STS_BYTEEN_SHIFT)
#define EMAC_MTL_DBG_STS_BYTEEN(n)       (((n) << EMAC_MTL_DBG_STS_BYTEEN_SHIFT) & EMAC_MTL_DBG_STS_BYTEEN_MASK)
#define EMAC_MTL_DBG_STS_PKTI            (1 << 8) /* Bit 8: Receive Packet Available Interrupt Status */
#define EMAC_MTL_DBG_STS_STSI            (1 << 9) /* Bit 9: Transmit Status Available Interrupt Status */
#define EMAC_MTL_DBG_STS_LOCR_SHIFT      (15)     /* Bits 15-32: Remaining Locations In FIFO */
#define EMAC_MTL_DBG_STS_LOCR_MASK       (0x1fFFF << EMAC_MTL_DBG_STS_LOCR_SHIFT)
#define EMAC_MTL_DBG_STS_LOCR(n)         (((n) << EMAC_MTL_DBG_STS_LOCR_SHIFT) & EMAC_MTL_DBG_STS_LOCR_MASK)

/* MTL FIFO Debug Data (MTL_FIFO_DEBUG_DATA) */
#define EMAC_MTL_FIFO_DEBUG_DATA_FDBGDATA_SHIFT  (0) /* Bits 0-32: FIFO Debug Data */
#define EMAC_MTL_FIFO_DEBUG_DATA_FDBGDATA_MASK   (0xffffffff << EMAC_MTL_FIFO_DEBUG_DATA_FDBGDATA_SHIFT)
#define EMAC_MTL_FIFO_DEBUG_DATA_FDBGDATA(n)     (((n) << EMAC_MTL_FIFO_DEBUG_DATA_FDBGDATA_SHIFT) & EMAC_MTL_FIFO_DEBUG_DATA_FDBGDATA_MASK)

/* MTL Interrupt Status (MTL_INTERRUPT_STATUS) */
#define EMAC_MTL_INTERRUPT_STATUS_Q0IS    (1 << 0)  /* Bit 0: Queue 0 Interrupt Status */
#define EMAC_MTL_INTERRUPT_STATUS_Q1IS    (1 << 1)  /* Bit 1: Queue 1 Interrupt Status */
#define EMAC_MTL_INTERRUPT_STATUS_DBGIS   (1 << 17) /* Bit 17: Debug Interrupt Status */
#define EMAC_MTL_INTERRUPT_STATUS_ESTIS   (1 << 18) /* Bit 18: EST (TAS- 802.1Qbv) Interrupt Status */
#define EMAC_MTL_INTERRUPT_STATUS_MTLPIS  (1 << 23) /* Bit 23: MTL Receive Parser Interrupt Status */

/* MTL Receive Queue DMA Map 0 (MTL_RXQ_DMA_MAP0) */
#define EMAC_MTL_RXQ_DMA_MAP0_Q0MDMACH  (1 << 0)  /* Bit 0: Queue 0 Mapped to DMA Channel */
#define EMAC_MTL_RXQ_DMA_MAP0_Q0DDMACH  (1 << 4)  /* Bit 4: Queue 0 Enabled for DA-based DMA Channel Selection */
#define EMAC_MTL_RXQ_DMA_MAP0_Q1MDMACH  (1 << 8)  /* Bit 8: Queue 1 Mapped to DMA Channel */
#define EMAC_MTL_RXQ_DMA_MAP0_Q1DDMACH  (1 << 12) /* Bit 12: Queue 1 Enabled for DA-based DMA Channel Selection */

/* MTL TBS Control (MTL_TBS_CTRL) */
#define EMAC_MTL_TBS_CTRL_ESTM         (1 << 0) /* Bit 0: EST offset Mode */
#define EMAC_MTL_TBS_CTRL_LEOV         (1 << 1) /* Bit 1: Launch Expiry Offset Valid */
#define EMAC_MTL_TBS_CTRL_LEGOS_SHIFT  (4)      /* Bits 4-7: Launch Expiry GSN Offset */
#define EMAC_MTL_TBS_CTRL_LEGOS_MASK   (0x7 << EMAC_MTL_TBS_CTRL_LEGOS_SHIFT)
#define EMAC_MTL_TBS_CTRL_LEGOS(n)     (((n) << EMAC_MTL_TBS_CTRL_LEGOS_SHIFT) & EMAC_MTL_TBS_CTRL_LEGOS_MASK)
#define EMAC_MTL_TBS_CTRL_LEOS_SHIFT   (8) /* Bits 8-32: Launch Expiry Offset */
#define EMAC_MTL_TBS_CTRL_LEOS_MASK    (0xffffff << EMAC_MTL_TBS_CTRL_LEOS_SHIFT)
#define EMAC_MTL_TBS_CTRL_LEOS(n)      (((n) << EMAC_MTL_TBS_CTRL_LEOS_SHIFT) & EMAC_MTL_TBS_CTRL_LEOS_MASK)

/* MTL EST Control (MTL_EST_CONTROL) */
#define EMAC_MTL_EST_CONTROL_EEST        (1 << 0) /* Bit 0: Enable EST */
#define EMAC_MTL_EST_CONTROL_SSWL        (1 << 1) /* Bit 1: Switch to Software Owned List */
#define EMAC_MTL_EST_CONTROL_DDBF        (1 << 4) /* Bit 4: Do not Drop Frames during Frame Size Error */
#define EMAC_MTL_EST_CONTROL_DFBS        (1 << 5) /* Bit 5: Drop Frames Causing Scheduling Error */
#define EMAC_MTL_EST_CONTROL_LCSE_SHIFT  (6)      /* Bits 6-8: Loop Count to Report Scheduling Error */
#define EMAC_MTL_EST_CONTROL_LCSE_MASK   (0x3 << EMAC_MTL_EST_CONTROL_LCSE_SHIFT)
#define EMAC_MTL_EST_CONTROL_LCSE(n)     (((n) << EMAC_MTL_EST_CONTROL_LCSE_SHIFT) & EMAC_MTL_EST_CONTROL_LCSE_MASK)
#define EMAC_MTL_EST_CONTROL_TILS_SHIFT  (8) /* Bits 8-11: Time Interval Left Shift Amount */
#define EMAC_MTL_EST_CONTROL_TILS_MASK   (0x7 << EMAC_MTL_EST_CONTROL_TILS_SHIFT)
#define EMAC_MTL_EST_CONTROL_TILS(n)     (((n) << EMAC_MTL_EST_CONTROL_TILS_SHIFT) & EMAC_MTL_EST_CONTROL_TILS_MASK)
#define EMAC_MTL_EST_CONTROL_CTOV_SHIFT  (12) /* Bits 12-24: Current Time Offset Value */
#define EMAC_MTL_EST_CONTROL_CTOV_MASK   (0xfff << EMAC_MTL_EST_CONTROL_CTOV_SHIFT)
#define EMAC_MTL_EST_CONTROL_CTOV(n)     (((n) << EMAC_MTL_EST_CONTROL_CTOV_SHIFT) & EMAC_MTL_EST_CONTROL_CTOV_MASK)
#define EMAC_MTL_EST_CONTROL_PTOV_SHIFT  (24) /* Bits 24-32: PTP Time Offset Value */
#define EMAC_MTL_EST_CONTROL_PTOV_MASK   (0xff << EMAC_MTL_EST_CONTROL_PTOV_SHIFT)
#define EMAC_MTL_EST_CONTROL_PTOV(n)     (((n) << EMAC_MTL_EST_CONTROL_PTOV_SHIFT) & EMAC_MTL_EST_CONTROL_PTOV_MASK)

/* MTL EST Status (MTL_EST_STATUS) */
#define EMAC_MTL_EST_STATUS_SWLC        (1 << 0) /* Bit 0: Switch to Software Owned List Complete */
#define EMAC_MTL_EST_STATUS_BTRE        (1 << 1) /* Bit 1: BTR Error */
#define EMAC_MTL_EST_STATUS_HLBF        (1 << 2) /* Bit 2: Head-Of-Line Blocking due to Frame Size Set when HOL Blocking is noticed on one or more Queues as a result of none of the Time Intervals of gate open in the GCL being greater than or equal to the duration needed for frame size (or frame fragment size when preemption is enabled) transmission */
#define EMAC_MTL_EST_STATUS_HLBS        (1 << 3) /* Bit 3: Head-Of-Line Blocking due to Scheduling Set when the frame is not able to win arbitration and get scheduled even after 4 iterations of the GCL */
#define EMAC_MTL_EST_STATUS_CGCE        (1 << 4) /* Bit 4: Constant Gate Control Error This error occurs when the list length (LLR) is 1 and the Cycle Time (CTR) is less than or equal to the programmed Time Interval (TI) value after the optional Left Shifting */
#define EMAC_MTL_EST_STATUS_SWOL        (1 << 7) /* Bit 7: S/W owned list When '0' indicates Gate control list number "0" is owned by software and when "1" indicates the Gate Control list "1" is owned by the software */
#define EMAC_MTL_EST_STATUS_BTRL_SHIFT  (8)      /* Bits 8-12: BTR Error Loop Count Provides the minimum count (N) for which the equation Current Time =< New BTR + ((n) * New Cycle Time) becomes true */
#define EMAC_MTL_EST_STATUS_BTRL_MASK   (0xf << EMAC_MTL_EST_STATUS_BTRL_SHIFT)
#define EMAC_MTL_EST_STATUS_BTRL(n)     (((n) << EMAC_MTL_EST_STATUS_BTRL_SHIFT) & EMAC_MTL_EST_STATUS_BTRL_MASK)
#define EMAC_MTL_EST_STATUS_CGSN_SHIFT  (16) /* Bits 16-20: Current GCL Slot Number Indicates the slot number of the GCL list */
#define EMAC_MTL_EST_STATUS_CGSN_MASK   (0xf << EMAC_MTL_EST_STATUS_CGSN_SHIFT)
#define EMAC_MTL_EST_STATUS_CGSN(n)     (((n) << EMAC_MTL_EST_STATUS_CGSN_SHIFT) & EMAC_MTL_EST_STATUS_CGSN_MASK)

