apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_emac.h
/* MTL EST Scheduling Error (MTL_EST_SCH_ERROR) */
#define EMAC_MTL_EST_SCH_ERROR_SEQN_SHIFT  (0) /* Bits 0-2: Schedule Error Queue Number */
#define EMAC_MTL_EST_SCH_ERROR_SEQN_MASK   (0x3 << EMAC_MTL_EST_SCH_ERROR_SEQN_SHIFT)
#define EMAC_MTL_EST_SCH_ERROR_SEQN(n)     (((n) << EMAC_MTL_EST_SCH_ERROR_SEQN_SHIFT) & EMAC_MTL_EST_SCH_ERROR_SEQN_MASK)

/* MTL EST Frame Size Error (MTL_EST_FRM_SIZE_ERROR) */
#define EMAC_MTL_EST_FRM_SIZE_ERROR_FEQN_SHIFT  (0) /* Bits 0-2: Frame Size Error Queue Number */
#define EMAC_MTL_EST_FRM_SIZE_ERROR_FEQN_MASK   (0x3 << EMAC_MTL_EST_FRM_SIZE_ERROR_FEQN_SHIFT)
#define EMAC_MTL_EST_FRM_SIZE_ERROR_FEQN(n)     (((n) << EMAC_MTL_EST_FRM_SIZE_ERROR_FEQN_SHIFT) & EMAC_MTL_EST_FRM_SIZE_ERROR_FEQN_MASK)

/* MTL EST Frame Size Capture (MTL_EST_FRM_SIZE_CAPTURE) */
#define EMAC_MTL_EST_FRM_SIZE_CAPTURE_HBFS_SHIFT  (0) /* Bits 0-15: Frame Size of HLBF */
#define EMAC_MTL_EST_FRM_SIZE_CAPTURE_HBFS_MASK   (0x7ffF << EMAC_MTL_EST_FRM_SIZE_CAPTURE_HBFS_SHIFT)
#define EMAC_MTL_EST_FRM_SIZE_CAPTURE_HBFS(n)     (((n) << EMAC_MTL_EST_FRM_SIZE_CAPTURE_HBFS_SHIFT) & EMAC_MTL_EST_FRM_SIZE_CAPTURE_HBFS_MASK)
#define EMAC_MTL_EST_FRM_SIZE_CAPTURE_HBFQ        (1 << 16) /* Bit 16: Queue Number of HLBF */

/* MTL EST Interrupt Enable (MTL_EST_INTR_ENABLE) */
#define EMAC_MTL_EST_INTR_ENABLE_IECC  (1 << 0) /* Bit 0: Interrupt Enable for Switch List */
#define EMAC_MTL_EST_INTR_ENABLE_IEBE  (1 << 1) /* Bit 1: Interrupt Enable for BTR Error */
#define EMAC_MTL_EST_INTR_ENABLE_IEHF  (1 << 2) /* Bit 2: Interrupt Enable for HLBF */
#define EMAC_MTL_EST_INTR_ENABLE_IEHS  (1 << 3) /* Bit 3: Interrupt Enable for HLBS */
#define EMAC_MTL_EST_INTR_ENABLE_CGCE  (1 << 4) /* Bit 4: Interrupt Enable for CGCE */

/* MTL EST GCL Control (MTL_EST_GCL_CONTROL) */
#define EMAC_MTL_EST_GCL_CONTROL_SRWO           (1 << 0) /* Bit 0: Start Read/Write Operation */
#define EMAC_MTL_EST_GCL_CONTROL_R1W0           (1 << 1) /* Bit 1: Read '1', Write '0' */
#define EMAC_MTL_EST_GCL_CONTROL_GCRR           (1 << 2) /* Bit 2: Gate Control Related Registers */
#define EMAC_MTL_EST_GCL_CONTROL_DBGM           (1 << 4) /* Bit 4: Debug Mode */
#define EMAC_MTL_EST_GCL_CONTROL_DBGB           (1 << 5) /* Bit 5: Debug Mode Bank Select */
#define EMAC_MTL_EST_GCL_CONTROL_ADDR_SHIFT     (8)      /* Bits 8-16: Gate Control List Address: (GCLA when GCRR is "0") */
#define EMAC_MTL_EST_GCL_CONTROL_ADDR_MASK      (0xff << EMAC_MTL_EST_GCL_CONTROL_ADDR_SHIFT)
#define EMAC_MTL_EST_GCL_CONTROL_ADDR(n)        (((n) << EMAC_MTL_EST_GCL_CONTROL_ADDR_SHIFT) & EMAC_MTL_EST_GCL_CONTROL_ADDR_MASK)
#define EMAC_MTL_EST_GCL_CONTROL_ERR0           (1 << 20) /* Bit 20: If this field is 1, it indicates that when the software writes to GCL the last write operation was aborted and when MTL_EST_Control[SSWL] is 1, GCL registers are prohibited */
#define EMAC_MTL_EST_GCL_CONTROL_ESTEIEE        (1 << 21) /* Bit 21: EST ECC Inject Error Enable */
#define EMAC_MTL_EST_GCL_CONTROL_ESTEIEC_SHIFT  (22)      /* Bits 22-24: ECC Inject Error Control for EST Memory */
#define EMAC_MTL_EST_GCL_CONTROL_ESTEIEC_MASK   (0x3 << EMAC_MTL_EST_GCL_CONTROL_ESTEIEC_SHIFT)
#define EMAC_MTL_EST_GCL_CONTROL_ESTEIEC(n)     (((n) << EMAC_MTL_EST_GCL_CONTROL_ESTEIEC_SHIFT) & EMAC_MTL_EST_GCL_CONTROL_ESTEIEC_MASK)

/* MTL EST GCL Data (MTL_EST_GCL_DATA) */
#define EMAC_MTL_EST_GCL_DATA_GCD_SHIFT  (0) /* Bits 0-32: Gate Control Data */
#define EMAC_MTL_EST_GCL_DATA_GCD_MASK   (0xffffffff << EMAC_MTL_EST_GCL_DATA_GCD_SHIFT)
#define EMAC_MTL_EST_GCL_DATA_GCD(n)     (((n) << EMAC_MTL_EST_GCL_DATA_GCD_SHIFT) & EMAC_MTL_EST_GCL_DATA_GCD_MASK)

/* MTL FPE Control Status (MTL_FPE_CTRL_STS) */
#define EMAC_MTL_FPE_CTRL_STS_AFSZ_SHIFT  (0) /* Bits 0-2: Additional Fragment Size */
#define EMAC_MTL_FPE_CTRL_STS_AFSZ_MASK   (0x3 << EMAC_MTL_FPE_CTRL_STS_AFSZ_SHIFT)
#define EMAC_MTL_FPE_CTRL_STS_AFSZ(n)     (((n) << EMAC_MTL_FPE_CTRL_STS_AFSZ_SHIFT) & EMAC_MTL_FPE_CTRL_STS_AFSZ_MASK)
#define EMAC_MTL_FPE_CTRL_STS_PEC_SHIFT   (8) /* Bits 8-10: Preemption Classification */
#define EMAC_MTL_FPE_CTRL_STS_PEC_MASK    (0x3 << EMAC_MTL_FPE_CTRL_STS_PEC_SHIFT)
#define EMAC_MTL_FPE_CTRL_STS_PEC(n)      (((n) << EMAC_MTL_FPE_CTRL_STS_PEC_SHIFT) & EMAC_MTL_FPE_CTRL_STS_PEC_MASK)
#define EMAC_MTL_FPE_CTRL_STS_HRS         (1 << 28) /* Bit 28: Hold/Release Status */

/* MTL FPE Advance (MTL_FPE_ADVANCE) */
#define EMAC_MTL_FPE_ADVANCE_HADV_SHIFT  (0) /* Bits 0-16: Hold Advance */
#define EMAC_MTL_FPE_ADVANCE_HADV_MASK   (0xffff << EMAC_MTL_FPE_ADVANCE_HADV_SHIFT)
#define EMAC_MTL_FPE_ADVANCE_HADV(n)     (((n) << EMAC_MTL_FPE_ADVANCE_HADV_SHIFT) & EMAC_MTL_FPE_ADVANCE_HADV_MASK)
#define EMAC_MTL_FPE_ADVANCE_RADV_SHIFT  (16) /* Bits 16-32: Release Advance */
#define EMAC_MTL_FPE_ADVANCE_RADV_MASK   (0xffff << EMAC_MTL_FPE_ADVANCE_RADV_SHIFT)
#define EMAC_MTL_FPE_ADVANCE_RADV(n)     (((n) << EMAC_MTL_FPE_ADVANCE_RADV_SHIFT) & EMAC_MTL_FPE_ADVANCE_RADV_MASK)

/* MTL Rx Parser Control Status (MTL_RXP_CONTROL_STATUS) */
#define EMAC_MTL_RXP_CONTROL_STATUS_NVE_SHIFT  (0) /* Bits 0-6: Number Of Valid Entry Address Or Index In The Instruction Table */
#define EMAC_MTL_RXP_CONTROL_STATUS_NVE_MASK   (0x3f << EMAC_MTL_RXP_CONTROL_STATUS_NVE_SHIFT)
#define EMAC_MTL_RXP_CONTROL_STATUS_NVE(n)     (((n) << EMAC_MTL_RXP_CONTROL_STATUS_NVE_SHIFT) & EMAC_MTL_RXP_CONTROL_STATUS_NVE_MASK)
#define EMAC_MTL_RXP_CONTROL_STATUS_MTL_SCS1   (1 << 15) /* Bit 15: MTL_SCS1 */
#define EMAC_MTL_RXP_CONTROL_STATUS_NPE_SHIFT  (16)      /* Bits 16-22: Number of parsable entries in the Instruction table */
#define EMAC_MTL_RXP_CONTROL_STATUS_NPE_MASK   (0x3f << EMAC_MTL_RXP_CONTROL_STATUS_NPE_SHIFT)
#define EMAC_MTL_RXP_CONTROL_STATUS_NPE(n)     (((n) << EMAC_MTL_RXP_CONTROL_STATUS_NPE_SHIFT) & EMAC_MTL_RXP_CONTROL_STATUS_NPE_MASK)
#define EMAC_MTL_RXP_CONTROL_STATUS_RXPI       (1 << 31) /* Bit 31: RX Parser in Idle State */

/* MTL Rx Parser Interrupt Control Status
 * (MTL_RXP_INTERRUPT_CONTROL_STATUS)
 */

#define EMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_NVEOVIS  (1 << 0)  /* Bit 0: Number of Valid Entry Address/Index Overflow Interrupt Status */
#define EMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_NPEOVIS  (1 << 1)  /* Bit 1: Number of Parsable Entries Overflow Interrupt Status */
#define EMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_FOOVIS   (1 << 2)  /* Bit 2: Frame Offset Overflow Interrupt Status */
#define EMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_PDRFIS   (1 << 3)  /* Bit 3: Packet Dropped due to RF Interrupt Status */
#define EMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_NVEOVIE  (1 << 16) /* Bit 16: Number of Valid Entries Overflow Interrupt Enable */
#define EMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_NPEOVIE  (1 << 17) /* Bit 17: Number of Parsable Entries Overflow Interrupt Enable */
#define EMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_FOOVIE   (1 << 18) /* Bit 18: Frame Offset Overflow Interrupt Enable */
#define EMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_PDRFIE   (1 << 19) /* Bit 19: Packet Drop due to RF Interrupt Enable */

