apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_emac.h
/* MTL Rx Parser Drop Count (MTL_RXP_DROP_CNT) */
#define EMAC_MTL_RXP_DROP_CNT_RXPDC_SHIFT  (0) /* Bits 0-31: Rx Parser Drop Count */
#define EMAC_MTL_RXP_DROP_CNT_RXPDC_MASK   (0x7fffffff << EMAC_MTL_RXP_DROP_CNT_RXPDC_SHIFT)
#define EMAC_MTL_RXP_DROP_CNT_RXPDC(n)     (((n) << EMAC_MTL_RXP_DROP_CNT_RXPDC_SHIFT) & EMAC_MTL_RXP_DROP_CNT_RXPDC_MASK)
#define EMAC_MTL_RXP_DROP_CNT_RXPDCOVF     (1 << 31) /* Bit 31: Rx Parser Drop Counter Overflow Bit */

/* MTL Rx Parser Error Count (MTL_RXP_ERROR_CNT) */
#define EMAC_MTL_RXP_ERROR_CNT_RXPEC_SHIFT  (0) /* Bits 0-31: Rx Parser Error Count */
#define EMAC_MTL_RXP_ERROR_CNT_RXPEC_MASK   (0x7fffffff << EMAC_MTL_RXP_ERROR_CNT_RXPEC_SHIFT)
#define EMAC_MTL_RXP_ERROR_CNT_RXPEC(n)     (((n) << EMAC_MTL_RXP_ERROR_CNT_RXPEC_SHIFT) & EMAC_MTL_RXP_ERROR_CNT_RXPEC_MASK)
#define EMAC_MTL_RXP_ERROR_CNT_RXPECOVF     (1 << 31) /* Bit 31: Rx Parser Error Counter Overflow Bit */

/* MTL Rx Parser Indirect Access Control Status
 * (MTL_RXP_INDIRECT_ACC_CONTROL_STATUS)
 */

#define EMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_ADDR_SHIFT     (0) /* Bits 0-8: FRP Instruction Table Offset Address */
#define EMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_ADDR_MASK      (0xff << EMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_ADDR_SHIFT)
#define EMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_ADDR(n)        (((n) << EMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_ADDR_SHIFT) & EMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_ADDR_MASK)
#define EMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_WRRDN          (1 << 16) /* Bit 16: Read Write Control */
#define EMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_RXPEIEE        (1 << 20) /* Bit 20: ECC Inject Error Enable for Rx Parser Memory */
#define EMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_RXPEIEC_SHIFT  (21)      /* Bits 21-23: ECC Inject Error Control for Rx Parser Memory */
#define EMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_RXPEIEC_MASK   (0x3 << EMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_RXPEIEC_SHIFT)
#define EMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_RXPEIEC(n)     (((n) << EMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_RXPEIEC_SHIFT) & EMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_RXPEIEC_MASK)
#define EMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_STARTBUSY      (1 << 31) /* Bit 31: FRP Instruction Table Access Busy */

/* MTL Rx Parser Indirect Access Data (MTL_RXP_INDIRECT_ACC_DATA) */
#define EMAC_MTL_RXP_INDIRECT_ACC_DATA_DATA_SHIFT  (0) /* Bits 0-32: FRP Instruction Table Write/Read Data */
#define EMAC_MTL_RXP_INDIRECT_ACC_DATA_DATA_MASK   (0xffffffff << EMAC_MTL_RXP_INDIRECT_ACC_DATA_DATA_SHIFT)
#define EMAC_MTL_RXP_INDIRECT_ACC_DATA_DATA(n)     (((n) << EMAC_MTL_RXP_INDIRECT_ACC_DATA_DATA_SHIFT) & EMAC_MTL_RXP_INDIRECT_ACC_DATA_DATA_MASK)

/* MTL ECC Control (MTL_ECC_CONTROL) */
#define EMAC_MTL_ECC_CONTROL_MTXEE   (1 << 0) /* Bit 0: MTL Tx FIFO ECC Enable */
#define EMAC_MTL_ECC_CONTROL_MRXEE   (1 << 1) /* Bit 1: MTL Rx FIFO ECC Enable */
#define EMAC_MTL_ECC_CONTROL_MESTEE  (1 << 2) /* Bit 2: MTL EST ECC Enable */
#define EMAC_MTL_ECC_CONTROL_MRXPEE  (1 << 3) /* Bit 3: MTL Rx Parser ECC Enable */
#define EMAC_MTL_ECC_CONTROL_MEEAO   (1 << 8) /* Bit 8: MTL ECC Error Address Status Over-ride */

/* MTL Safety Interrupt Status (MTL_SAFETY_INTERRUPT_STATUS) */
#define EMAC_MTL_SAFETY_INTERRUPT_STATUS_MECIS  (1 << 0) /* Bit 0: MTL ECC Correctable Error Interrupt Status */
#define EMAC_MTL_SAFETY_INTERRUPT_STATUS_MEUIS  (1 << 1) /* Bit 1: MTL ECC Uncorrectable Error Interrupt Status */

/* MTL ECC Interrupt Enable (MTL_ECC_INTERRUPT_ENABLE) */
#define EMAC_MTL_ECC_INTERRUPT_ENABLE_TXCEIE  (1 << 0)  /* Bit 0: Tx Memory Correctable Error Interrupt Enable */
#define EMAC_MTL_ECC_INTERRUPT_ENABLE_RXCEIE  (1 << 4)  /* Bit 4: Rx Memory Correctable Error Interrupt Enable */
#define EMAC_MTL_ECC_INTERRUPT_ENABLE_ECEIE   (1 << 8)  /* Bit 8: EST Memory Correctable Error Interrupt Enable */
#define EMAC_MTL_ECC_INTERRUPT_ENABLE_RPCEIE  (1 << 12) /* Bit 12: Rx Parser Memory Correctable Error Interrupt Enable */

/* MTL ECC Interrupt Status (MTL_ECC_INTERRUPT_STATUS) */
#define EMAC_MTL_ECC_INTERRUPT_STATUS_TXCES  (1 << 0)  /* Bit 0: MTL Tx Memory Correctable Error Status */
#define EMAC_MTL_ECC_INTERRUPT_STATUS_TXAMS  (1 << 1)  /* Bit 1: MTL Tx Memory Address Mismatch Status */
#define EMAC_MTL_ECC_INTERRUPT_STATUS_TXUES  (1 << 2)  /* Bit 2: MTL Tx Memory Uncorrectable Error Status */
#define EMAC_MTL_ECC_INTERRUPT_STATUS_RXCES  (1 << 4)  /* Bit 4: MTL Rx memory Correctable Error Status */
#define EMAC_MTL_ECC_INTERRUPT_STATUS_RXAMS  (1 << 5)  /* Bit 5: MTL Rx Memory Address Mismatch Status */
#define EMAC_MTL_ECC_INTERRUPT_STATUS_RXUES  (1 << 6)  /* Bit 6: MTL Rx Memory Uncorrectable Error Status */
#define EMAC_MTL_ECC_INTERRUPT_STATUS_ECES   (1 << 8)  /* Bit 8: MTL EST Memory Correctable Error Status */
#define EMAC_MTL_ECC_INTERRUPT_STATUS_EAMS   (1 << 9)  /* Bit 9: MTL EST Memory Address Mismatch Status */
#define EMAC_MTL_ECC_INTERRUPT_STATUS_EUES   (1 << 10) /* Bit 10: MTL EST Memory Uncorrectable Error Status */
#define EMAC_MTL_ECC_INTERRUPT_STATUS_RPCES  (1 << 12) /* Bit 12: MTL Rx Parser Memory Correctable Error Status */
#define EMAC_MTL_ECC_INTERRUPT_STATUS_RPAMS  (1 << 13) /* Bit 13: MTL Rx Parser Memory Address Mismatch Status */
#define EMAC_MTL_ECC_INTERRUPT_STATUS_RPUES  (1 << 14) /* Bit 14: Rx Parser Memory Uncorrectable Error Status */

/* MTL ECC Error Status (MTL_ECC_ERR_STS_RCTL) */
#define EMAC_MTL_ECC_ERR_STS_RCTL_EESRE      (1 << 0) /* Bit 0: MTL ECC Error Status Read Enable */
#define EMAC_MTL_ECC_ERR_STS_RCTL_EMS_SHIFT  (1)      /* Bits 1-4: MTL ECC Memory Selection */
#define EMAC_MTL_ECC_ERR_STS_RCTL_EMS_MASK   (0x7 << EMAC_MTL_ECC_ERR_STS_RCTL_EMS_SHIFT)
#define EMAC_MTL_ECC_ERR_STS_RCTL_EMS(n)     (((n) << EMAC_MTL_ECC_ERR_STS_RCTL_EMS_SHIFT) & EMAC_MTL_ECC_ERR_STS_RCTL_EMS_MASK)
#define EMAC_MTL_ECC_ERR_STS_RCTL_CCES       (1 << 4) /* Bit 4: Clear Correctable Error Status */
#define EMAC_MTL_ECC_ERR_STS_RCTL_CUES       (1 << 5) /* Bit 5: Clear Uncorrectable Error Status */

/* MTL ECC Error Address Status (MTL_ECC_ERR_ADDR_STATUS) */
#define EMAC_MTL_ECC_ERR_ADDR_STATUS_ECEAS_SHIFT  (0) /* Bits 0-16: MTL ECC Correctable Error Address Status */
#define EMAC_MTL_ECC_ERR_ADDR_STATUS_ECEAS_MASK   (0xffff << EMAC_MTL_ECC_ERR_ADDR_STATUS_ECEAS_SHIFT)
#define EMAC_MTL_ECC_ERR_ADDR_STATUS_ECEAS(n)     (((n) << EMAC_MTL_ECC_ERR_ADDR_STATUS_ECEAS_SHIFT) & EMAC_MTL_ECC_ERR_ADDR_STATUS_ECEAS_MASK)
#define EMAC_MTL_ECC_ERR_ADDR_STATUS_EUEAS_SHIFT  (16) /* Bits 16-32: MTL ECC Uncorrectable Error Address Status */
#define EMAC_MTL_ECC_ERR_ADDR_STATUS_EUEAS_MASK   (0xffff << EMAC_MTL_ECC_ERR_ADDR_STATUS_EUEAS_SHIFT)
#define EMAC_MTL_ECC_ERR_ADDR_STATUS_EUEAS(n)     (((n) << EMAC_MTL_ECC_ERR_ADDR_STATUS_EUEAS_SHIFT) & EMAC_MTL_ECC_ERR_ADDR_STATUS_EUEAS_MASK)

/* MTL ECC Error Control Status (MTL_ECC_ERR_CNTR_STATUS) */
#define EMAC_MTL_ECC_ERR_CNTR_STATUS_ECECS_SHIFT  (0) /* Bits 0-8: MTL ECC Correctable Error Counter Status Based on the EMS field of MTL_ECC_Err_Cntr_Rctl register, this field holds the respective memory's correctable error count value */
#define EMAC_MTL_ECC_ERR_CNTR_STATUS_ECECS_MASK   (0xff << EMAC_MTL_ECC_ERR_CNTR_STATUS_ECECS_SHIFT)
#define EMAC_MTL_ECC_ERR_CNTR_STATUS_ECECS(n)     (((n) << EMAC_MTL_ECC_ERR_CNTR_STATUS_ECECS_SHIFT) & EMAC_MTL_ECC_ERR_CNTR_STATUS_ECECS_MASK)
#define EMAC_MTL_ECC_ERR_CNTR_STATUS_EUECS_SHIFT  (16) /* Bits 16-20: MTL ECC Uncorrectable Error Counter Status Based on the EMS field of MTL_ECC_Err_Cntr_Rctl register, this field holds the respective memory's uncorrectable error count value */
#define EMAC_MTL_ECC_ERR_CNTR_STATUS_EUECS_MASK   (0xf << EMAC_MTL_ECC_ERR_CNTR_STATUS_EUECS_SHIFT)
#define EMAC_MTL_ECC_ERR_CNTR_STATUS_EUECS(n)     (((n) << EMAC_MTL_ECC_ERR_CNTR_STATUS_EUECS_SHIFT) & EMAC_MTL_ECC_ERR_CNTR_STATUS_EUECS_MASK)

/* MTL DPP Control (MTL_DPP_CONTROL) */
#define EMAC_MTL_DPP_CONTROL_EDPP    (1 << 0)  /* Bit 0: Enable Data path Parity Protection */
#define EMAC_MTL_DPP_CONTROL_OPE     (1 << 1)  /* Bit 1: Odd Parity Enable */
#define EMAC_MTL_DPP_CONTROL_IPEID   (1 << 4)  /* Bit 4: Insert Parity Error in Interface Data Parity Generator */
#define EMAC_MTL_DPP_CONTROL_IPEMC   (1 << 5)  /* Bit 5: Insert Parity Error in MTL Checksum Parity Generator */
#define EMAC_MTL_DPP_CONTROL_IPEMTS  (1 << 6)  /* Bit 6: Insert Parity Error in MTL Tx Status Parity Generator */
#define EMAC_MTL_DPP_CONTROL_IPEMRF  (1 << 7)  /* Bit 7: Insert Parity Error in MTL Rx FIFO Read Control Parity Generator */
#define EMAC_MTL_DPP_CONTROL_IPEDDC  (1 << 8)  /* Bit 8: Insert Parity Error in DMA DTX Control Word Parity Generator */
#define EMAC_MTL_DPP_CONTROL_IPETD   (1 << 10) /* Bit 10: Insert Parity error in Tx write-back Descriptor parity generator */
#define EMAC_MTL_DPP_CONTROL_IPERD   (1 << 11) /* Bit 11: Insert Parity error in Rx write-back Descriptor parity generator */

/* MTL Tx Queue 0 Operation Mode (MTL_TXQ0_OPERATION_MODE) */
#define EMAC_MTL_TXQ0_OPERATION_MODE_FTQ           (1 << 0) /* Bit 0: Flush Transmit Queue */
#define EMAC_MTL_TXQ0_OPERATION_MODE_TSF           (1 << 1) /* Bit 1: Transmit Store and Forward */
#define EMAC_MTL_TXQ0_OPERATION_MODE_TXQEN_SHIFT   (2)      /* Bits 2-4: Transmit Queue Enable */
#define EMAC_MTL_TXQ0_OPERATION_MODE_TXQEN_MASK    (0x3 << EMAC_MTL_TXQ0_OPERATION_MODE_TXQEN_SHIFT)
#define EMAC_MTL_TXQ0_OPERATION_MODE_TXQEN(n)      (((n) << EMAC_MTL_TXQ0_OPERATION_MODE_TXQEN_SHIFT) & EMAC_MTL_TXQ0_OPERATION_MODE_TXQEN_MASK)
#define EMAC_MTL_TXQ0_OPERATION_MODE_TXQEN_DISABLE EMAC_MTL_TXQ0_OPERATION_MODE_TXQEN(0)
#define EMAC_MTL_TXQ0_OPERATION_MODE_TXQEN_AVB     EMAC_MTL_TXQ0_OPERATION_MODE_TXQEN(0x1)
#define EMAC_MTL_TXQ0_OPERATION_MODE_TXQEN_DCB_GEN EMAC_MTL_TXQ0_OPERATION_MODE_TXQEN(0x2)
#define EMAC_MTL_TXQ0_OPERATION_MODE_TTC_SHIFT     (4) /* Bits 4-7: Transmit Threshold Control */
#define EMAC_MTL_TXQ0_OPERATION_MODE_TTC_MASK      (0x7 << EMAC_MTL_TXQ0_OPERATION_MODE_TTC_SHIFT)
#define EMAC_MTL_TXQ0_OPERATION_MODE_TTC(n)        (((n) << EMAC_MTL_TXQ0_OPERATION_MODE_TTC_SHIFT) & EMAC_MTL_TXQ0_OPERATION_MODE_TTC_MASK)
#define EMAC_MTL_TXQ0_OPERATION_MODE_TQS_SHIFT     (16) /* Bits 16-21: Transmit Queue Size */
#define EMAC_MTL_TXQ0_OPERATION_MODE_TQS_MASK      (0x1f << EMAC_MTL_TXQ0_OPERATION_MODE_TQS_SHIFT)
#define EMAC_MTL_TXQ0_OPERATION_MODE_TQS(n)        (((n) << EMAC_MTL_TXQ0_OPERATION_MODE_TQS_SHIFT) & EMAC_MTL_TXQ0_OPERATION_MODE_TQS_MASK)

/* MTL Tx Queue 0 Underflow (MTL_TXQ0_UNDERFLOW) */
#define EMAC_MTL_TXQ0_UNDERFLOW_UFFRMCNT_SHIFT  (0) /* Bits 0-11: Underflow Packet Counter */
#define EMAC_MTL_TXQ0_UNDERFLOW_UFFRMCNT_MASK   (0x7ff << EMAC_MTL_TXQ0_UNDERFLOW_UFFRMCNT_SHIFT)
#define EMAC_MTL_TXQ0_UNDERFLOW_UFFRMCNT(n)     (((n) << EMAC_MTL_TXQ0_UNDERFLOW_UFFRMCNT_SHIFT) & EMAC_MTL_TXQ0_UNDERFLOW_UFFRMCNT_MASK)
#define EMAC_MTL_TXQ0_UNDERFLOW_UFCNTOVF        (1 << 11) /* Bit 11: Overflow Bit for Underflow Packet Counter */

/* MTL Tx Queue 0 Debug (MTL_TXQ0_DEBUG) */
#define EMAC_MTL_TXQ0_DEBUG_TXQPAUSED      (1 << 0) /* Bit 0: Transmit Queue in Pause */
#define EMAC_MTL_TXQ0_DEBUG_TRCSTS_SHIFT   (1)      /* Bits 1-3: MTL Tx Queue Read Controller Status */
#define EMAC_MTL_TXQ0_DEBUG_TRCSTS_MASK    (0x3 << EMAC_MTL_TXQ0_DEBUG_TRCSTS_SHIFT)
#define EMAC_MTL_TXQ0_DEBUG_TRCSTS(n)      (((n) << EMAC_MTL_TXQ0_DEBUG_TRCSTS_SHIFT) & EMAC_MTL_TXQ0_DEBUG_TRCSTS_MASK)
#define EMAC_MTL_TXQ0_DEBUG_TWCSTS         (1 << 3) /* Bit 3: MTL Tx Queue Write Controller Status */
#define EMAC_MTL_TXQ0_DEBUG_TXQSTS         (1 << 4) /* Bit 4: MTL Tx Queue Not Empty Status */
#define EMAC_MTL_TXQ0_DEBUG_TXSTSFSTS      (1 << 5) /* Bit 5: MTL Tx Status FIFO Full Status */
#define EMAC_MTL_TXQ0_DEBUG_PTXQ_SHIFT     (16)     /* Bits 16-19: Number of Packets in the Transmit Queue */
#define EMAC_MTL_TXQ0_DEBUG_PTXQ_MASK      (0x7 << EMAC_MTL_TXQ0_DEBUG_PTXQ_SHIFT)
#define EMAC_MTL_TXQ0_DEBUG_PTXQ(n)        (((n) << EMAC_MTL_TXQ0_DEBUG_PTXQ_SHIFT) & EMAC_MTL_TXQ0_DEBUG_PTXQ_MASK)
#define EMAC_MTL_TXQ0_DEBUG_STXSTSF_SHIFT  (20) /* Bits 20-23: Number of Status Words in Tx Status FIFO of Queue */
#define EMAC_MTL_TXQ0_DEBUG_STXSTSF_MASK   (0x7 << EMAC_MTL_TXQ0_DEBUG_STXSTSF_SHIFT)
#define EMAC_MTL_TXQ0_DEBUG_STXSTSF(n)     (((n) << EMAC_MTL_TXQ0_DEBUG_STXSTSF_SHIFT) & EMAC_MTL_TXQ0_DEBUG_STXSTSF_MASK)

