apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_emac.h
/* MTL Tx Queue 0 ETS Status (MTL_TXQ0_ETS_STATUS) */
#define EMAC_MTL_TXQ0_ETS_STATUS_ABS_SHIFT  (0) /* Bits 0-24: Average Bits per Slot */
#define EMAC_MTL_TXQ0_ETS_STATUS_ABS_MASK   (0xffffff << EMAC_MTL_TXQ0_ETS_STATUS_ABS_SHIFT)
#define EMAC_MTL_TXQ0_ETS_STATUS_ABS(n)     (((n) << EMAC_MTL_TXQ0_ETS_STATUS_ABS_SHIFT) & EMAC_MTL_TXQ0_ETS_STATUS_ABS_MASK)

/* MTL Tx Queue Quantum Weight (MTL_TXQ0_QUANTUM_WEIGHT) */
#define EMAC_MTL_TXQ0_QUANTUM_WEIGHT_ISCQW_SHIFT  (0) /* Bits 0-21: Quantum or Weights */
#define EMAC_MTL_TXQ0_QUANTUM_WEIGHT_ISCQW_MASK   (0x1fffff << EMAC_MTL_TXQ0_QUANTUM_WEIGHT_ISCQW_SHIFT)
#define EMAC_MTL_TXQ0_QUANTUM_WEIGHT_ISCQW(n)     (((n) << EMAC_MTL_TXQ0_QUANTUM_WEIGHT_ISCQW_SHIFT) & EMAC_MTL_TXQ0_QUANTUM_WEIGHT_ISCQW_MASK)

/* MTL Queue 0 Interrupt Control Status (MTL_Q0_INTERRUPT_CONTROL_STATUS) */
#define EMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_TXUNFIS  (1 << 0)  /* Bit 0: Transmit Queue Underflow Interrupt Status */
#define EMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_ABPSIS   (1 << 1)  /* Bit 1: Average Bits Per Slot Interrupt Status */
#define EMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_TXUIE    (1 << 8)  /* Bit 8: Transmit Queue Underflow Interrupt Enable */
#define EMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_ABPSIE   (1 << 9)  /* Bit 9: Average Bits Per Slot Interrupt Enable */
#define EMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_RXOVFIS  (1 << 16) /* Bit 16: Receive Queue Overflow Interrupt Status */
#define EMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_RXOIE    (1 << 24) /* Bit 24: Receive Queue Overflow Interrupt Enable */

/* MTL Rx Queue 0 Operation Mode (MTL_RXQ0_OPERATION_MODE) */
#define EMAC_MTL_RXQ0_OPERATION_MODE_RTC_SHIFT   (0) /* Bits 0-2: Receive Queue Threshold Control */
#define EMAC_MTL_RXQ0_OPERATION_MODE_RTC_MASK    (0x3 << EMAC_MTL_RXQ0_OPERATION_MODE_RTC_SHIFT)
#define EMAC_MTL_RXQ0_OPERATION_MODE_RTC(n)      (((n) << EMAC_MTL_RXQ0_OPERATION_MODE_RTC_SHIFT) & EMAC_MTL_RXQ0_OPERATION_MODE_RTC_MASK)
#define EMAC_MTL_RXQ0_OPERATION_MODE_FUP         (1 << 3) /* Bit 3: Forward Undersized Good Packets */
#define EMAC_MTL_RXQ0_OPERATION_MODE_FEP         (1 << 4) /* Bit 4: Forward Error Packets */
#define EMAC_MTL_RXQ0_OPERATION_MODE_RSF         (1 << 5) /* Bit 5: Receive Queue Store and Forward */
#define EMAC_MTL_RXQ0_OPERATION_MODE_DIS_TCP_EF  (1 << 6) /* Bit 6: Disable Dropping of TCP/IP Checksum Error Packets */
#define EMAC_MTL_RXQ0_OPERATION_MODE_EHFC        (1 << 7) /* Bit 7: Enable Hardware Flow Control */
#define EMAC_MTL_RXQ0_OPERATION_MODE_RFA_SHIFT   (8)      /* Bits 8-12: Threshold for Activating Flow Control (in half-duplex and full-duplex) */
#define EMAC_MTL_RXQ0_OPERATION_MODE_RFA_MASK    (0xf << EMAC_MTL_RXQ0_OPERATION_MODE_RFA_SHIFT)
#define EMAC_MTL_RXQ0_OPERATION_MODE_RFA(n)      (((n) << EMAC_MTL_RXQ0_OPERATION_MODE_RFA_SHIFT) & EMAC_MTL_RXQ0_OPERATION_MODE_RFA_MASK)
#define EMAC_MTL_RXQ0_OPERATION_MODE_RFD_SHIFT   (14) /* Bits 14-18: Threshold for Deactivating Flow Control (in half-duplex and full-duplex modes) */
#define EMAC_MTL_RXQ0_OPERATION_MODE_RFD_MASK    (0xf << EMAC_MTL_RXQ0_OPERATION_MODE_RFD_SHIFT)
#define EMAC_MTL_RXQ0_OPERATION_MODE_RFD(n)      (((n) << EMAC_MTL_RXQ0_OPERATION_MODE_RFD_SHIFT) & EMAC_MTL_RXQ0_OPERATION_MODE_RFD_MASK)
#define EMAC_MTL_RXQ0_OPERATION_MODE_RQS_SHIFT   (20) /* Bits 20-25: Receive Queue Size */
#define EMAC_MTL_RXQ0_OPERATION_MODE_RQS_MASK    (0x1f << EMAC_MTL_RXQ0_OPERATION_MODE_RQS_SHIFT)
#define EMAC_MTL_RXQ0_OPERATION_MODE_RQS(n)      (((n) << EMAC_MTL_RXQ0_OPERATION_MODE_RQS_SHIFT) & EMAC_MTL_RXQ0_OPERATION_MODE_RQS_MASK)

/* MTL Rx Queue Missed Packet Overflow Count
 * (MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT)
 */

#define EMAC_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_OVFPKTCNT_SHIFT  (0) /* Bits 0-11: Overflow Packet Counter */
#define EMAC_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_OVFPKTCNT_MASK   (0x7ff << EMAC_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_OVFPKTCNT_SHIFT)
#define EMAC_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_OVFPKTCNT(n)     (((n) << EMAC_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_OVFPKTCNT_SHIFT) & EMAC_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_OVFPKTCNT_MASK)
#define EMAC_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_OVFCNTOVF        (1 << 11) /* Bit 11: Overflow Counter Overflow Bit */
#define EMAC_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_MISPKTCNT_SHIFT  (16)      /* Bits 16-27: Missed Packet Counter */
#define EMAC_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_MISPKTCNT_MASK   (0x7ff << EMAC_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_MISPKTCNT_SHIFT)
#define EMAC_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_MISPKTCNT(n)     (((n) << EMAC_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_MISPKTCNT_SHIFT) & EMAC_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_MISPKTCNT_MASK)
#define EMAC_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_MISCNTOVF        (1 << 27) /* Bit 27: Missed Packet Counter Overflow Bit */

/* MTL Rx Queue 0 Debug (MTL_RXQ0_DEBUG) */
#define EMAC_MTL_RXQ0_DEBUG_RWCSTS        (1 << 0) /* Bit 0: MTL Rx Queue Write Controller Active Status */
#define EMAC_MTL_RXQ0_DEBUG_RRCSTS_SHIFT  (1)      /* Bits 1-3: MTL Rx Queue Read Controller State */
#define EMAC_MTL_RXQ0_DEBUG_RRCSTS_MASK   (0x3 << EMAC_MTL_RXQ0_DEBUG_RRCSTS_SHIFT)
#define EMAC_MTL_RXQ0_DEBUG_RRCSTS(n)     (((n) << EMAC_MTL_RXQ0_DEBUG_RRCSTS_SHIFT) & EMAC_MTL_RXQ0_DEBUG_RRCSTS_MASK)
#define EMAC_MTL_RXQ0_DEBUG_RXQSTS_SHIFT  (4) /* Bits 4-6: MTL Rx Queue Fill-Level Status */
#define EMAC_MTL_RXQ0_DEBUG_RXQSTS_MASK   (0x3 << EMAC_MTL_RXQ0_DEBUG_RXQSTS_SHIFT)
#define EMAC_MTL_RXQ0_DEBUG_RXQSTS(n)     (((n) << EMAC_MTL_RXQ0_DEBUG_RXQSTS_SHIFT) & EMAC_MTL_RXQ0_DEBUG_RXQSTS_MASK)
#define EMAC_MTL_RXQ0_DEBUG_PRXQ_SHIFT    (16) /* Bits 16-30: Number of Packets in Receive Queue */
#define EMAC_MTL_RXQ0_DEBUG_PRXQ_MASK     (0x3fff << EMAC_MTL_RXQ0_DEBUG_PRXQ_SHIFT)
#define EMAC_MTL_RXQ0_DEBUG_PRXQ(n)       (((n) << EMAC_MTL_RXQ0_DEBUG_PRXQ_SHIFT) & EMAC_MTL_RXQ0_DEBUG_PRXQ_MASK)

/* MTL Rx Queue 0 Control 0 (MTL_RXQ0_CONTROL) */
#define EMAC_MTL_RXQ0_CONTROL_RXQ_WEGT_SHIFT  (0) /* Bits 0-3: Receive Queue Weight */
#define EMAC_MTL_RXQ0_CONTROL_RXQ_WEGT_MASK   (0x7 << EMAC_MTL_RXQ0_CONTROL_RXQ_WEGT_SHIFT)
#define EMAC_MTL_RXQ0_CONTROL_RXQ_WEGT(n)     (((n) << EMAC_MTL_RXQ0_CONTROL_RXQ_WEGT_SHIFT) & EMAC_MTL_RXQ0_CONTROL_RXQ_WEGT_MASK)
#define EMAC_MTL_RXQ0_CONTROL_RXQ_FRM_ARBIT   (1 << 3) /* Bit 3: Receive Queue Packet Arbitration */

/* MTL Tx Queue 1 Operation Mode (MTL_TXQ1_OPERATION_MODE) */
#define EMAC_MTL_TXQ1_OPERATION_MODE_FTQ          (1 << 0) /* Bit 0: Flush Transmit Queue */
#define EMAC_MTL_TXQ1_OPERATION_MODE_TSF          (1 << 1) /* Bit 1: Transmit Store and Forward */
#define EMAC_MTL_TXQ1_OPERATION_MODE_TXQEN_SHIFT  (2)      /* Bits 2-4: Transmit Queue Enable */
#define EMAC_MTL_TXQ1_OPERATION_MODE_TXQEN_MASK   (0x3 << EMAC_MTL_TXQ1_OPERATION_MODE_TXQEN_SHIFT)
#define EMAC_MTL_TXQ1_OPERATION_MODE_TXQEN(n)     (((n) << EMAC_MTL_TXQ1_OPERATION_MODE_TXQEN_SHIFT) & EMAC_MTL_TXQ1_OPERATION_MODE_TXQEN_MASK)
#define EMAC_MTL_TXQ1_OPERATION_MODE_TTC_SHIFT    (4) /* Bits 4-7: Transmit Threshold Control */
#define EMAC_MTL_TXQ1_OPERATION_MODE_TTC_MASK     (0x7 << EMAC_MTL_TXQ1_OPERATION_MODE_TTC_SHIFT)
#define EMAC_MTL_TXQ1_OPERATION_MODE_TTC(n)       (((n) << EMAC_MTL_TXQ1_OPERATION_MODE_TTC_SHIFT) & EMAC_MTL_TXQ1_OPERATION_MODE_TTC_MASK)
#define EMAC_MTL_TXQ1_OPERATION_MODE_TQS_SHIFT    (16) /* Bits 16-21: Transmit Queue Size */
#define EMAC_MTL_TXQ1_OPERATION_MODE_TQS_MASK     (0x1f << EMAC_MTL_TXQ1_OPERATION_MODE_TQS_SHIFT)
#define EMAC_MTL_TXQ1_OPERATION_MODE_TQS(n)       (((n) << EMAC_MTL_TXQ1_OPERATION_MODE_TQS_SHIFT) & EMAC_MTL_TXQ1_OPERATION_MODE_TQS_MASK)

/* MTL Tx Queue 1 Underflow (MTL_TXQ1_UNDERFLOW) */
#define EMAC_MTL_TXQ1_UNDERFLOW_UFFRMCNT_SHIFT  (0) /* Bits 0-11: Underflow Packet Counter */
#define EMAC_MTL_TXQ1_UNDERFLOW_UFFRMCNT_MASK   (0x7ff << EMAC_MTL_TXQ1_UNDERFLOW_UFFRMCNT_SHIFT)
#define EMAC_MTL_TXQ1_UNDERFLOW_UFFRMCNT(n)     (((n) << EMAC_MTL_TXQ1_UNDERFLOW_UFFRMCNT_SHIFT) & EMAC_MTL_TXQ1_UNDERFLOW_UFFRMCNT_MASK)
#define EMAC_MTL_TXQ1_UNDERFLOW_UFCNTOVF        (1 << 11) /* Bit 11: Overflow Bit for Underflow Packet Counter */

/* MTL Tx Queue 1 Debug (MTL_TXQ1_DEBUG) */
#define EMAC_MTL_TXQ1_DEBUG_TXQPAUSED      (1 << 0) /* Bit 0: Transmit Queue in Pause */
#define EMAC_MTL_TXQ1_DEBUG_TRCSTS_SHIFT   (1)      /* Bits 1-3: MTL Tx Queue Read Controller Status */
#define EMAC_MTL_TXQ1_DEBUG_TRCSTS_MASK    (0x3 << EMAC_MTL_TXQ1_DEBUG_TRCSTS_SHIFT)
#define EMAC_MTL_TXQ1_DEBUG_TRCSTS(n)      (((n) << EMAC_MTL_TXQ1_DEBUG_TRCSTS_SHIFT) & EMAC_MTL_TXQ1_DEBUG_TRCSTS_MASK)
#define EMAC_MTL_TXQ1_DEBUG_TWCSTS         (1 << 3) /* Bit 3: MTL Tx Queue Write Controller Status */
#define EMAC_MTL_TXQ1_DEBUG_TXQSTS         (1 << 4) /* Bit 4: MTL Tx Queue Not Empty Status */
#define EMAC_MTL_TXQ1_DEBUG_TXSTSFSTS      (1 << 5) /* Bit 5: MTL Tx Status FIFO Full Status */
#define EMAC_MTL_TXQ1_DEBUG_PTXQ_SHIFT     (16)     /* Bits 16-19: Number of Packets in the Transmit Queue */
#define EMAC_MTL_TXQ1_DEBUG_PTXQ_MASK      (0x7 << EMAC_MTL_TXQ1_DEBUG_PTXQ_SHIFT)
#define EMAC_MTL_TXQ1_DEBUG_PTXQ(n)        (((n) << EMAC_MTL_TXQ1_DEBUG_PTXQ_SHIFT) & EMAC_MTL_TXQ1_DEBUG_PTXQ_MASK)
#define EMAC_MTL_TXQ1_DEBUG_STXSTSF_SHIFT  (20) /* Bits 20-23: Number of Status Words in Tx Status FIFO of Queue */
#define EMAC_MTL_TXQ1_DEBUG_STXSTSF_MASK   (0x7 << EMAC_MTL_TXQ1_DEBUG_STXSTSF_SHIFT)
#define EMAC_MTL_TXQ1_DEBUG_STXSTSF(n)     (((n) << EMAC_MTL_TXQ1_DEBUG_STXSTSF_SHIFT) & EMAC_MTL_TXQ1_DEBUG_STXSTSF_MASK)

