apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_emac.h
/* MTL Tx Queue 1 ETS Control (MTL_TXQ1_ETS_CONTROL) */
#define EMAC_MTL_TXQ1_ETS_CONTROL_AVALG      (1 << 2) /* Bit 2: AV Algorithm */
#define EMAC_MTL_TXQ1_ETS_CONTROL_CC         (1 << 3) /* Bit 3: Credit Control */
#define EMAC_MTL_TXQ1_ETS_CONTROL_SLC_SHIFT  (4)      /* Bits 4-7: Slot Count */
#define EMAC_MTL_TXQ1_ETS_CONTROL_SLC_MASK   (0x7 << EMAC_MTL_TXQ1_ETS_CONTROL_SLC_SHIFT)
#define EMAC_MTL_TXQ1_ETS_CONTROL_SLC(n)     (((n) << EMAC_MTL_TXQ1_ETS_CONTROL_SLC_SHIFT) & EMAC_MTL_TXQ1_ETS_CONTROL_SLC_MASK)

/* MTL Tx Queue 1 ETS Status (MTL_TXQ1_ETS_STATUS) */
#define EMAC_MTL_TXQ1_ETS_STATUS_ABS_SHIFT  (0) /* Bits 0-24: Average Bits per Slot */
#define EMAC_MTL_TXQ1_ETS_STATUS_ABS_MASK   (0xffffff << EMAC_MTL_TXQ1_ETS_STATUS_ABS_SHIFT)
#define EMAC_MTL_TXQ1_ETS_STATUS_ABS(n)     (((n) << EMAC_MTL_TXQ1_ETS_STATUS_ABS_SHIFT) & EMAC_MTL_TXQ1_ETS_STATUS_ABS_MASK)

/* MTL Tx Queue 1 Quantum Weight (MTL_TXQ1_QUANTUM_WEIGHT) */
#define EMAC_MTL_TXQ1_QUANTUM_WEIGHT_ISCQW_SHIFT  (0) /* Bits 0-21: idleSlopeCredit, Quantum or Weights */
#define EMAC_MTL_TXQ1_QUANTUM_WEIGHT_ISCQW_MASK   (0x1fffff << EMAC_MTL_TXQ1_QUANTUM_WEIGHT_ISCQW_SHIFT)
#define EMAC_MTL_TXQ1_QUANTUM_WEIGHT_ISCQW(n)     (((n) << EMAC_MTL_TXQ1_QUANTUM_WEIGHT_ISCQW_SHIFT) & EMAC_MTL_TXQ1_QUANTUM_WEIGHT_ISCQW_MASK)

/* MTL Tx Queue 1 Sendslope Credit (MTL_TXQ1_SENDSLOPECREDIT) */
#define EMAC_MTL_TXQ1_SENDSLOPECREDIT_SSC_SHIFT  (0) /* Bits 0-14: sendSlopeCredit Value */
#define EMAC_MTL_TXQ1_SENDSLOPECREDIT_SSC_MASK   (0x3fff << EMAC_MTL_TXQ1_SENDSLOPECREDIT_SSC_SHIFT)
#define EMAC_MTL_TXQ1_SENDSLOPECREDIT_SSC(n)     (((n) << EMAC_MTL_TXQ1_SENDSLOPECREDIT_SSC_SHIFT) & EMAC_MTL_TXQ1_SENDSLOPECREDIT_SSC_MASK)

/* MTL Tx Queue 1 HiCredit (MTL_TXQ1_HICREDIT) */
#define EMAC_MTL_TXQ1_HICREDIT_HC_SHIFT  (0) /* Bits 0-29: hiCredit Value */
#define EMAC_MTL_TXQ1_HICREDIT_HC_MASK   (0x1fffffff << EMAC_MTL_TXQ1_HICREDIT_HC_SHIFT)
#define EMAC_MTL_TXQ1_HICREDIT_HC(n)     (((n) << EMAC_MTL_TXQ1_HICREDIT_HC_SHIFT) & EMAC_MTL_TXQ1_HICREDIT_HC_MASK)

/* MTL Tx Queue 1 LoCredit (MTL_TXQ1_LOCREDIT) */
#define EMAC_MTL_TXQ1_LOCREDIT_LC_SHIFT  (0) /* Bits 0-29: loCredit Value */
#define EMAC_MTL_TXQ1_LOCREDIT_LC_MASK   (0x1fffffff << EMAC_MTL_TXQ1_LOCREDIT_LC_SHIFT)
#define EMAC_MTL_TXQ1_LOCREDIT_LC(n)     (((n) << EMAC_MTL_TXQ1_LOCREDIT_LC_SHIFT) & EMAC_MTL_TXQ1_LOCREDIT_LC_MASK)

/* MTL Queue 1 Interrupt Control Status (MTL_Q1_INTERRUPT_CONTROL_STATUS) */
#define EMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_TXUNFIS  (1 << 0)  /* Bit 0: Transmit Queue Underflow Interrupt Status */
#define EMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_ABPSIS   (1 << 1)  /* Bit 1: Average Bits Per Slot Interrupt Status */
#define EMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_TXUIE    (1 << 8)  /* Bit 8: Transmit Queue Underflow Interrupt Enable */
#define EMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_ABPSIE   (1 << 9)  /* Bit 9: Average Bits Per Slot Interrupt Enable */
#define EMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_RXOVFIS  (1 << 16) /* Bit 16: Receive Queue Overflow Interrupt Status */
#define EMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_RXOIE    (1 << 24) /* Bit 24: Receive Queue Overflow Interrupt Enable */

/* MTL Rx Queue 1 Operation Mode (MTL_RXQ1_OPERATION_MODE) */
#define EMAC_MTL_RXQ1_OPERATION_MODE_RTC_SHIFT   (0) /* Bits 0-2: Receive Queue Threshold Control */
#define EMAC_MTL_RXQ1_OPERATION_MODE_RTC_MASK    (0x3 << EMAC_MTL_RXQ1_OPERATION_MODE_RTC_SHIFT)
#define EMAC_MTL_RXQ1_OPERATION_MODE_RTC(n)      (((n) << EMAC_MTL_RXQ1_OPERATION_MODE_RTC_SHIFT) & EMAC_MTL_RXQ1_OPERATION_MODE_RTC_MASK)
#define EMAC_MTL_RXQ1_OPERATION_MODE_FUP         (1 << 3) /* Bit 3: Forward Undersized Good Packets */
#define EMAC_MTL_RXQ1_OPERATION_MODE_FEP         (1 << 4) /* Bit 4: Forward Error Packets */
#define EMAC_MTL_RXQ1_OPERATION_MODE_RSF         (1 << 5) /* Bit 5: Receive Queue Store and Forward */
#define EMAC_MTL_RXQ1_OPERATION_MODE_DIS_TCP_EF  (1 << 6) /* Bit 6: Disable Dropping of TCP or IP Checksum Error Packets */
#define EMAC_MTL_RXQ1_OPERATION_MODE_EHFC        (1 << 7) /* Bit 7: Enable Hardware Flow Control */
#define EMAC_MTL_RXQ1_OPERATION_MODE_RFA_SHIFT   (8)      /* Bits 8-12: Threshold for Activating Flow Control (in half-duplex and full-duplex */
#define EMAC_MTL_RXQ1_OPERATION_MODE_RFA_MASK    (0xf << EMAC_MTL_RXQ1_OPERATION_MODE_RFA_SHIFT)
#define EMAC_MTL_RXQ1_OPERATION_MODE_RFA(n)      (((n) << EMAC_MTL_RXQ1_OPERATION_MODE_RFA_SHIFT) & EMAC_MTL_RXQ1_OPERATION_MODE_RFA_MASK)
#define EMAC_MTL_RXQ1_OPERATION_MODE_RFD_SHIFT   (14) /* Bits 14-18: Threshold for Deactivating Flow Control (in half-duplex and full-duplex modes) */
#define EMAC_MTL_RXQ1_OPERATION_MODE_RFD_MASK    (0xf << EMAC_MTL_RXQ1_OPERATION_MODE_RFD_SHIFT)
#define EMAC_MTL_RXQ1_OPERATION_MODE_RFD(n)      (((n) << EMAC_MTL_RXQ1_OPERATION_MODE_RFD_SHIFT) & EMAC_MTL_RXQ1_OPERATION_MODE_RFD_MASK)
#define EMAC_MTL_RXQ1_OPERATION_MODE_RQS_SHIFT   (20) /* Bits 20-25: Receive Queue Size */
#define EMAC_MTL_RXQ1_OPERATION_MODE_RQS_MASK    (0x1f << EMAC_MTL_RXQ1_OPERATION_MODE_RQS_SHIFT)
#define EMAC_MTL_RXQ1_OPERATION_MODE_RQS(n)      (((n) << EMAC_MTL_RXQ1_OPERATION_MODE_RQS_SHIFT) & EMAC_MTL_RXQ1_OPERATION_MODE_RQS_MASK)

/* MTL Rx Queue 1 Missed Packet Overflow Counter
 * (MTL_RXQ1_MISSED_PACKET_OVERFLOW_CNT)
 */

#define EMAC_MTL_RXQ1_MISSED_PACKET_OVERFLOW_CNT_OVFPKTCNT_SHIFT  (0) /* Bits 0-11: Overflow Packet Counter */
#define EMAC_MTL_RXQ1_MISSED_PACKET_OVERFLOW_CNT_OVFPKTCNT_MASK   (0x7ff << EMAC_MTL_RXQ1_MISSED_PACKET_OVERFLOW_CNT_OVFPKTCNT_SHIFT)
#define EMAC_MTL_RXQ1_MISSED_PACKET_OVERFLOW_CNT_OVFPKTCNT(n)     (((n) << EMAC_MTL_RXQ1_MISSED_PACKET_OVERFLOW_CNT_OVFPKTCNT_SHIFT) & EMAC_MTL_RXQ1_MISSED_PACKET_OVERFLOW_CNT_OVFPKTCNT_MASK)
#define EMAC_MTL_RXQ1_MISSED_PACKET_OVERFLOW_CNT_OVFCNTOVF        (1 << 11) /* Bit 11: Overflow Counter Overflow Bit */
#define EMAC_MTL_RXQ1_MISSED_PACKET_OVERFLOW_CNT_MISPKTCNT_SHIFT  (16)      /* Bits 16-27: Missed Packet Counter */
#define EMAC_MTL_RXQ1_MISSED_PACKET_OVERFLOW_CNT_MISPKTCNT_MASK   (0x7ff << EMAC_MTL_RXQ1_MISSED_PACKET_OVERFLOW_CNT_MISPKTCNT_SHIFT)
#define EMAC_MTL_RXQ1_MISSED_PACKET_OVERFLOW_CNT_MISPKTCNT(n)     (((n) << EMAC_MTL_RXQ1_MISSED_PACKET_OVERFLOW_CNT_MISPKTCNT_SHIFT) & EMAC_MTL_RXQ1_MISSED_PACKET_OVERFLOW_CNT_MISPKTCNT_MASK)
#define EMAC_MTL_RXQ1_MISSED_PACKET_OVERFLOW_CNT_MISCNTOVF        (1 << 27) /* Bit 27: Missed Packet Counter Overflow Bit */

