apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_emac.h
/* MTL Rx Queue 1 Debug (MTL_RXQ1_DEBUG) */
#define EMAC_MTL_RXQ1_DEBUG_RWCSTS        (1 << 0) /* Bit 0: MTL Rx Queue Write Controller Active Status */
#define EMAC_MTL_RXQ1_DEBUG_RRCSTS_SHIFT  (1)      /* Bits 1-3: MTL Rx Queue Read Controller State */
#define EMAC_MTL_RXQ1_DEBUG_RRCSTS_MASK   (0x3 << EMAC_MTL_RXQ1_DEBUG_RRCSTS_SHIFT)
#define EMAC_MTL_RXQ1_DEBUG_RRCSTS(n)     (((n) << EMAC_MTL_RXQ1_DEBUG_RRCSTS_SHIFT) & EMAC_MTL_RXQ1_DEBUG_RRCSTS_MASK)
#define EMAC_MTL_RXQ1_DEBUG_RXQSTS_SHIFT  (4) /* Bits 4-6: MTL Rx Queue Fill-Level Status */
#define EMAC_MTL_RXQ1_DEBUG_RXQSTS_MASK   (0x3 << EMAC_MTL_RXQ1_DEBUG_RXQSTS_SHIFT)
#define EMAC_MTL_RXQ1_DEBUG_RXQSTS(n)     (((n) << EMAC_MTL_RXQ1_DEBUG_RXQSTS_SHIFT) & EMAC_MTL_RXQ1_DEBUG_RXQSTS_MASK)
#define EMAC_MTL_RXQ1_DEBUG_PRXQ_SHIFT    (16) /* Bits 16-30: Number of Packets in Receive Queue */
#define EMAC_MTL_RXQ1_DEBUG_PRXQ_MASK     (0x3fff << EMAC_MTL_RXQ1_DEBUG_PRXQ_SHIFT)
#define EMAC_MTL_RXQ1_DEBUG_PRXQ(n)       (((n) << EMAC_MTL_RXQ1_DEBUG_PRXQ_SHIFT) & EMAC_MTL_RXQ1_DEBUG_PRXQ_MASK)

/* MTL Rx Queue 1 Control (MTL_RXQ1_CONTROL) */
#define EMAC_MTL_RXQ1_CONTROL_RXQ_WEGT_SHIFT  (0) /* Bits 0-3: Receive Queue Weight */
#define EMAC_MTL_RXQ1_CONTROL_RXQ_WEGT_MASK   (0x7 << EMAC_MTL_RXQ1_CONTROL_RXQ_WEGT_SHIFT)
#define EMAC_MTL_RXQ1_CONTROL_RXQ_WEGT(n)     (((n) << EMAC_MTL_RXQ1_CONTROL_RXQ_WEGT_SHIFT) & EMAC_MTL_RXQ1_CONTROL_RXQ_WEGT_MASK)
#define EMAC_MTL_RXQ1_CONTROL_RXQ_FRM_ARBIT   (1 << 3) /* Bit 3: Receive Queue Packet Arbitration */

/* DMA Mode (DMA_MODE) */
#define EMAC_DMA_MODE_SWR         (1 << 0) /* Bit 0: Software Reset */
#define EMAC_DMA_MODE_DA          (1 << 1) /* Bit 1: DMA Tx or Rx Arbitration Scheme */
#define EMAC_DMA_MODE_TAA_SHIFT   (2)      /* Bits 2-5: Transmit Arbitration Algorithm */
#define EMAC_DMA_MODE_TAA_MASK    (0x7 << EMAC_DMA_MODE_TAA_SHIFT)
#define EMAC_DMA_MODE_TAA(n)      (((n) << EMAC_DMA_MODE_TAA_SHIFT) & EMAC_DMA_MODE_TAA_MASK)
#define EMAC_DMA_MODE_ARBC        (1 << 9)  /* Bit 9: Is reserved for NXP internal use */
#define EMAC_DMA_MODE_TXPR        (1 << 11) /* Bit 11: Transmit Priority */
#define EMAC_DMA_MODE_PR_SHIFT    (12)      /* Bits 12-15: Priority Ratio */
#define EMAC_DMA_MODE_PR_MASK     (0x7 << EMAC_DMA_MODE_PR_SHIFT)
#define EMAC_DMA_MODE_PR(n)       (((n) << EMAC_DMA_MODE_PR_SHIFT) & EMAC_DMA_MODE_PR_MASK)
#define EMAC_DMA_MODE_INTM_SHIFT  (16) /* Bits 16-18: Interrupt Mode */
#define EMAC_DMA_MODE_INTM_MASK   (0x3 << EMAC_DMA_MODE_INTM_SHIFT)
#define EMAC_DMA_MODE_INTM(n)     (((n) << EMAC_DMA_MODE_INTM_SHIFT) & EMAC_DMA_MODE_INTM_MASK)

/* DMA System Bus Mode (DMA_SYSBUS_MODE) */
#define EMAC_DMA_SYSBUS_MODE_FB   (1 << 0)  /* Bit 0: Fixed Burst Length */
#define EMAC_DMA_SYSBUS_MODE_AAL  (1 << 12) /* Bit 12: Address-Aligned Beats */
#define EMAC_DMA_SYSBUS_MODE_MB   (1 << 14) /* Bit 14: Mixed Burst */
#define EMAC_DMA_SYSBUS_MODE_RB   (1 << 15) /* Bit 15: Rebuild INCRx Burst */

/* DMA Interrupt Status (DMA_INTERRUPT_STATUS) */
#define EMAC_DMA_INTERRUPT_STATUS_DC0IS  (1 << 0)  /* Bit 0: DMA Channel 0 Interrupt Status */
#define EMAC_DMA_INTERRUPT_STATUS_DC1IS  (1 << 1)  /* Bit 1: DMA Channel 1 Interrupt Status */
#define EMAC_DMA_INTERRUPT_STATUS_MTLIS  (1 << 16) /* Bit 16: MTL Interrupt Status */
#define EMAC_DMA_INTERRUPT_STATUS_MACIS  (1 << 17) /* Bit 17: MAC Interrupt Status */

/* DMA Debug Status 0 (DMA_DEBUG_STATUS0) */
#define EMAC_DMA_DEBUG_STATUS0_AXWHSTS     (1 << 0) /* Bit 0: AHB Master Status */
#define EMAC_DMA_DEBUG_STATUS0_RPS0_SHIFT  (8)      /* Bits 8-12: DMA Channel 0 Receive Process State */
#define EMAC_DMA_DEBUG_STATUS0_RPS0_MASK   (0xf << EMAC_DMA_DEBUG_STATUS0_RPS0_SHIFT)
#define EMAC_DMA_DEBUG_STATUS0_RPS0(n)     (((n) << EMAC_DMA_DEBUG_STATUS0_RPS0_SHIFT) & EMAC_DMA_DEBUG_STATUS0_RPS0_MASK)
#define EMAC_DMA_DEBUG_STATUS0_TPS0_SHIFT  (12) /* Bits 12-16: DMA Channel 0 Transmit Process State */
#define EMAC_DMA_DEBUG_STATUS0_TPS0_MASK   (0xf << EMAC_DMA_DEBUG_STATUS0_TPS0_SHIFT)
#define EMAC_DMA_DEBUG_STATUS0_TPS0(n)     (((n) << EMAC_DMA_DEBUG_STATUS0_TPS0_SHIFT) & EMAC_DMA_DEBUG_STATUS0_TPS0_MASK)
#define EMAC_DMA_DEBUG_STATUS0_RPS1_SHIFT  (16) /* Bits 16-20: DMA Channel 1 Receive Process State */
#define EMAC_DMA_DEBUG_STATUS0_RPS1_MASK   (0xf << EMAC_DMA_DEBUG_STATUS0_RPS1_SHIFT)
#define EMAC_DMA_DEBUG_STATUS0_RPS1(n)     (((n) << EMAC_DMA_DEBUG_STATUS0_RPS1_SHIFT) & EMAC_DMA_DEBUG_STATUS0_RPS1_MASK)
#define EMAC_DMA_DEBUG_STATUS0_TPS1_SHIFT  (20) /* Bits 20-24: DMA Channel 1 Transmit Process State */
#define EMAC_DMA_DEBUG_STATUS0_TPS1_MASK   (0xf << EMAC_DMA_DEBUG_STATUS0_TPS1_SHIFT)
#define EMAC_DMA_DEBUG_STATUS0_TPS1(n)     (((n) << EMAC_DMA_DEBUG_STATUS0_TPS1_SHIFT) & EMAC_DMA_DEBUG_STATUS0_TPS1_MASK)

/* DMA TBS Control (DMA_TBS_CTRL) */
#define EMAC_DMA_TBS_CTRL_FTOV        (1 << 0) /* Bit 0: Fetch Time Offset Valid */
#define EMAC_DMA_TBS_CTRL_FGOS_SHIFT  (4)      /* Bits 4-7: Fetch GSN Offset */
#define EMAC_DMA_TBS_CTRL_FGOS_MASK   (0x7 << EMAC_DMA_TBS_CTRL_FGOS_SHIFT)
#define EMAC_DMA_TBS_CTRL_FGOS(n)     (((n) << EMAC_DMA_TBS_CTRL_FGOS_SHIFT) & EMAC_DMA_TBS_CTRL_FGOS_MASK)
#define EMAC_DMA_TBS_CTRL_FTOS_SHIFT  (8) /* Bits 8-32: Fetch Time Offset */
#define EMAC_DMA_TBS_CTRL_FTOS_MASK   (0xffffff << EMAC_DMA_TBS_CTRL_FTOS_SHIFT)
#define EMAC_DMA_TBS_CTRL_FTOS(n)     (((n) << EMAC_DMA_TBS_CTRL_FTOS_SHIFT) & EMAC_DMA_TBS_CTRL_FTOS_MASK)

/* DMA Safety Interrupt Status (DMA_SAFETY_INTERRUPT_STATUS) */
#define EMAC_DMA_SAFETY_INTERRUPT_STATUS_DECIS  (1 << 0)  /* Bit 0: DMA ECC Correctable Error Interrupt Status */
#define EMAC_DMA_SAFETY_INTERRUPT_STATUS_DEUIS  (1 << 1)  /* Bit 1: DMA ECC Uncorrectable Error Interrupt Status */
#define EMAC_DMA_SAFETY_INTERRUPT_STATUS_MSCIS  (1 << 28) /* Bit 28: MTL Safety Correctable Error Interrupt Status */
#define EMAC_DMA_SAFETY_INTERRUPT_STATUS_MSUIS  (1 << 29) /* Bit 29: MTL Safety Uncorrectable Error Interrupt Status */
#define EMAC_DMA_SAFETY_INTERRUPT_STATUS_MCSIS  (1 << 31) /* Bit 31: MAC Safety Uncorrectable Interrupt Status */

/* DMA Channel 0 Control (DMA_CH0_CONTROL) */
#define EMAC_DMA_CH0_CONTROL_PBLX8      (1 << 16) /* Bit 16: 8xPBL mode */
#define EMAC_DMA_CH0_CONTROL_DSL_SHIFT  (18)      /* Bits 18-21: Descriptor Skip Length */
#define EMAC_DMA_CH0_CONTROL_DSL_MASK   (0x7 << EMAC_DMA_CH0_CONTROL_DSL_SHIFT)
#define EMAC_DMA_CH0_CONTROL_DSL(n)     (((n) << EMAC_DMA_CH0_CONTROL_DSL_SHIFT) & EMAC_DMA_CH0_CONTROL_DSL_MASK)

/* DMA Channel Tx Control (DMA_CH0_TX_CONTROL) */
#define EMAC_DMA_CH0_TX_CONTROL_ST           (1 << 0) /* Bit 0: Start or Stop Transmission Command */
#define EMAC_DMA_CH0_TX_CONTROL_TCW_SHIFT    (1)      /* Bits 1-4: Transmit Channel Weight */
#define EMAC_DMA_CH0_TX_CONTROL_TCW_MASK     (0x7 << EMAC_DMA_CH0_TX_CONTROL_TCW_SHIFT)
#define EMAC_DMA_CH0_TX_CONTROL_TCW(n)       (((n) << EMAC_DMA_CH0_TX_CONTROL_TCW_SHIFT) & EMAC_DMA_CH0_TX_CONTROL_TCW_MASK)
#define EMAC_DMA_CH0_TX_CONTROL_OSF          (1 << 4) /* Bit 4: Operate on Second Packet */
#define EMAC_DMA_CH0_TX_CONTROL_TXPBL_SHIFT  (16)     /* Bits 16-22: Transmit Programmable Burst Length */
#define EMAC_DMA_CH0_TX_CONTROL_TXPBL_MASK   (0x3f << EMAC_DMA_CH0_TX_CONTROL_TXPBL_SHIFT)
#define EMAC_DMA_CH0_TX_CONTROL_TXPBL(n)     (((n) << EMAC_DMA_CH0_TX_CONTROL_TXPBL_SHIFT) & EMAC_DMA_CH0_TX_CONTROL_TXPBL_MASK)
#define EMAC_DMA_CH0_TX_CONTROL_ETIC         (1 << 22) /* Bit 22: Early Transmit Interrupt Control */
#define EMAC_DMA_CH0_TX_CONTROL_EDSE         (1 << 28) /* Bit 28: Enhanced Descriptor Enable */

