apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_emac.h
/* DMA Channel Rx Control (DMA_CH0_RX_CONTROL) */
#define EMAC_DMA_CH0_RX_CONTROL_SR               (1 << 0) /* Bit 0: Start or Stop Receive */
#define EMAC_DMA_CH0_RX_CONTROL_RBSZ_X_0_SHIFT   (1)      /* Bits 1-3: Receive Buffer size Low */
#define EMAC_DMA_CH0_RX_CONTROL_RBSZ_X_0_MASK    (0x3 << EMAC_DMA_CH0_RX_CONTROL_RBSZ_X_0_SHIFT)
#define EMAC_DMA_CH0_RX_CONTROL_RBSZ_X_0(n)      (((n) << EMAC_DMA_CH0_RX_CONTROL_RBSZ_X_0_SHIFT) & EMAC_DMA_CH0_RX_CONTROL_RBSZ_X_0_MASK)
#define EMAC_DMA_CH0_RX_CONTROL_RBSZ_13_Y_SHIFT  (3) /* Bits 3-15: Receive Buffer size High */
#define EMAC_DMA_CH0_RX_CONTROL_RBSZ_13_Y_MASK   (0xfff << EMAC_DMA_CH0_RX_CONTROL_RBSZ_13_Y_SHIFT)
#define EMAC_DMA_CH0_RX_CONTROL_RBSZ_13_Y(n)     (((n) << EMAC_DMA_CH0_RX_CONTROL_RBSZ_13_Y_SHIFT) & EMAC_DMA_CH0_RX_CONTROL_RBSZ_13_Y_MASK)
#define EMAC_DMA_CH0_RX_CONTROL_RXPBL_SHIFT      (16) /* Bits 16-22: Receive Programmable Burst Length */
#define EMAC_DMA_CH0_RX_CONTROL_RXPBL_MASK       (0x3f << EMAC_DMA_CH0_RX_CONTROL_RXPBL_SHIFT)
#define EMAC_DMA_CH0_RX_CONTROL_RXPBL(n)         (((n) << EMAC_DMA_CH0_RX_CONTROL_RXPBL_SHIFT) & EMAC_DMA_CH0_RX_CONTROL_RXPBL_MASK)
#define EMAC_DMA_CH0_RX_CONTROL_ERIC             (1 << 22) /* Bit 22: Early Receive Interrupt Control */
#define EMAC_DMA_CH0_RX_CONTROL_RPF              (1 << 31) /* Bit 31: Rx Packet Flush */

/* DMA Channel 0 Tx Descriptor List Address (DMA_CH0_TXDESC_LIST_ADDRESS) */
#define EMAC_DMA_CH0_TXDESC_LIST_ADDRESS_TDESLA_SHIFT  (2) /* Bits 2-32: Start of Transmit List */
#define EMAC_DMA_CH0_TXDESC_LIST_ADDRESS_TDESLA_MASK   (0x3fffffff << EMAC_DMA_CH0_TXDESC_LIST_ADDRESS_TDESLA_SHIFT)
#define EMAC_DMA_CH0_TXDESC_LIST_ADDRESS_TDESLA(n)     (((n) << EMAC_DMA_CH0_TXDESC_LIST_ADDRESS_TDESLA_SHIFT) & EMAC_DMA_CH0_TXDESC_LIST_ADDRESS_TDESLA_MASK)

/* DMA Channel 0 Rx Descriptor List Address (DMA_CH0_RXDESC_LIST_ADDRESS) */
#define EMAC_DMA_CH0_RXDESC_LIST_ADDRESS_RDESLA_SHIFT  (2) /* Bits 2-32: Start of Receive List */
#define EMAC_DMA_CH0_RXDESC_LIST_ADDRESS_RDESLA_MASK   (0x3fffffff << EMAC_DMA_CH0_RXDESC_LIST_ADDRESS_RDESLA_SHIFT)
#define EMAC_DMA_CH0_RXDESC_LIST_ADDRESS_RDESLA(n)     (((n) << EMAC_DMA_CH0_RXDESC_LIST_ADDRESS_RDESLA_SHIFT) & EMAC_DMA_CH0_RXDESC_LIST_ADDRESS_RDESLA_MASK)

/* DMA Channel 0 Tx Descriptor Tail Pointer (DMA_CH0_TXDESC_TAIL_POINTER) */
#define EMAC_DMA_CH0_TXDESC_TAIL_POINTER_TDTP_SHIFT  (2) /* Bits 2-32: Transmit Descriptor Tail Pointer */
#define EMAC_DMA_CH0_TXDESC_TAIL_POINTER_TDTP_MASK   (0x3fffffff << EMAC_DMA_CH0_TXDESC_TAIL_POINTER_TDTP_SHIFT)
#define EMAC_DMA_CH0_TXDESC_TAIL_POINTER_TDTP(n)     (((n) << EMAC_DMA_CH0_TXDESC_TAIL_POINTER_TDTP_SHIFT) & EMAC_DMA_CH0_TXDESC_TAIL_POINTER_TDTP_MASK)

/* DMA Channeli 0 Rx Descriptor List Pointer (DMA_CH0_RXDESC_TAIL_POINTER) */
#define EMAC_DMA_CH0_RXDESC_TAIL_POINTER_RDTP_SHIFT  (2) /* Bits 2-32: Receive Descriptor Tail Pointer */
#define EMAC_DMA_CH0_RXDESC_TAIL_POINTER_RDTP_MASK   (0x3fffffff << EMAC_DMA_CH0_RXDESC_TAIL_POINTER_RDTP_SHIFT)
#define EMAC_DMA_CH0_RXDESC_TAIL_POINTER_RDTP(n)     (((n) << EMAC_DMA_CH0_RXDESC_TAIL_POINTER_RDTP_SHIFT) & EMAC_DMA_CH0_RXDESC_TAIL_POINTER_RDTP_MASK)

/* DMA Channel 0 Tx Descriptor Ring Length (DMA_CH0_TXDESC_RING_LENGTH) */
#define EMAC_DMA_CH0_TXDESC_RING_LENGTH_TDRL_SHIFT  (0) /* Bits 0-10: Transmit Descriptor Ring Length */
#define EMAC_DMA_CH0_TXDESC_RING_LENGTH_TDRL_MASK   (0x3ff << EMAC_DMA_CH0_TXDESC_RING_LENGTH_TDRL_SHIFT)
#define EMAC_DMA_CH0_TXDESC_RING_LENGTH_TDRL(n)     (((n) << EMAC_DMA_CH0_TXDESC_RING_LENGTH_TDRL_SHIFT) & EMAC_DMA_CH0_TXDESC_RING_LENGTH_TDRL_MASK)

/* DMA Channel 0 Rx Descriptor Ring Length (DMA_CH0_RXDESC_RING_LENGTH) */
#define EMAC_DMA_CH0_RXDESC_RING_LENGTH_RDRL_SHIFT  (0) /* Bits 0-10: Receive Descriptor Ring Length */
#define EMAC_DMA_CH0_RXDESC_RING_LENGTH_RDRL_MASK   (0x3ff << EMAC_DMA_CH0_RXDESC_RING_LENGTH_RDRL_SHIFT)
#define EMAC_DMA_CH0_RXDESC_RING_LENGTH_RDRL(n)     (((n) << EMAC_DMA_CH0_RXDESC_RING_LENGTH_RDRL_SHIFT) & EMAC_DMA_CH0_RXDESC_RING_LENGTH_RDRL_MASK)

/* DMA Channel 0 Interrupt Enable (DMA_CH0_INTERRUPT_ENABLE) */
#define EMAC_DMA_CH0_INTERRUPT_ENABLE_TIE   (1 << 0)  /* Bit 0: Transmit Interrupt Enable */
#define EMAC_DMA_CH0_INTERRUPT_ENABLE_TXSE  (1 << 1)  /* Bit 1: Transmit Stopped Enable */
#define EMAC_DMA_CH0_INTERRUPT_ENABLE_TBUE  (1 << 2)  /* Bit 2: Transmit Buffer Unavailable Enable */
#define EMAC_DMA_CH0_INTERRUPT_ENABLE_RIE   (1 << 6)  /* Bit 6: Receive Interrupt Enable */
#define EMAC_DMA_CH0_INTERRUPT_ENABLE_RBUE  (1 << 7)  /* Bit 7: Receive Buffer Unavailable Enable */
#define EMAC_DMA_CH0_INTERRUPT_ENABLE_RSE   (1 << 8)  /* Bit 8: Receive Stopped Enable */
#define EMAC_DMA_CH0_INTERRUPT_ENABLE_RWTE  (1 << 9)  /* Bit 9: Receive Watchdog Timeout Enable */
#define EMAC_DMA_CH0_INTERRUPT_ENABLE_ETIE  (1 << 10) /* Bit 10: Early Transmit Interrupt Enable */
#define EMAC_DMA_CH0_INTERRUPT_ENABLE_ERIE  (1 << 11) /* Bit 11: Early Receive Interrupt Enable */
#define EMAC_DMA_CH0_INTERRUPT_ENABLE_FBEE  (1 << 12) /* Bit 12: Fatal Bus Error Enable */
#define EMAC_DMA_CH0_INTERRUPT_ENABLE_CDEE  (1 << 13) /* Bit 13: Context Descriptor Error Enable */
#define EMAC_DMA_CH0_INTERRUPT_ENABLE_AIE   (1 << 14) /* Bit 14: Abnormal Interrupt Summary Enable */
#define EMAC_DMA_CH0_INTERRUPT_ENABLE_NIE   (1 << 15) /* Bit 15: Normal Interrupt Summary Enable */

/* DMA Channel 0 Rx Interrupt Watchdog Timer
 * (DMA_CH0_RX_INTERRUPT_WATCHDOG_TIMER)
 */

#define EMAC_DMA_CH0_RX_INTERRUPT_WATCHDOG_TIMER_RWT_SHIFT   (0) /* Bits 0-8: Receive Interrupt Watchdog Timer Count */
#define EMAC_DMA_CH0_RX_INTERRUPT_WATCHDOG_TIMER_RWT_MASK    (0xff << EMAC_DMA_CH0_RX_INTERRUPT_WATCHDOG_TIMER_RWT_SHIFT)
#define EMAC_DMA_CH0_RX_INTERRUPT_WATCHDOG_TIMER_RWT(n)      (((n) << EMAC_DMA_CH0_RX_INTERRUPT_WATCHDOG_TIMER_RWT_SHIFT) & EMAC_DMA_CH0_RX_INTERRUPT_WATCHDOG_TIMER_RWT_MASK)
#define EMAC_DMA_CH0_RX_INTERRUPT_WATCHDOG_TIMER_RWTU_SHIFT  (16) /* Bits 16-18: Receive Interrupt Watchdog Timer Count Units */
#define EMAC_DMA_CH0_RX_INTERRUPT_WATCHDOG_TIMER_RWTU_MASK   (0x3 << EMAC_DMA_CH0_RX_INTERRUPT_WATCHDOG_TIMER_RWTU_SHIFT)
#define EMAC_DMA_CH0_RX_INTERRUPT_WATCHDOG_TIMER_RWTU(n)     (((n) << EMAC_DMA_CH0_RX_INTERRUPT_WATCHDOG_TIMER_RWTU_SHIFT) & EMAC_DMA_CH0_RX_INTERRUPT_WATCHDOG_TIMER_RWTU_MASK)

