apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_emac.h
/* DMA Channel 0 Slot Function Control Status
 * (DMA_CH0_SLOT_FUNCTION_CONTROL_STATUS)
 */

#define EMAC_DMA_CH0_SLOT_FUNCTION_CONTROL_STATUS_ESC        (1 << 0) /* Bit 0: Enable Slot Comparison */
#define EMAC_DMA_CH0_SLOT_FUNCTION_CONTROL_STATUS_ASC        (1 << 1) /* Bit 1: Advance Slot Check */
#define EMAC_DMA_CH0_SLOT_FUNCTION_CONTROL_STATUS_SIV_SHIFT  (4)      /* Bits 4-16: Slot Interval Value */
#define EMAC_DMA_CH0_SLOT_FUNCTION_CONTROL_STATUS_SIV_MASK   (0xfff << EMAC_DMA_CH0_SLOT_FUNCTION_CONTROL_STATUS_SIV_SHIFT)
#define EMAC_DMA_CH0_SLOT_FUNCTION_CONTROL_STATUS_SIV(n)     (((n) << EMAC_DMA_CH0_SLOT_FUNCTION_CONTROL_STATUS_SIV_SHIFT) & EMAC_DMA_CH0_SLOT_FUNCTION_CONTROL_STATUS_SIV_MASK)
#define EMAC_DMA_CH0_SLOT_FUNCTION_CONTROL_STATUS_RSN_SHIFT  (16) /* Bits 16-20: Reference Slot Number */
#define EMAC_DMA_CH0_SLOT_FUNCTION_CONTROL_STATUS_RSN_MASK   (0xf << EMAC_DMA_CH0_SLOT_FUNCTION_CONTROL_STATUS_RSN_SHIFT)
#define EMAC_DMA_CH0_SLOT_FUNCTION_CONTROL_STATUS_RSN(n)     (((n) << EMAC_DMA_CH0_SLOT_FUNCTION_CONTROL_STATUS_RSN_SHIFT) & EMAC_DMA_CH0_SLOT_FUNCTION_CONTROL_STATUS_RSN_MASK)

/* DMA Channel 0 Current Application Transmit Descriptor
 * (DMA_CH0_CURRENT_APP_TXDESC)
 */

#define EMAC_DMA_CH0_CURRENT_APP_TXDESC_CURTDESAPTR_SHIFT  (0) /* Bits 0-32: Application Transmit Descriptor Address Pointer */
#define EMAC_DMA_CH0_CURRENT_APP_TXDESC_CURTDESAPTR_MASK   (0xffffffff << EMAC_DMA_CH0_CURRENT_APP_TXDESC_CURTDESAPTR_SHIFT)
#define EMAC_DMA_CH0_CURRENT_APP_TXDESC_CURTDESAPTR(n)     (((n) << EMAC_DMA_CH0_CURRENT_APP_TXDESC_CURTDESAPTR_SHIFT) & EMAC_DMA_CH0_CURRENT_APP_TXDESC_CURTDESAPTR_MASK)

/* DMA Channel 0 Current Application Receive Descriptor
 * (DMA_CH0_CURRENT_APP_RXDESC)
 */

#define EMAC_DMA_CH0_CURRENT_APP_RXDESC_CURRDESAPTR_SHIFT  (0) /* Bits 0-32: Application Receive Descriptor Address Pointer */
#define EMAC_DMA_CH0_CURRENT_APP_RXDESC_CURRDESAPTR_MASK   (0xffffffff << EMAC_DMA_CH0_CURRENT_APP_RXDESC_CURRDESAPTR_SHIFT)
#define EMAC_DMA_CH0_CURRENT_APP_RXDESC_CURRDESAPTR(n)     (((n) << EMAC_DMA_CH0_CURRENT_APP_RXDESC_CURRDESAPTR_SHIFT) & EMAC_DMA_CH0_CURRENT_APP_RXDESC_CURRDESAPTR_MASK)

/* DMA Channel 0 Current Application Transmit Descriptor
 * (DMA_CH0_CURRENT_APP_TXBUFFER)
 */

#define EMAC_DMA_CH0_CURRENT_APP_TXBUFFER_CURTBUFAPTR_SHIFT  (0) /* Bits 0-32: Application Transmit Buffer Address Pointer */
#define EMAC_DMA_CH0_CURRENT_APP_TXBUFFER_CURTBUFAPTR_MASK   (0xffffffff << EMAC_DMA_CH0_CURRENT_APP_TXBUFFER_CURTBUFAPTR_SHIFT)
#define EMAC_DMA_CH0_CURRENT_APP_TXBUFFER_CURTBUFAPTR(n)     (((n) << EMAC_DMA_CH0_CURRENT_APP_TXBUFFER_CURTBUFAPTR_SHIFT) & EMAC_DMA_CH0_CURRENT_APP_TXBUFFER_CURTBUFAPTR_MASK)

/* DMA Channel 0 Current Application Receive Buffer
 * (DMA_CH0_CURRENT_APP_RXBUFFER)
 */

#define EMAC_DMA_CH0_CURRENT_APP_RXBUFFER_CURRBUFAPTR_SHIFT  (0) /* Bits 0-32: Application Receive Buffer Address Pointer */
#define EMAC_DMA_CH0_CURRENT_APP_RXBUFFER_CURRBUFAPTR_MASK   (0xffffffff << EMAC_DMA_CH0_CURRENT_APP_RXBUFFER_CURRBUFAPTR_SHIFT)
#define EMAC_DMA_CH0_CURRENT_APP_RXBUFFER_CURRBUFAPTR(n)     (((n) << EMAC_DMA_CH0_CURRENT_APP_RXBUFFER_CURRBUFAPTR_SHIFT) & EMAC_DMA_CH0_CURRENT_APP_RXBUFFER_CURRBUFAPTR_MASK)

/* DMA Channel 0 Status (DMA_CH0_STATUS) */
#define EMAC_DMA_CH0_STATUS_TI         (1 << 0)  /* Bit 0: Transmit Interrupt */
#define EMAC_DMA_CH0_STATUS_TPS        (1 << 1)  /* Bit 1: Transmit Process Stopped */
#define EMAC_DMA_CH0_STATUS_TBU        (1 << 2)  /* Bit 2: Transmit Buffer Unavailable */
#define EMAC_DMA_CH0_STATUS_RI         (1 << 6)  /* Bit 6: Receive Interrupt */
#define EMAC_DMA_CH0_STATUS_RBU        (1 << 7)  /* Bit 7: Receive Buffer Unavailable */
#define EMAC_DMA_CH0_STATUS_RPS        (1 << 8)  /* Bit 8: Receive Process Stopped */
#define EMAC_DMA_CH0_STATUS_RWT        (1 << 9)  /* Bit 9: Receive Watchdog Timeout */
#define EMAC_DMA_CH0_STATUS_ETI        (1 << 10) /* Bit 10: Early Transmit Interrupt */
#define EMAC_DMA_CH0_STATUS_ERI        (1 << 11) /* Bit 11: Early Receive Interrupt */
#define EMAC_DMA_CH0_STATUS_FBE        (1 << 12) /* Bit 12: Fatal Bus Error */
#define EMAC_DMA_CH0_STATUS_CDE        (1 << 13) /* Bit 13: Context Descriptor Error */
#define EMAC_DMA_CH0_STATUS_AIS        (1 << 14) /* Bit 14: Abnormal Interrupt Summary */
#define EMAC_DMA_CH0_STATUS_NIS        (1 << 15) /* Bit 15: Normal Interrupt Summary */
#define EMAC_DMA_CH0_STATUS_TEB_SHIFT  (16)      /* Bits 16-19: Tx DMA Error Bits */
#define EMAC_DMA_CH0_STATUS_TEB_MASK   (0x7 << EMAC_DMA_CH0_STATUS_TEB_SHIFT)
#define EMAC_DMA_CH0_STATUS_TEB(n)     (((n) << EMAC_DMA_CH0_STATUS_TEB_SHIFT) & EMAC_DMA_CH0_STATUS_TEB_MASK)
#define EMAC_DMA_CH0_STATUS_REB_SHIFT  (19) /* Bits 19-22: Rx DMA Error Bits */
#define EMAC_DMA_CH0_STATUS_REB_MASK   (0x7 << EMAC_DMA_CH0_STATUS_REB_SHIFT)
#define EMAC_DMA_CH0_STATUS_REB(n)     (((n) << EMAC_DMA_CH0_STATUS_REB_SHIFT) & EMAC_DMA_CH0_STATUS_REB_MASK)

/* DMA Channel 0 Miss Frame Counter (DMA_CH0_MISS_FRAME_CNT) */
#define EMAC_DMA_CH0_MISS_FRAME_CNT_MFC_SHIFT  (0) /* Bits 0-11: Dropped Packet Counters Indicates the number of packet counters that DMA drops either because of bus error or because of programming RPF field in DMA_CH${i}_Rx_Control register */
#define EMAC_DMA_CH0_MISS_FRAME_CNT_MFC_MASK   (0x7ff << EMAC_DMA_CH0_MISS_FRAME_CNT_MFC_SHIFT)
#define EMAC_DMA_CH0_MISS_FRAME_CNT_MFC(n)     (((n) << EMAC_DMA_CH0_MISS_FRAME_CNT_MFC_SHIFT) & EMAC_DMA_CH0_MISS_FRAME_CNT_MFC_MASK)
#define EMAC_DMA_CH0_MISS_FRAME_CNT_MFCO       (1 << 15) /* Bit 15: Overflow status of the MFC Counter */

/* DMA Channel 0 Rx Parser Accept Count (DMA_CH0_RXP_ACCEPT_CNT) */
#define EMAC_DMA_CH0_RXP_ACCEPT_CNT_RXPAC_SHIFT  (0) /* Bits 0-31: Rx Parser Accept Counter */
#define EMAC_DMA_CH0_RXP_ACCEPT_CNT_RXPAC_MASK   (0x7fffffff << EMAC_DMA_CH0_RXP_ACCEPT_CNT_RXPAC_SHIFT)
#define EMAC_DMA_CH0_RXP_ACCEPT_CNT_RXPAC(n)     (((n) << EMAC_DMA_CH0_RXP_ACCEPT_CNT_RXPAC_SHIFT) & EMAC_DMA_CH0_RXP_ACCEPT_CNT_RXPAC_MASK)
#define EMAC_DMA_CH0_RXP_ACCEPT_CNT_RXPACOF      (1 << 31) /* Bit 31: Rx Parser Accept Counter Overflow Bit */

/* DMA Channel 0 Rx ERI Count (DMA_CH0_RX_ERI_CNT) */
#define EMAC_DMA_CH0_RX_ERI_CNT_ECNT_SHIFT  (0) /* Bits 0-12: ERI Counter */
#define EMAC_DMA_CH0_RX_ERI_CNT_ECNT_MASK   (0xfff << EMAC_DMA_CH0_RX_ERI_CNT_ECNT_SHIFT)
#define EMAC_DMA_CH0_RX_ERI_CNT_ECNT(n)     (((n) << EMAC_DMA_CH0_RX_ERI_CNT_ECNT_SHIFT) & EMAC_DMA_CH0_RX_ERI_CNT_ECNT_MASK)

