apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_emac.h
/* DMA Channel 1 Rx ERI Count (DMA_CH1_RX_ERI_CNT) */
#define EMAC_DMA_CH1_RX_ERI_CNT_ECNT_SHIFT  (0) /* Bits 0-12: ERI Counter */
#define EMAC_DMA_CH1_RX_ERI_CNT_ECNT_MASK   (0xfff << EMAC_DMA_CH1_RX_ERI_CNT_ECNT_SHIFT)
#define EMAC_DMA_CH1_RX_ERI_CNT_ECNT(n)     (((n) << EMAC_DMA_CH1_RX_ERI_CNT_ECNT_SHIFT) & EMAC_DMA_CH1_RX_ERI_CNT_ECNT_MASK)

#define EMAC_TDES3_CPC(x)        (((uint32_t)(((uint32_t)(x)) << 26U)) & 0x0C000000U)
#define EMAC_TDES3_CIC(x)        (((uint32_t)(((uint32_t)(x)) << 16U)) & 0x00030000U)
#define EMAC_TDES3_OWN_MASK      (0x80000000u)
#define EMAC_TDES3_FD_MASK       (0x20000000u)
#define EMAC_TDES3_LD_MASK       (0x10000000u)

#define EMAC_TDES2_IOC_MASK      (0x80000000u)
#define EMAC_TDES2_TTSE_MASK     (0x40000000u)
#define EMAC_TDES2_B1L_MASK      (0x00003fffu)

#define EMAC_RDES0_IVT_MASK      (0xffff0000u)
#define EMAC_RDES0_IVT_SHIFT     (16u)
#define EMAC_RDES0_OVT_MASK      (0x0000ffffu)

#define EMAC_RDES1_TSA_MASK      (0x00004000u)
#define EMAC_RDES1_IPCE_MASK     (0x00000080u)
#define EMAC_RDES1_IPV6_MASK     (0x00000020u)
#define EMAC_RDES1_IPV4_MASK     (0x00000010u)
#define EMAC_RDES1_IPHE_MASK     (0x00000008u)
#define EMAC_RDES1_PT_MASK       (0x00000007u)

#define EMAC_RDES3_PL_MASK       (0x00007fffu)
#define EMAC_RDES3_OWN_MASK      (0x80000000u)
#define EMAC_RDES3_INTE_MASK     (0x40000000u)
#define EMAC_RDES3_BUF1V_MASK    (0x01000000u)
#define EMAC_RDES3_RS1V_MASK     (0x04000000u)
#define EMAC_RDES3_RS0V_MASK     (0x02000000u)

#define EMAC_RDES3_CTXT_MASK     (0x40000000u)

#define EMAC_INFO1_CONSUMED_MASK (0x00000001u)
#define EMAC_INFO1_LOCKED_MASK   (0x10000000u)
#define EMAC_INFO1_LENGTH_MASK   (0x00003fffu)

/****************************************************************************
 * Public Types
 ****************************************************************************/

/* Buffer Descriptors *******************************************************/

struct eth_desc_s
{
    uint32_t des0;      /* Data length */
    uint32_t des1;      /* Data length */
    uint32_t des2;      /* Data length */
    uint32_t des3;      /* Data length */
};

#endif /* __ARCH_ARM_SRC_S32K3XX_HARDWARE_S32K3XX_EMAC_H */
